{
  "sources": [
    {
      "title": "tonsky.me",
      "feedUrl": "http://tonsky.me/blog/atom.xml",
      "siteUrl": "https://tonsky.me/",
      "articles": []
    },
    {
      "title": "GolangCode",
      "feedUrl": "https://golangcode.com/index.xml",
      "siteUrl": "https://golangcode.com/",
      "articles": []
    },
    {
      "title": "Applied Go",
      "feedUrl": "https://appliedgo.net/index.xml",
      "siteUrl": "https://appliedgo.net/",
      "articles": []
    },
    {
      "title": "Dave Cheney",
      "feedUrl": "https://dave.cheney.net/feed/atom",
      "siteUrl": "https://dave.cheney.net",
      "articles": []
    },
    {
      "title": "David Heinemeier Hansson",
      "feedUrl": "https://world.hey.com/dhh/feed.atom",
      "siteUrl": "https://world.hey.com/dhh",
      "articles": [
        {
          "id": "https://world.hey.com/dhh/learning-to-accept-defeat-against-reality-141fb093",
          "author": null,
          "description": "A great many smart people terminably hamper their ability to better understand the world by refusing to accept defeat when reality proves them wrong. Armed with an intellect that's at once both too proud to recognize it's own failings and cunningly capable of producing sophisticated excuses, they're adapt at spotting this failing in others but not in themselves.\nYou see this all the time in the realm of public policy. Someone presents a plausible thesis on how to deal with a given problem. They drum up support for an attempt that follows their ideas, but when the attempt is defeated by reality, they can't retreat, and become stuck trying to defend the path in ever-more creative yet ludicrous ways.\nWatch the cadre of \"harm reduction\" activists attempt to defend the increasingly decrepit sta…",
          "link": "https://world.hey.com/dhh/learning-to-accept-defeat-against-reality-141fb093",
          "publishedOn": "2023-08-11T10:53:48.000Z",
          "wordCount": 611,
          "title": "Learning to accept defeat against reality",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/turns-out-nobody-cared-about-panel-gaps-914127d5",
          "author": null,
          "description": "One of the most fascinating aspects of Tesla's rise to dominance has been how they discarded many of the traditional values of car making. While the rest of the industry was stuck competing on the size of their panel gaps, and other aspects of precision and quality assembly, Tesla didn't even show up to participate. Their cars are legendary for being delivered with shoddy paint jobs, rattling interiors, and even mismatched doors. But it just didn't matter! Consumers voted with their wallets for poorly built EVs because well-built gas-powered cars were deemed irrelevant in comparison.\nThere's tremendous wisdom for product makers of all kinds in this lesson. It's the epitome of Blue Ocean Strategy. To find a breakthrough angle in commerce, it's as important to decide where you will not compe…",
          "link": "https://world.hey.com/dhh/turns-out-nobody-cared-about-panel-gaps-914127d5",
          "publishedOn": "2023-08-10T11:55:28.000Z",
          "wordCount": 497,
          "title": "Turns out nobody cared about panel gaps",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/the-curing-value-of-creation-98736f9f",
          "author": null,
          "description": "It's hard not to see your spirits lifted when you're part of bringing something to life. Be that a product, an organization, or a community, or all three at once. Like exercise, it's one of those rare avenues of human endeavor that almost invariably will make anyone feel better. And, also like exercise, the hard part is getting started when you need it the most!\nThat's the curious chasm between knowledge and action. As much as you may know that regular, high-intensity training of the body does wonders for the mind, summoning the motivation to follow through with a commitment to working out only gets harder and harder the more you need it. I've had periods in my life where being removed from meaningful acts of creation felt just the same way.\nThose periods were especially depressing when they felt like a simulacra of creation. Being in a situation designed to mimic the motions of making, but bereft of any meaningful progress towards that end. The pretending of purpose. The appearance of collaboration. Without any thrust towards completion.\nAnd just as how getting a positive streak of accomplishment going provides its own momentum to keep at it, so too does a negative streak of performative busyness. It pulls you back into the comfort of the mental couch, and hands you the bag of chips to soothe your nagging sense of uselessness. For every day you stay there, the harder it is to get up, so best to muster everything you got to escape the dulling inertia now.\nMake something. Participate in something. Engage with someone. All of it might feel as unnatural as strapping on those running shoes after too long of a break, but once you're back to creating, the energy comes by itself.",
          "link": "https://world.hey.com/dhh/the-curing-value-of-creation-98736f9f",
          "publishedOn": "2023-08-08T09:52:21.000Z",
          "wordCount": 382,
          "title": "The curing value of creation",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/et-tu-zoom-b90a0a0a",
          "author": null,
          "description": "The corporate cause for return-to-office just claimed its perhaps most ironic victim: Zoom! The company that literally lives to sell us all on the wonders of remote collaboration wants its own people back into the office again. Which I guess is just a regression to the mean of productivity tool makers failing to believe their own marketing, but it's a bit sad none the less.\nNot the least because this push for return-to-office has now been proven completely safe for large tech corporations. Thanks to the mixture of mass layoffs earlier this year and the now numerous proclamations that remote-first is over at the majority of big companies. Safety in sentiment, safety in numbers.\nThis is an opportunistic squeeze, because what's most tech workers supposed to do? The option of simply hopping to another company has been severely limited. Outside the small realm of AI experts, most other domains just aren't anywhere nearly as contested in hiring as they once were. So this is happening now because it can happen now.\nI just hope that people who really did enjoy that remote work-lifetyle don't forget what it was like. The balance of power will presumably turn around one day again, and when it does, voting with your feet will be an option again.\nUntil then, I suspect that the likes of Shopify, Automattic, and other stalwart defenders of remote work will continue to see their openings become increasingly oversubscribed. Just like we've had at 37signals for going on two decades.\nRemote work might be receding, but it's simply too compelling an option for too many to ever disappear. The long-term trend line ain't going anywhere.",
          "link": "https://world.hey.com/dhh/et-tu-zoom-b90a0a0a",
          "publishedOn": "2023-08-07T16:30:48.000Z",
          "wordCount": 357,
          "title": "Et tu, Zoom?",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/not-everyone-can-be-the-best-ef9ebacd",
          "author": null,
          "description": "Many software developers seem to have a uniquely hard time accepting that not everyone who just tries real hard will become so good as to be among the best in this field. That there really is a discrepancy of talent that leads to a discrepancy of competence. That not everyone can or will become equally good at this job.\nIn contrast, nobody seems to have trouble with the fact that not every soccer player who loves the game and trains their best will become eligible for the Premier League. Or that becoming a brain surgeon might indeed really be harder than making it as a general practitioner, which in itself is hard enough too!\nBut becoming a developer can happen without ever really having to face an adversarial examination of your skills. There's no 90-minute clock that ends with a look at …",
          "link": "https://world.hey.com/dhh/not-everyone-can-be-the-best-ef9ebacd",
          "publishedOn": "2023-08-04T09:59:59.000Z",
          "wordCount": 698,
          "title": "Not everyone can be the best",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        }
      ]
    },
    {
      "title": "Jason Fried",
      "feedUrl": "https://world.hey.com/jason/feed.atom",
      "siteUrl": "https://world.hey.com/jason",
      "articles": [
        {
          "id": "https://world.hey.com/jason/admiration-makes-the-team-a26570c3",
          "author": null,
          "description": "When people talk about great teams, they'll talk about hard work, trust, respect, looking out for one another, etc. All good things.\nBut there's one quality amongst teammates on great teams that often goes unrecognized by all but the most astute organizational observers: Admiration.\nGreat teams are made of people who *admire* one another's talents, skills, character, and contributions. Great teams are mutual admiration societies who get to work together.\nAdmiration is the critical, silent variable in the powerful formula that equals exceptional teamwork.\n\n-Jason",
          "link": "https://world.hey.com/jason/admiration-makes-the-team-a26570c3",
          "publishedOn": "2023-08-24T22:40:16.000Z",
          "wordCount": 156,
          "title": "Admiration makes the team",
          "imageUrl": "https://world.hey.com/jason/avatar-9f11ce77d31e68e834c564594ee0bc32a005ee8d"
        },
        {
          "id": "https://world.hey.com/jason/scatter-8a4a1e4a",
          "author": null,
          "description": "Scatter.\n\n\nScatter is the silent killer at work.\n\n\nScatter is tools siloed by teams.\n\n\nScatter is multiple apps to do one thing.\n\n\nScatter is doing the same thing at the same time in multiple places.\n\n\nScatter is asking around rather than doing it right now.\n\n\nScatter is pulling people off this to jump on that.\n\n\nScatter is wondering where something is rather than knowing where it lives.\n\n\nScatter is repeating yourself.\n\n\nScatter is dependencies.\n\n\nScatter is looking but not paying attention.\n\n\nScatter is intracompany fiefdoms defending themselves.\n\n\nScatter is attempted multitasking.\n\n\nScatter is waiting around for something else to happen first.\n\n\nScatter is multiple monitors.\n\n\nScatter is being busy without making progress.\n\n\nScatter is principles on the wall that no one believes.\n\n\nScatter is a backlog of ideas you'll never get to.\n\n\nScatter are far off promises you made because it was easier than saying no.\n\n\nScatter is looking back at your day and wondering where it all went.\n\n\nScatter is conceptual engines burning in opposite directions.\nScatter is a huge, invisible liability you'll never see on your balance sheet.\n\n\nScatter is what scatter does.\nScatter has its place as long as it's not the steady state.\n\n\n-Jason",
          "link": "https://world.hey.com/jason/scatter-8a4a1e4a",
          "publishedOn": "2023-08-23T19:30:11.000Z",
          "wordCount": 243,
          "title": "Scatter",
          "imageUrl": "https://world.hey.com/jason/avatar-9f11ce77d31e68e834c564594ee0bc32a005ee8d"
        }
      ]
    },
    {
      "title": "The Plain Text Project",
      "feedUrl": "https://plaintextproject.online/feed.xml",
      "siteUrl": "https://plaintextproject.online",
      "articles": []
    },
    {
      "title": "Andrew Kelley",
      "feedUrl": "https://andrewkelley.me/rss.xml",
      "siteUrl": "https://andrewkelley.me/",
      "articles": [
        {
          "id": "https://andrewkelley.me/post/goodbye-twitter-reddit.html",
          "author": null,
          "description": "So Long, Twitter and Reddit\nIt's been over three years since my last blog post. I think that\nthe website code started to feel like it had bitrotted, and so making new blog\nposts became onerous. But I've taken the time to redo this website\nusing Zig, so it's quite easy to add blog\nposts now, and plus I added\ndark mode.\nTwitter\nOver the past few years I amassed a healthy number of followers on Twitter by posting\nscreenshots, demos, and small progress updates for the Zig programming language. It\nfelt good to gain an audience and have my perspective and efforts weighed more heavily in\nthe court of public opinion.\nHowever, I always knew that it would need to end. It's not really possible to use Twitter\nwithout at least a little bit of doomscrolling, and that activity took a toll on me emotional…",
          "link": "https://andrewkelley.me/post/goodbye-twitter-reddit.html",
          "publishedOn": "2023-08-23T22:05:07.000Z",
          "wordCount": 1247,
          "title": "So Long, Twitter and Reddit",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Martin Fowler",
      "feedUrl": "https://martinfowler.com/feed.atom",
      "siteUrl": "https://martinfowler.com/feed.atom",
      "articles": [
        {
          "id": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#RespondingToTheEverChangingFuture",
          "author": null,
          "description": "Sarah Taraporewalla completes her study of building a\n     technology strategy that's integrated with strategic business interests.\n     This final strategic direction considers the ever-changing future,\n     suggesting lines of inquiry to consider the impact of new\n     technologies, market trends, and broader social-political changes. \nmore…",
          "link": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#RespondingToTheEverChangingFuture",
          "publishedOn": "2023-08-24T13:44:00.000Z",
          "wordCount": 10474,
          "title": "Technology Strategy for Emerging Technologies and Markets",
          "imageUrl": "https://martinfowler.com/articles/creating-integrated-tech-strategy/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/demo-front-end.html",
          "author": null,
          "description": "Many software teams create services exposed as APIs, designed to be\n     consumed by other software and thus without any user-interface. Such\n     services are hard to demonstrate, as they effectively just dump pages of\n     JSON. A demo front-end is a simple user-interface just used to\n     manipulate such an API. Matteo Vaccari describes how and\n     why to build one - showing its usefulness both in explaining the\n     API's capabilities to stakeholders and to help client developers explore\n     how to interact with the API.\nmore…",
          "link": "https://martinfowler.com/articles/demo-front-end.html",
          "publishedOn": "2023-08-23T14:37:00.000Z",
          "wordCount": 2565,
          "title": "Demo Front-End: A front-end application to test and explore an API",
          "imageUrl": "https://martinfowler.com/articles/demo-front-end/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#SupportingThePeople",
          "author": null,
          "description": "Having a robust digital talent strategy is a competitive advantage in\n     today’s fiercely competitive market. This enables businesses to have the\n     right talent and have the right competencies to meet current and future\n     demand to meet business goals or to stay on track for digital\n     transformation aspirations. Sarah Taraporewalla continues\n     her article on how to create an integrated business and technology strategy\n     by looking at questions raised by two strategic directions that\n     support people: culture and internal systems.\nmore…",
          "link": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#SupportingThePeople",
          "publishedOn": "2023-08-22T15:22:00.000Z",
          "wordCount": 9504,
          "title": "Strategic Directions supporting the people",
          "imageUrl": "https://martinfowler.com/articles/creating-integrated-tech-strategy/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/bottlenecks-of-scaleups/05-resilience-and-observability.html",
          "author": null,
          "description": "Here is a new article in the bottlenecks of scaleups series, looking at\n     resilience and observability. Startups tend to only address resilience when\n     their systems are already down, often taking a very reactive approach. For\n     a scaleup, excessive system downtime represents a significant\n     bottleneck to the organization, both from the effort expended on\n     restoring function and also from the impact of customer dissatisfaction.\n     Punit Lad and Carl Nygard explain that to\n     move past this, resilience needs to be built into the business objectives,\n     which will influence the architecture, design, product management, and even\n     governance of business systems. \nmore…",
          "link": "https://martinfowler.com/articles/bottlenecks-of-scaleups/05-resilience-and-observability.html",
          "publishedOn": "2023-08-22T14:21:00.000Z",
          "wordCount": 7837,
          "title": "Bottlenecks of Scaleups #05: Resilience and Observability",
          "imageUrl": "https://martinfowler.com/articles/bottlenecks-of-scaleups/card-resilience-observability.png"
        },
        {
          "id": "https://martinfowler.com/articles/exploring-gen-ai.html#memo-06",
          "author": null,
          "description": "At Thoughtworks, we are strong practitioners of Test Driven Development (TDD).\n     Naturally this leads to the question of how generative AI can help with\n     this technique. Paul Sobocinski writes a brief memo\n     explaining how some of our teams have used TDD with GitHub\n     Copilot. As ever, co-pilot can't be relied on to fly the plane, but\n     can suggest some useful ideas for the red and green steps. It isn't\n     very helpful for the all-important refactoring step.\nmore…",
          "link": "https://martinfowler.com/articles/exploring-gen-ai.html#memo-06",
          "publishedOn": "2023-08-17T18:44:00.000Z",
          "wordCount": 5691,
          "title": "TDD with GitHub Copilot",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#ReviewAndGovernTechnologyPortfolio",
          "author": null,
          "description": "Sofia Tania  and  Stefania\n       Stefansdottir complete their examination of how to overcome the\n       bottleneck that costs impose on a scaleup. In this final installment,\n       they look at how to review and govern the technology portfolio,\n       optimize rates, and provide a general view of cost efficiency initiatives\n       during the life-cycle of a scaleup.\nmore…",
          "link": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#ReviewAndGovernTechnologyPortfolio",
          "publishedOn": "2023-08-17T00:00:00.000Z",
          "wordCount": 7371,
          "title": "Final parts of the cost bottleneck of scaleups",
          "imageUrl": "https://martinfowler.com/articles/bottlenecks-of-scaleups/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#risk",
          "author": null,
          "description": "Time for two more strategic directions from Sarah\n     Taraporewalla. These look at the questions that need to be investigated when\n     reducing cost, minimizing operation risk, and enabling data-driven decision\n     making.\nmore…",
          "link": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#risk",
          "publishedOn": "2023-08-16T19:49:00.000Z",
          "wordCount": 7866,
          "title": "Strategic directions: minimizing risk and being data driven",
          "imageUrl": "https://martinfowler.com/articles/creating-integrated-tech-strategy/card.png"
        },
        {
          "id": "https://www.thoughtworks.com/about-us/events/webinars/scaling-bottlenecks--technology-mistakes-every-growing-startup-m",
          "author": null,
          "description": "Join Tim Cochran and Rickey Zachery on Thursday, September 7th 1-2pm EST\n     for a webinar on Bottlenecks of\n     Scaleups: Technology mistakes every growing startup makes. They researched\n     Thoughtwork's portfolio to analyze why companies struggle to scale,\n     spanning across Technology, People, and Product. Covering areas such as\n     experimentation culture, overcomplicated architectures, onboarding,\n     developer productivity, product and engineering collaboration, and cost\n     efficiency.\nmore…",
          "link": "https://www.thoughtworks.com/about-us/events/webinars/scaling-bottlenecks--technology-mistakes-every-growing-startup-m",
          "publishedOn": "2023-08-15T18:35:00.000Z",
          "wordCount": 1060,
          "title": "Bottlenecks of Scaleups Webinar: Sep 7 2023",
          "imageUrl": "https://www.thoughtworks.com/content/dam/thoughtworks/images/photography/meta/about-us/ab_meta_scaling_bottlenecks2.jpg"
        },
        {
          "id": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#BuildingAStrongFoundation",
          "author": null,
          "description": "Any business that wants to grow needs to be built on strong and stable\n     foundations. While these strategic directions are often familiar to\n     technical folks it's important that the improvements to engineering align\n     with the themes that resonate with the rest of the organization.\n     Sarah Taraporewalla illustrates how this appears with two\n     strategic directions that consider improvements in efficiency and quality.\nmore…",
          "link": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#BuildingAStrongFoundation",
          "publishedOn": "2023-08-15T14:16:00.000Z",
          "wordCount": 6389,
          "title": "Strategic directions to build a strong foundation",
          "imageUrl": "https://martinfowler.com/articles/creating-integrated-tech-strategy/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#SustainPhase",
          "author": null,
          "description": "When scaling up, getting costs under control is vital to stabilizing\n       financial health. But as a weight-loss expert might say, the key to\n       long-term health is to do things that promote a sustainable lifestyle.\n       Sofia Tania  and  Stefania\n       Stefansdottir now move on to begin to describe these\n       initiatives: federated accountability, visibility, and nudges\n       towards better financial discipline.\n       \nmore…",
          "link": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#SustainPhase",
          "publishedOn": "2023-08-15T14:15:00.000Z",
          "wordCount": 6073,
          "title": "Actions to sustain cost control for scaleups",
          "imageUrl": "https://martinfowler.com/articles/bottlenecks-of-scaleups/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/202308-stefan-tilkov.html",
          "author": null,
          "description": "We are saddened today to learn of the passing of Stefan Tilkov. We’ve met Stefan several times at workshops and conferences and always enjoyed his good company and insightful views. He advocated many of the things that we and our colleagues support - and as well as skillfully explaining these ideas, he also backed them up with concrete experience from his work. We shall really miss his wise contributions online, and regret that we won’t get the chance to chat with him again. We offer our condolences to his family, friends, and colleagues at INNOQ.\nBirgitta Boeckeler\nErik Dörnenburg\nNeal Ford\nMartin Fowler\nJames Lewis\nRebecca Parsons\nDaniel Terhorst-North",
          "link": "https://martinfowler.com/articles/202308-stefan-tilkov.html",
          "publishedOn": "2023-08-14T18:58:00.000Z",
          "wordCount": 216,
          "title": "We will miss Stefan Tilkov",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#ReducePhase",
          "author": null,
          "description": "When scaleups need to start working on cost efficiency, our experience\n       is that they need to form a cost optimization team to work on the\n       immediate steps that are needed. In this installment Sofia and\n       Stefania describe how to understand the primary cost drivers,\n       together with the levers to get them under control. \nmore…",
          "link": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#ReducePhase",
          "publishedOn": "2023-08-10T15:17:00.000Z",
          "wordCount": 4476,
          "title": "First stage of reducing costs for a scaleup",
          "imageUrl": "https://martinfowler.com/articles/bottlenecks-of-scaleups/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#expand-segments",
          "author": null,
          "description": "Sarah Taraporewalla moves on to the remaining two\n     strategic directions that are part of growing the business.\n     Expanding into new customer segments can introduce new operational\n     processes or channels. Inorganic growth (eg acquisitions and mergers) needs\n     an understanding of the drivers of increased value and the long term\n     expectation (eg merge or keep separate and divest) for the business unit. \nmore…",
          "link": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#expand-segments",
          "publishedOn": "2023-08-10T14:12:00.000Z",
          "wordCount": 4345,
          "title": "Tech strategy for new customer segments and inorganic growth",
          "imageUrl": "https://martinfowler.com/articles/creating-integrated-tech-strategy/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/exploring-gen-ai.html#memo-05",
          "author": null,
          "description": "In her 5th memo about exploring GenAI for software development,\n      Birgitta Böckeler answers the frequently asked question if\n      coding assistants are making the practice of Pair Programming\n      obsolete. Spoiler alert: They don't.\nmore…",
          "link": "https://martinfowler.com/articles/exploring-gen-ai.html#memo-05",
          "publishedOn": "2023-08-10T13:31:00.000Z",
          "wordCount": 4578,
          "title": "Coding assistants do not replace pair programming",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html",
          "author": null,
          "description": "My colleague Sarah Taraporewalla describes an approach\n     to building technology strategy that challenges the convention. It starts\n     by identifying the overall strategic directions that the organization is\n     considering, and using common aspects of these directions to indicate the\n     investigations needed for the organization to understand the technology\n     implications raised by that strategic change. This first\n     installment looks at two of these directions: expanding the business\n     by creating complementary products, and expanding the business into new\n     markets and regions. \nmore…",
          "link": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html",
          "publishedOn": "2023-08-08T10:35:00.000Z",
          "wordCount": 2802,
          "title": "Creating an integrated business and technology strategy",
          "imageUrl": "https://martinfowler.com/articles/creating-integrated-tech-strategy/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/exploring-gen-ai.html#in-line-assistance---how-can-it-get-in-the-way?",
          "author": null,
          "description": "While coding assistants like Copilot can improve speed and flow, they\n     can also disrupt it. Birgitta Böckeler looks at two ways\n     in which they can get in the way: amplifying bad or outdated\n     practices, and review fatigue.\nmore…",
          "link": "https://martinfowler.com/articles/exploring-gen-ai.html#in-line-assistance---how-can-it-get-in-the-way?",
          "publishedOn": "2023-08-03T15:37:00.000Z",
          "wordCount": 4050,
          "title": "Exploring Gen AI: how can in-line assistance get in the way?",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#exit",
          "author": null,
          "description": "Sofia and Stefania begin their examination of how to\n     get out of the bottleneck of surging cloud costs by relating a case study\n     from a recent client - illustrating how the cost control can be separated\n     into reduce and sustain phases.\nmore…",
          "link": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#exit",
          "publishedOn": "2023-08-01T14:19:00.000Z",
          "wordCount": 2494,
          "title": "A case study of getting out of the costs bottleneck",
          "imageUrl": "https://martinfowler.com/articles/bottlenecks-of-scaleups/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/exploring-gen-ai.html#in-line-assistance---when-is-it-more-useful?",
          "author": null,
          "description": "The most widely used form of coding assistance in Thoughtworks at the\n     moment is in-line code generation in the IDE, where an IDE extension\n     generates suggestions for the developer as they are typing.\n     Birgitta Böckeler looks at the factors that\n     impact the usefulness of these suggestions, indicating where they\n     lead to safe waters, and the rocks that we need to look out for.\nmore…",
          "link": "https://martinfowler.com/articles/exploring-gen-ai.html#in-line-assistance---when-is-it-more-useful?",
          "publishedOn": "2023-08-01T13:51:00.000Z",
          "wordCount": 3272,
          "title": "Exploring Gen AI: When is in-line assistance useful?",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        }
      ]
    },
    {
      "title": "Adam Wathan's Work Journal",
      "feedUrl": "https://adamwathan.me/journal/rss.xml",
      "siteUrl": "https://adamwathan.me/journal",
      "articles": []
    },
    {
      "title": "Rust Blog",
      "feedUrl": "https://blog.rust-lang.org/feed.xml",
      "siteUrl": "https://blog.rust-lang.org/",
      "articles": [
        {
          "id": "https://blog.rust-lang.org/2023/08/30/electing-new-project-directors.html",
          "author": null,
          "description": "Today we are launching the process to elect new Project Directors to the Rust Foundation Board of Directors.\nAs we begin the process, we wanted to spend some time explaining the goals and procedures we will follow.\nWe will summarize everything here, but if you would like to you can read the official process documentation.\nWe ask all project members to begin working with their Leadership Council representative to nominate potential Project Directors. See the Candidate Gathering section for more details. Nominations are due by September 15, 2023.\nWhat are Project Directors?\nThe Rust Foundation Board of Directors has five seats reserved for Project Directors.\nThese Project Directors serve as representatives of the Rust project itself on the Board.\nLike all Directors, the Project Directors are…",
          "link": "https://blog.rust-lang.org/2023/08/30/electing-new-project-directors.html",
          "publishedOn": "2023-08-30T00:00:00.000Z",
          "wordCount": 938,
          "title": "Electing New Project Directors",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/2023/08/29/committing-lockfiles.html",
          "author": null,
          "description": "For years, the Cargo team has encouraged Rust developers to\ncommit their Cargo.lock file for packages with binaries but not libraries.\nWe now recommend people\ndo what is best for their project.\nTo help people make a decision, we do include some considerations and suggest\ncommitting Cargo.lock as a starting point in their decision making.\nTo align with that starting point, cargo new will no longer ignore\nCargo.lock for libraries as of nightly-2023-08-24.\nRegardless of what decision projects make, we encourage regular\ntesting against their latest dependencies.\nBackground\nThe old guidelines ensured libraries tested their latest dependencies which\nhelped us keep quality high within Rust's package ecosystem by ensuring issues,\nespecially backwards compatibility issues,\nwere quickly found and ad…",
          "link": "https://blog.rust-lang.org/2023/08/29/committing-lockfiles.html",
          "publishedOn": "2023-08-29T00:00:00.000Z",
          "wordCount": 541,
          "title": "Change in Guidance on Committing Lockfiles",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/2023/08/24/Rust-1.72.0.html",
          "author": null,
          "description": "The Rust team is happy to announce a new version of Rust, 1.72.0. Rust is a programming language empowering everyone to build reliable and efficient software.\nIf you have a previous version of Rust installed via rustup, you can get 1.72.0 with:\nrustup update stable\n\nIf you don't have it already, you can get rustup from the appropriate page on our website, and check out the detailed release notes for 1.72.0 on GitHub.\nIf you'd like to help us out by testing future releases, you might consider updating locally to use the beta channel (rustup default beta) or the nightly channel (rustup default nightly). Please report any bugs you might come across!\nWhat's in 1.72.0 stable\nRust reports potentially useful cfg-disabled items in errors\nYou can conditionally enable Rust code using cfg, such as to…",
          "link": "https://blog.rust-lang.org/2023/08/24/Rust-1.72.0.html",
          "publishedOn": "2023-08-24T00:00:00.000Z",
          "wordCount": 866,
          "title": "Announcing Rust 1.72.0",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/2023/08/07/Rust-Survey-2023-Results.html",
          "author": null,
          "description": "Hello, Rustaceans!\nFor the 6th year in a row, the Rust Project conducted a survey on the Rust programming language, with participation from project maintainers, contributors, and those generally interested in the future of Rust. This edition of the annual State of Rust Survey opened for submissions on December 5 and ran until December 22, 2022.\nFirst, we'd like to thank you for your patience on these long delayed results. We hope to identify a more expedient and sustainable process going forward so that the results come out more quickly and have even more actionable insights for the community.\nThe goal of this survey is always to give our wider community a chance to express their opinions about the language we all love and help shape its future. We’re grateful to those of you who took the …",
          "link": "https://blog.rust-lang.org/2023/08/07/Rust-Survey-2023-Results.html",
          "publishedOn": "2023-08-07T00:00:00.000Z",
          "wordCount": 1292,
          "title": "2022 Annual Rust Survey Results",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/2023/08/03/Rust-1.71.1.html",
          "author": null,
          "description": "The Rust team has published a new point release of Rust, 1.71.1. Rust is a\nprogramming language that is empowering everyone to build reliable and\nefficient software.\nIf you have a previous version of Rust installed via rustup, getting Rust\n1.71.1 is as easy as:\nrustup update stable\n\nIf you don't have it already, you can get rustup from the\nappropriate page on our website.\nWhat's in 1.71.1 stable\nRust 1.71.1 fixes Cargo not respecting the umask when extracting dependencies,\nwhich could allow a local attacker to edit the cache of extracted source code\nbelonging to another local user, potentially executing code as another user.\nThis security vulnerability is tracked as CVE-2023-38497, and you can read\nmore about it on the advisory we published earlier today. We\nrecommend all users to update their toolchain as soon as possible.\nRust 1.71.1 also addresses several regressions introduced in Rust 1.71.0,\nincluding bash completion being broken for users of Rustup, and the\nsuspicious_double_ref_op being emitted when calling borrow() even though it\nshouldn't.\nYou can find more detailed information on the specific regressions, and other\nminor fixes, in the release notes.\nContributors to 1.71.1\nMany people came together to create Rust 1.71.1. We couldn't have done it\nwithout all of you. Thanks!",
          "link": "https://blog.rust-lang.org/2023/08/03/Rust-1.71.1.html",
          "publishedOn": "2023-08-03T00:00:00.000Z",
          "wordCount": 277,
          "title": "Announcing Rust 1.71.1",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/2023/08/03/cve-2023-38497.html",
          "author": null,
          "description": "This is a cross-post of the official security advisory. The\nofficial advisory contains a signed version with our PGP key, as well.\nThe Rust Security Response WG was notified that Cargo did not respect the umask\nwhen extracting crate archives on UNIX-like systems. If the user downloaded a\ncrate containing files writeable by any local user, another local user could\nexploit this to change the source code compiled and executed by the current\nuser.\nThis vulnerability has been assigned CVE-2023-38497.\nOverview\nIn UNIX-like systems, each file has three sets of permissions: for the user\nowning the file, for the group owning the file, and for all other local users.\nThe \"umask\" is configured on most systems to limit those permissions\nduring file creation, removing dangerous ones. For example, the de…",
          "link": "https://blog.rust-lang.org/2023/08/03/cve-2023-38497.html",
          "publishedOn": "2023-08-03T00:00:00.000Z",
          "wordCount": 585,
          "title": "Security advisory for Cargo (CVE-2023-38497)",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        }
      ]
    },
    {
      "title": "Inside Rust Blog",
      "feedUrl": "https://blog.rust-lang.org/inside-rust/feed.xml",
      "siteUrl": "https://blog.rust-lang.org/inside-rust/",
      "articles": [
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/08/29/leadership-council-membership-changes.html",
          "author": null,
          "description": "As of today, Khionu Sybiern will no longer be the representative of the Moderation team on the\nLeadership Council, and she is also stepping down from the Moderation Team entirely, for personal\nreasons. She hopes to return to contributing in the future. Josh Gould will be joining the\nLeadership Council as the Moderation Team representative.\nWe thank Khionu for her extensive time and incredibly important contributions to the Moderation\nTeam and the Leadership Council. We wish her the best, and that she returns to the Rust community\nwhen she's ready. We thank Josh for being able to fill the Leadership Council role and look forward\nto working with them!\nWe had already begun working on growing the essential Moderation Team before; because of that and\nKhio stepping down, we are also pleased to announce that Oliver Scherer (oli-obk) has joined the\nModeration Team. Please join us in welcoming Oli!",
          "link": "https://blog.rust-lang.org/inside-rust/2023/08/29/leadership-council-membership-changes.html",
          "publishedOn": "2023-08-29T00:00:00.000Z",
          "wordCount": 226,
          "title": "Leadership Council Membership Changes",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/08/25/leadership-initiatives.html",
          "author": null,
          "description": "Having not heard any significant disagreement with the first set of proposed priorities,\nwe are moving ahead with forming subgroups that will work towards defining and\ncompleting the work needed to drive these forward. We plan to re-assess\npriorities regularly, but for now these are our main work items (in no\nparticular order). We have some initial volunteers who will be pushing these\ninitiatives forward, but for all of these we are also looking for support from\nany interested people. Please reach out on Zulip in #council if\nyou'd like to help out with any of these in some capacity, or to the initial\nvolunteers called out here.\nEstablishing plans for how to strengthen the moderation team (i.e., 2 is not a sustainable number) and strengthen moderation policies.\n\nJosh Gould is leading, with support from Eric Holk. Their top priority is finding additional moderators and forming a contingent moderator team.\nFiguring out the \"shape\" of the Rust Project. The Leadership Council needs to reflect the will of the Rust Project so it is important to know who that includes.\n\nEric Huss is leading, with support from Jack Huey. They're working on defining the initial set of priorities here now.\nDocumenting and improving processes for interaction with the Rust Foundation including formalising the role of project directors in this process (the trademark policy process may be part of this).\n\nWe are looking for someone to help lead this initiative, with support from Mark Rousskov and Ryan Levick, two of the current  project directors. One of the proposed first concrete deliverables might be working towards a path forward on the trademark issue, using that as a stepping stone to defining broader policies. We're intentionally looking for someone not directly involved previously to help give an outside perspective as the lead.\nPlease reach out if you're interested in helping!",
          "link": "https://blog.rust-lang.org/inside-rust/2023/08/25/leadership-initiatives.html",
          "publishedOn": "2023-08-25T00:00:00.000Z",
          "wordCount": 389,
          "title": "Seeking help for initial Leadership Council initiatives",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/08/24/cargo-config-merging.html",
          "author": null,
          "description": "Cargo will be changing the order of merged configuration arrays, and we are looking for people to help test this change and provide feedback.\nWhen an array in Cargo's configuration is defined in multiple places, the elements are merged together. The order that the elements were merged was inconsistent with how other configuration types were merged together, and was not working as expected.\nThe new merging order will match the precedence order of non-array configuration, with higher-precedence configuration being placed later in the array.\nIn the case of build.rustflags, this resolves the confusing situation where higher precedence flags (in a project's config.toml) are overridden with lower precedence flags (in the global $CARGO_HOME, for example).\nThis may result in behavior changes if a …",
          "link": "https://blog.rust-lang.org/inside-rust/2023/08/24/cargo-config-merging.html",
          "publishedOn": "2023-08-24T00:00:00.000Z",
          "wordCount": 493,
          "title": "Cargo changes how arrays in config are merged",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/08/21/1.72.0-prerelease.html",
          "author": null,
          "description": "The 1.72.0 pre-release is ready for testing. The release is scheduled for\nAugust 24. Release notes can be found here.\nYou can try it out locally by running:\nRUSTUP_DIST_SERVER=https://dev-static.rust-lang.org rustup update stable\n\nThe index is https://dev-static.rust-lang.org/dist/2023-08-21/index.html.\nYou can leave feedback on the internals thread.\nThe release team is also thinking about changes to our pre-release process:\nwe'd love your feedback on this GitHub issue.",
          "link": "https://blog.rust-lang.org/inside-rust/2023/08/21/1.72.0-prerelease.html",
          "publishedOn": "2023-08-21T00:00:00.000Z",
          "wordCount": 139,
          "title": "1.72.0 pre-release testing",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/08/02/rotating-compiler-leads.html",
          "author": null,
          "description": "As initiated in late 2020 and ratified by RFC 3262, the Rust compiler team uses a rotating system of co-leads.\nAfter two and a half years, we've decided its time to rotate the leadership again!\nWelcome David Wood\nFelix Klock is stepping down from his role as senior lead and David Wood is joining Wesley Wiser as the new junior lead for the team.\nFelix remains a valued member of the compiler team (and also the language design team).\nFelix will be focusing on reducing the sizes of Rust futures, and on improving the state of the art for authoring Unsafe Rust, via projects such as Krabcake.\nDavid has been a contributor to the Rust project since 2017, a compiler-contributor since 2019 and became a compiler team member in 2021.\nHis contributions include work on the diagnostic translation effort, split DWARF support, polymorphisation, non-lexical lifetimes initiative and general maintenance to the compiler.\nDavid has also been a contributor to the governance and organization of the compiler team itself via policy proposals and regular participation in our weekly triage and steering meetings.\nFelix and I are excited to welcome David into this leadership role and I am thrilled to be working alongside him.",
          "link": "https://blog.rust-lang.org/inside-rust/2023/08/02/rotating-compiler-leads.html",
          "publishedOn": "2023-08-02T00:00:00.000Z",
          "wordCount": 281,
          "title": "Rotating Rust compiler team leadership",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        }
      ]
    },
    {
      "title": "Jorge Manrubia",
      "feedUrl": "https://world.hey.com/jorge/feed.atom",
      "siteUrl": "https://world.hey.com/jorge",
      "articles": [
        {
          "id": "https://world.hey.com/jorge/difficult-and-complex-8b3bcc2f",
          "author": null,
          "description": "There is complex and there is difficult, they are not the same. \n\n\nBeing able to run a marathon is very difficult. But what you have to do to prepare is simple. A small sheet of paper is enough to describe the steps. You will need tremendous effort and discipline - so it’s hard - but it is simple.\n\n\nSoftware development is different: it is also complex.\n\n\nA common theme in my articles on how we do Rails at 37signals is how facing software development with rigid recipes is naive and counterproductive. A good example is services: using a service for everything is a simple idea; applying domain-driven design and object orientation is not. Another manifestation is banning techniques because they can be harmful: concerns, accessing the database from models, callbacks, globals, etc. Ironically, the alternative critics usually recommend for those is using services.\n\n\nIn software, you must take a Babylonian body of knowledge, combine it with your own experience, and apply the result to make countless daily decisions. And of all this for a problem you can’t understand without solving it first. Rigidity doesn’t work, and – because this is a game of intricate complexity – it yields more harm than benefit. You need to embrace nuance.\n\n\nMind the recipes you follow.\n\n---\njorgemanrubia.com",
          "link": "https://world.hey.com/jorge/difficult-and-complex-8b3bcc2f",
          "publishedOn": "2023-08-11T11:10:12.000Z",
          "wordCount": 258,
          "title": "Difficult and complex",
          "imageUrl": "https://world.hey.com/jorge/avatar-d08cb3ee63ecbd49736f76ee2caffa4c99a1c0fd"
        }
      ]
    },
    {
      "title": "Notes on software development",
      "feedUrl": "https://notes.eatonphil.com/rss.xml",
      "siteUrl": "http://notes.eatonphil.com/",
      "articles": [
        {
          "id": "http://notes.eatonphil.com/2023-08-15-thinking-about-functional-programming.html",
          "author": null,
          "description": "Someone on Discord asked about how to learn functional programming.\nThe question and my initial tweet on the subject prompted an\ninteresting\ndiscussion\nwith Shriram\nKrishnamurthi and other folks.\nSo here's a slightly more thought out exploration.\nAnd just for backstory sake: I spent a few years a while\nago programming in\nStandard ML and I wrote\na chunk of a Scheme\n  implementation. I'm not an expert, but I have a bit of background.\nHey, this is a free opinion.\nConcepts from functional programming\nWhen people talk about functional programming, I think of a few key\nchoices you can make while programming:\nImmutability by default\n(Tail) recursion by default\nFirst-class functions (and the suite of tools that go along with it. e.g. map, reduce/fold)\nAnd if you have experience as a programmer, yo…",
          "link": "http://notes.eatonphil.com/2023-08-15-thinking-about-functional-programming.html",
          "publishedOn": "2023-08-15T00:00:00.000Z",
          "wordCount": 2744,
          "title": "Thinking about functional programming",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "CoRecursive: Coding Stories",
      "feedUrl": "https://corecursive.libsyn.com/feed",
      "siteUrl": "http://corecursive.com",
      "articles": [
        {
          "id": "f2245ac3-a554-43ca-a0f1-14bac7674e2b",
          "author": null,
          "description": "Learning to code can feel impossible. Like facing a sheer rock wall with no ropes or harnesses. But what if there was a path up the mountain? A trail blazed smooth by master coders who went before? \n In this episode, we'll follow that path. We'll hear the stories of legends like Seymour Papert, who championed active, project-based learning. Of Fred Brooks, who discovered that pairing accelerates learning. And more. \n The research shows that with the right methods, motivation, and support, anyone can master learning curves and summit. So join me as we uncover the science behind learning to code. You'll walk away fired up, equipped with proven techniques to unlock your potential and conquer new technical skills. \n  \n  The climb is on!  \n  \nEpisode Page\n Support The Show\n Subscribe To The Podcast\n Join The Newsletter",
          "link": "https://corecursive.com/the-science-of-learning-to-code/",
          "publishedOn": "2023-08-02T10:00:00.000Z",
          "wordCount": null,
          "title": "The Science of Learning to Code",
          "itunes": {
            "duration": "50:45"
          },
          "enclosure": {
            "length": "74229971",
            "type": "audio/mpeg",
            "url": "https://chtbl.com/track/7D91G/traffic.libsyn.com/secure/corecursive/091-Learning_Research.mp3?dest-id=628353"
          },
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Notes on software development",
      "feedUrl": "https://notes.eatonphil.com/rss.xml",
      "siteUrl": "http://notes.eatonphil.com/",
      "articles": [
        {
          "id": "http://notes.eatonphil.com/2023-08-15-thinking-about-functional-programming.html",
          "author": null,
          "description": "Someone on Discord asked about how to learn functional programming.\nThe question and my initial tweet on the subject prompted an\ninteresting\ndiscussion\nwith Shriram\nKrishnamurthi and other folks.\nSo here's a slightly more thought out exploration.\nAnd just for backstory sake: I spent a few years a while\nago programming in\nStandard ML and I wrote\na chunk of a Scheme\n  implementation. I'm not an expert, but I have a bit of background.\nHey, this is a free opinion.\nConcepts from functional programming\nWhen people talk about functional programming, I think of a few key\nchoices you can make while programming:\nImmutability by default\n(Tail) recursion by default\nFirst-class functions (and the suite of tools that go along with it. e.g. map, reduce/fold)\nAnd if you have experience as a programmer, yo…",
          "link": "http://notes.eatonphil.com/2023-08-15-thinking-about-functional-programming.html",
          "publishedOn": "2023-08-15T00:00:00.000Z",
          "wordCount": 2744,
          "title": "Thinking about functional programming",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Dmitri Pavlutin Blog",
      "feedUrl": "https://dmitripavlutin.com/rss.xml",
      "siteUrl": "https://dmitripavlutin.com",
      "articles": []
    },
    {
      "title": "Dietcode | Sid's blog",
      "feedUrl": "https://dietcode.io/rss",
      "siteUrl": "https://dietcode.io/",
      "articles": [
        {
          "id": "https://dietcode.io/t/gzip-uploads/",
          "author": null,
          "description": "Can you compress files on your browser before you upload them to your server?",
          "link": "https://dietcode.io/t/gzip-uploads/",
          "publishedOn": "2023-08-27T00:00:00.000Z",
          "wordCount": 156,
          "title": "gzip-ed, streaming uploads from browsers",
          "imageUrl": "https://dietcode.io/t/gzip-uploads/og.png"
        }
      ]
    },
    {
      "title": "Infrequently Noted",
      "feedUrl": "https://infrequently.org/feed/",
      "siteUrl": "https://infrequently.org/feed/feed.xml",
      "articles": []
    },
    {
      "title": "Moving the Limit",
      "feedUrl": "https://movingthelimit.com/feed/",
      "siteUrl": "https://movingthelimit.com/",
      "articles": [
        {
          "id": "https://movingthelimit.com/a-practical-way-to-detect-cargo-cult-thinking/",
          "author": null,
          "description": "Note: sharp readers on Hacker News pointed out that this article seems to talk more about unfalsifiable beliefs and cognitive dissonance than cargo-culting. To be clear, in this article, \"cargo cults\" are purely an illustrative tool to talk about the dangers of holding unfalsifiable beliefs. Thanks for helping me clarify!\nNobody describes it better than Richard Feynman:\nIn the South Seas there is a Cargo Cult of people.  During the war they saw airplanes land with lots of good materials, and they want the same thing to happen now.  So they’ve arranged to make things like runways, to put fires along the sides of the runways, to make a wooden hut for a man to sit in, with two wooden pieces on his head like headphones and bars of bamboo sticking out like antennas — he’s the controller — and t…",
          "link": "https://movingthelimit.com/a-practical-way-to-detect-cargo-cult-thinking/",
          "publishedOn": "2023-08-04T19:46:40.997Z",
          "wordCount": 1506,
          "title": "a practical way to detect cargo-cult thinking",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Lucas F. Costa",
      "feedUrl": "https://lucasfcosta.com/feed.xml",
      "siteUrl": "https://lucasfcosta.com/",
      "articles": [
        {
          "id": "https://lucasfcosta.com/2023/08/21/hn-launch.html",
          "author": null,
          "description": "When it comes to writing, the #1 question I usually get asked is how do I get so many HN front pages with this blog.\nThis week, Layerform got to the front page for the first time too, and I got asked that question another bunch of times.\n\n\nI decided to write this document explaining how to do it so I can send people a link now.\nAs a heads-up, there is only one hack: making something people want (to upvote).\nAlso, keep in mind this is all public information on how HackerNews works. There’s no magic here.\nMake your title direct and specific. Get straight to the point. Generic or vague titles do not perform well. Salesy titles perform even worse. Don’t worry about adding some technical detail. Explain what you do precisely.\n    \nGood example: Show HN: Layerform – Open-source development envir…",
          "link": "https://lucasfcosta.com/2023/08/21/hn-launch.html",
          "publishedOn": "2023-08-20T23:00:00.000Z",
          "wordCount": 779,
          "title": "How to do a successful Hacker News launch",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "taylor.town",
      "feedUrl": "https://taylor.town/feed.xml",
      "siteUrl": "https://taylor.town/feed.xml",
      "articles": [
        {
          "id": "https://taylor.town/lazy-nursery",
          "author": null,
          "description": "If you have waste and space, you're wasting space.",
          "link": "https://taylor.town/lazy-nursery",
          "publishedOn": "2023-08-30T00:00:00.000Z",
          "wordCount": 477,
          "title": "The Lazy Garbage Nursery Guide",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/how-i-eat",
          "author": null,
          "description": "I'm no dietitian, but I've been eating for quite a while.",
          "link": "https://taylor.town/how-i-eat",
          "publishedOn": "2023-08-29T00:00:00.000Z",
          "wordCount": 1112,
          "title": "How I Eat",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/carbon-nuggets",
          "author": null,
          "description": "Corn isotopes everywhere! Has science gone too far?",
          "link": "https://taylor.town/carbon-nuggets",
          "publishedOn": "2023-08-22T00:00:00.000Z",
          "wordCount": 366,
          "title": "56% of McNugget Carbon is Corn",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/coin-boys",
          "author": null,
          "description": "My crystal ball shattered in my twenties, but the coin offers faith to the faithless.",
          "link": "https://taylor.town/coin-boys",
          "publishedOn": "2023-08-21T00:00:00.000Z",
          "wordCount": 598,
          "title": "I'm a Coin Boy, Too",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/chatgpt-custom",
          "author": null,
          "description": "Emulate clear writers like Steinbeck, Hemingway, Orwell.",
          "link": "https://taylor.town/chatgpt-custom",
          "publishedOn": "2023-08-15T00:00:00.000Z",
          "wordCount": 233,
          "title": "How would you like ChatGPT to respond?",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/gpt-day-mate",
          "author": null,
          "description": "Please prioritize today's task list.",
          "link": "https://taylor.town/gpt-day-mate",
          "publishedOn": "2023-08-14T00:00:00.000Z",
          "wordCount": 133,
          "title": "gpt'day mate",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/listener",
          "author": null,
          "description": "Chloe has no stories of her own, and she doesn't need them.",
          "link": "https://taylor.town/listener",
          "publishedOn": "2023-08-11T00:00:00.000Z",
          "wordCount": 190,
          "title": "Chloe is a listener",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/friday-demos",
          "author": null,
          "description": "Add demos to a #demo-friday channel in Slack or Teams.",
          "link": "https://taylor.town/friday-demos",
          "publishedOn": "2023-08-06T00:00:00.000Z",
          "wordCount": 666,
          "title": "Share Demos Every Friday",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/entire-career",
          "author": null,
          "description": "Westbrook spent 35 years in a codebase that allegedly powers some sort of medical software somewhere. During his tenure, he contributed hundreds of lines of code to his projects.",
          "link": "https://taylor.town/entire-career",
          "publishedOn": "2023-08-02T00:00:00.000Z",
          "wordCount": 273,
          "title": "Man Spends Entire Career Mastering Crappy Codebase",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Slashdot",
      "feedUrl": "https://rss.slashdot.org/Slashdot/slashdotMain",
      "siteUrl": "https://slashdot.org/",
      "articles": [
        {
          "id": "https://games.slashdot.org/story/23/08/30/2122229/call-of-duty-will-use-ai-to-moderate-voice-chats?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "Activision has partnered with a company called Modulate to moderate voice chats using an AI technology called ToxMod. According to The Verge, the tool \"will work to identify behaviors like hate speech, discrimination, and harassment in real time.\" From the report: ToxMod's initial beta rollout in North America begins today. It's active within Call of Duty: Modern Warfare II and Call of Duty: Warzone. A \"full worldwide release\" (it does not include Asia, the press release notes) will follow on November 10th with the release of Call of Duty: Modern Warfare III, this year's new entry in the franchise. Modulate's press release doesn't include too many details about how exactly ToxMod works. Its website notes that the tool \"triages voice chat to flag bad behavior, analyzes the nuances of each conversation to determine toxicity, and enables moderators to quickly respond to each incident by supplying relevant and accurate context.\"\n \nThe company's CEO said in a recent interview that the tool aims to go beyond mere transcription; it takes factors like a player's emotions and volume into context as well in order to differentiate harmful statements from playful ones. It is noteworthy that the tool (for now, at least) will not actually take action against players based on its data but will merely submit reports to Activision's moderators.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://games.slashdot.org/story/23/08/30/2122229/call-of-duty-will-use-ai-to-moderate-voice-chats?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-31T00:45:00.000Z",
          "wordCount": 3985,
          "title": "Call of Duty Will Use AI To Moderate Voice Chats",
          "imageUrl": "https://a.fsdn.com/sd/topics/ai_64.png"
        },
        {
          "id": "https://yro.slashdot.org/story/23/08/30/2117226/saudi-man-receives-death-penalty-for-posts-online?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "An anonymous reader quotes a report from the Associated Press: A Saudi court has sentenced a man to death over his posts on X, formerly known as Twitter, and his activity on YouTube, the latest in a widening crackdown on dissent in the kingdom that has drawn international criticism. The judgement against Mohammed bin Nasser al-Ghamdi, seen Wednesday by The Associated Press, comes against the backdrop of doctoral student Salma al-Shehab and others facing decades-long prison sentences over their comments online. The sentences appear part of Crown Prince Mohammed bin Salman's wider effort to stamp out any defiance in the kingdom as he pursues massive building projects and other diplomatic deals to raise his profile globally.\n \nAccording to court documents, the charges levied against al-Ghamdi…",
          "link": "https://yro.slashdot.org/story/23/08/30/2117226/saudi-man-receives-death-penalty-for-posts-online?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-31T00:02:00.000Z",
          "wordCount": 4552,
          "title": "Saudi Man Receives Death Penalty For Posts Online",
          "imageUrl": "https://a.fsdn.com/sd/topics/crime_64.png"
        },
        {
          "id": "https://apple.slashdot.org/story/23/08/30/2057208/microsoft-is-discontinuing-visual-studio-for-mac-after-major-overhaul?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "Microsoft is discontinuing Visual Studio for Mac, committing to security updates and platform update compatibility for the next 12 months. 9to5Mac reports: \"With today's announcement, we're redirecting our resources and focus to enhance Visual Studio and VS Code, optimizing them for cross-platform development,\" the company said in the announcement.\n\"No new framework, runtime, or language support will be added to Visual Studio for Mac.\" The company added: \"We will also continue to provide runtime and workload updates so you can continue building and shipping applications built on .NET 6, .NET 7, and the Mono frameworks. While not officially supported, we've also enabled rudimentary support for .NET 8 in Visual Studio for Mac for building and debugging applications.\"\n \nOnce the wheels fall off Visual Studio for Mac, Microsoft recommends accessing its IDE through Windows in a machine virtual on the Mac or in the cloud. Otherwise, Microsoft points to cross-platform compatible developer technology that will run on macOS: \"The recently announced C# Dev Kit, .NET MAUI, and Unity Extensions for VS Code are available in preview and are intended to augment VS Code's capabilities for .NET and C# developers. These extensions operate natively across all supported platforms, including macOS, and the experience using these will continue to be improved as they move from preview to GA and beyond.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://apple.slashdot.org/story/23/08/30/2057208/microsoft-is-discontinuing-visual-studio-for-mac-after-major-overhaul?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T23:20:00.000Z",
          "wordCount": 4476,
          "title": "Microsoft Is Discontinuing Visual Studio For Mac After Major Overhaul",
          "imageUrl": "https://a.fsdn.com/sd/topics/microsoft_64100.png"
        },
        {
          "id": "https://yro.slashdot.org/story/23/08/30/2043215/mta-website-feature-lets-you-track-subway-riders-locations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "Slash_Account_Dot shares a report from 404 Media, written by cybersecurity journalist Joseph Cox: In the mid-afternoon one Saturday earlier this month, the target got on the New York subway. I knew what station they entered the subway at and at what specific time. They then entered another station a few hours later. If I had kept monitoring this person, I would have figured out the subway station they often start a journey at, which is near where they live. I would also know what specific time this person may go to the subway each day. During all this monitoring, I wasn't anywhere near the rider. I didn't even need to see them with my own eyes. Instead, I was sitting inside an apartment, following their movements through a feature on a Metropolitan Transportation Authority (MTA) website, w…",
          "link": "https://yro.slashdot.org/story/23/08/30/2043215/mta-website-feature-lets-you-track-subway-riders-locations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T22:40:00.000Z",
          "wordCount": 4779,
          "title": "MTA Website 'Feature' Lets You Track Subway Riders' Locations",
          "imageUrl": "https://a.fsdn.com/sd/topics/privacy_64.png"
        },
        {
          "id": "https://news.slashdot.org/story/23/08/30/2049255/epa-removes-federal-protections-for-most-of-the-countrys-wetlands?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "An anonymous reader quotes a report from NPR: The Environmental Protection Agency removed federal protections for a majority of the country's wetlands on Tuesday to comply with a recent U.S. Supreme Court ruling. The EPA and Department of the Army announced a final rule amending the definition of protected \"waters of the United States\" in light of the decision in Sackett v. EPA in May, which narrowed the scope of the Clean Water Act and the agency's power to regulate waterways and wetlands. A 2006 Supreme Court decision determined that wetlands would be protected if they had a \"significant nexus\" to major waterways. This year's court decision undid that standard. The EPA's new rule \"removes the significant nexus test from consideration when identifying tributaries and other waters as federally protected,\" the agency said.\n \nIn May, Justice Samuel Alito said the navigable U.S. waters regulated by the EPA under the Clean Water Act do not include many previously regulated wetlands. Writing the court's decision, he said the law includes only streams, oceans, rivers and lakes, and wetlands with a \"continuous surface connection to those bodies.\" The EPA said the rule will take effect immediately. \"The agencies are issuing this amendment to the 2023 rule expeditiously -- three months after the Supreme Court decision -- to provide clarity and a path forward consistent with the ruling,\" the agency said. As a result of the rule change, protections for many waterways and wetlands will now fall to states.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://news.slashdot.org/story/23/08/30/2049255/epa-removes-federal-protections-for-most-of-the-countrys-wetlands?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T22:00:00.000Z",
          "wordCount": 8788,
          "title": "EPA Removes Federal Protections For Most of the Country's Wetlands",
          "imageUrl": "https://a.fsdn.com/sd/topics/usa_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/08/30/1847258/fcc-says-too-bad-to-isps-complaining-that-listing-every-fee-is-too-hard?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "The Federal Communications Commission yesterday rejected requests to eliminate an upcoming requirement that Internet service providers list all of their monthly fees. From a report: Five major trade groups representing US broadband providers petitioned the FCC in January to scrap the requirement before it takes effect. In June, Comcast told the FCC that the listing-every-fee rule \"impose[s] significant administrative burdens and unnecessary complexity in complying with the broadband label requirements.\" The five trade groups kept up the pressure earlier this month in a meeting with FCC officials and in a filing that complained that listing every fee is too hard. The FCC refused to bend, announcing yesterday that the rules will take effect without any major changes. \n\n\"Every consumer needs transparent information when making decisions about what Internet service offering makes the most sense for their family or household. No one wants to be hit with charges they didn't ask for or they did not expect,\" FCC Chairwoman Jessica Rosenworcel said. Yesterday's order \"largely affirms the rules... while making some revisions and clarifications such as modifying provider record-keeping requirements when directing consumers to a label on an alternative sales channel and confirming that providers may state 'taxes included' when their price already incorporates taxes,\" the FCC said.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://tech.slashdot.org/story/23/08/30/1847258/fcc-says-too-bad-to-isps-complaining-that-listing-every-fee-is-too-hard?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T21:20:00.000Z",
          "wordCount": 8211,
          "title": "FCC Says 'Too Bad' To ISPs Complaining That Listing Every Fee is Too Hard",
          "imageUrl": "https://a.fsdn.com/sd/topics/communications_64.png"
        },
        {
          "id": "https://yro.slashdot.org/story/23/08/30/1840248/hundreds-of-thousands-trafficked-to-work-as-online-scammers-in-southeast-asia-says-un-report?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Hundreds of thousands of people are being forcibly engaged by organised criminal gangs into online criminality in Southeast Asia - from romance-investment scams and crypto fraud to illegal gambling - a report issued today by the UN Human Rights Office shows. From a report: Victims face a range of serious violations and abuses, including threats to their safety and security; and many have been subjected to torture and cruel, inhuman and degrading treatment or punishment, arbitrary detention, sexual violence, forced labour, and other human rights abuses, the report says. \"People who are coerced into working in these scamming operations endure inhumane treatment while being forced to carry out crimes. They are victims. They are not criminals,\" said UN High Commissioner for Human Rights Volker Turk. \n\n\"In continuing to call for justice for those who have been defrauded through online criminality, we must not forget that this complex phenomenon has two sets of victims.\" The enormity of online scam trafficking in Southeast Asia is difficult to estimate, the reports says, because of the clandestine nature and gaps in the official response. Credible sources indicate that at least 120,000 people across Myanmar may be held in situations where they are forced to carry out online scams, with estimates in Cambodia similarly at around 100,000. Other States in the region, including Lao PDR, the Philippines and Thailand, have also been identified as main countries of destination or transit where at least tens of thousands of people have been involved. The scam centres generate revenue amounting to billions of US dollars each year.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://yro.slashdot.org/story/23/08/30/1840248/hundreds-of-thousands-trafficked-to-work-as-online-scammers-in-southeast-asia-says-un-report?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T20:41:00.000Z",
          "wordCount": 5226,
          "title": "Hundreds of Thousands Trafficked To Work as Online Scammers in Southeast Asia, Says UN Report",
          "imageUrl": "https://a.fsdn.com/sd/topics/crime_64.png"
        },
        {
          "id": "https://yro.slashdot.org/story/23/08/30/1737241/openai-disputes-authors-claims-that-every-chatgpt-response-is-derivative-work?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "OpenAI has responded to a pair of nearly identical class-action lawsuits from book authors -- including Sarah Silverman, Paul Tremblay, Mona Awad, Chris Golden, and Richard Kadrey -- who earlier this summer alleged that ChatGPT was illegally trained on pirated copies of their books. From a report: In OpenAI's motion to dismiss (filed in both lawsuits), the company asked a US district court in California to toss all but one claim alleging direct copyright infringement, which OpenAI hopes to defeat at \"a later stage of the case.\" The authors' other claims -- alleging vicarious copyright infringement, violation of the Digital Millennium Copyright Act (DMCA), unfair competition, negligence, and unjust enrichment -- need to be \"trimmed\" from the lawsuits \"so that these cases do not proceed to d…",
          "link": "https://yro.slashdot.org/story/23/08/30/1737241/openai-disputes-authors-claims-that-every-chatgpt-response-is-derivative-work?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T20:00:00.000Z",
          "wordCount": 9028,
          "title": "OpenAI Disputes Authors' Claims That Every ChatGPT Response is Derivative Work",
          "imageUrl": "https://a.fsdn.com/sd/topics/ai_64.png"
        },
        {
          "id": "https://it.slashdot.org/story/23/08/30/1727202/leaked-microsoft-memo-tells-managers-not-to-use-budget-cuts-as-explainer-for-lack-of-pay-rises?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "An anonymous reader shares a report: Microsoft employees were already expecting lackluster pay rises. In a company-wide email sent earlier this year, the tech company's CEO Satya Nadella warned staff of salary freezes and cuts to the bonusbudget. But despite previous transparency around the cost-cutting measures, employees enquiring about how the budget cuts have impacted their performance review will now be fobbed off. According to leaked guidance, managers are being ordered to dodge such questions in the name of company culture. \"It's natural for employees to ask questions about budget given the decisions shared in Satya's email,\" the guidance reportedly states. \"However, it's most important to focus discussions with direct reports on their impact for the past fiscal year and directly tie it to their rewards.\" \n\nManagers should not use the budget cuts as an \"explanation\" for compensation decisions for individual employees and instead should emphasize that the employee's own \"impact\" determines \"rewards.\" \"Using budgets or factors besides the employee's impact as an explanation for an employee's rewards will erode trust and confidence within your team,\" the guide cautions. \"Reinforce that every year offers unique opportunity for impact, and we increase our high expectations, regardless of our budget.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://it.slashdot.org/story/23/08/30/1727202/leaked-microsoft-memo-tells-managers-not-to-use-budget-cuts-as-explainer-for-lack-of-pay-rises?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T19:22:00.000Z",
          "wordCount": 8824,
          "title": "Leaked Microsoft Memo Tells Managers Not To Use Budget Cuts as Explainer for Lack of Pay Rises",
          "imageUrl": "https://a.fsdn.com/sd/topics/microsoft_64100.png"
        },
        {
          "id": "https://science.slashdot.org/story/23/08/30/1719203/un-backs-new-term-for-conservation-talks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "The word \"funga\" should be used alongside flora and fauna when discussing conservation issues to reflect the importance of fungi to ecosystem health, a UN body has said. From a report: The secretariat of the UN convention on biological diversity (UNCBD) said it was time that fungi were \"recognised and protected on an equal footing with animals and plants in legal conservation frameworks.\" \n\n\"Whenever referring to the macroscopic diversity of life on Earth, we should use 'flora, fauna and funga,' and 'animal, plants and fungi,'\" it said in an Instagram post. Mycologists, mostly from Latin America, established the term \"funga\" five years ago. It refers to the levels of diversity of fungi in any given place, and is analogous to \"flora and fauna,\" which refer to plants and animals. Unlike flora and fauna, it is not a Latin term but was chosen because it is morphologically similar. \"Just like mycelium, mycologically inclusive language will spread unseen but profound [sic], permeating public consciousness (and policy) to acknowledge fungi's vital role in the grand web of life on and in Earth,\" it said.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://science.slashdot.org/story/23/08/30/1719203/un-backs-new-term-for-conservation-talks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T18:42:00.000Z",
          "wordCount": 5391,
          "title": "UN Backs New Term For Conservation Talks",
          "imageUrl": "https://a.fsdn.com/sd/topics/science_64.png"
        },
        {
          "id": "https://news.slashdot.org/story/23/08/30/1713244/eu-fossil-fuel-burning-for-electricity-fell-to-lowest-on-record-in-2023-data-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "The European Union is stoking its power plants with fewer lumps of coal and barrels of oil and gas than it has ever recorded, data shows. From a report: The 27 member states burned 17% less fossil fuel to make electricity between January and June 2023 than over the same period the year before, a study from the clean energy thinktank Ember found. The EU made 410TWh of electricity from sources that release planet-heating gases, which analysts say is the lowest level since 2015 -- the first year for which they have monthly data -- and \"very likely\" since 2000. \n\nThe drop in fossil fuel generation was driven by a fall in demand for electricity, as well as some growth in clean power, the study found. \"We're glad to see fossil fuels down, but in the long-term it is not going to be sustainable to rely on the fall in demand to do this,\" said Matt Ewen, a data analyst at Ember and author of the report. \"We have to be replacing this energy rather than just expecting it to go away and not be used.\" To try to stop the planet heating, the EU has promised to cut greenhouse gas pollution by at least 55% from 1990 levels by the end of the decade, and hit net zero emissions by 2050. To get there, it will probably have to use less energy but more electricity than it does today, as more people heat homes and drive cars with electricity instead of fossil fuels.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://news.slashdot.org/story/23/08/30/1713244/eu-fossil-fuel-burning-for-electricity-fell-to-lowest-on-record-in-2023-data-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T18:03:00.000Z",
          "wordCount": 6293,
          "title": "EU Fossil Fuel Burning for Electricity Fell To Lowest on Record in 2023, Data Shows",
          "imageUrl": "https://a.fsdn.com/sd/topics/eu_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/08/30/178208/amazon-ceo-says-its-probably-not-going-to-work-out-for-employees-who-defy-return-to-office-policy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Amazon employees have been pushing back against the company's return-to-office policy for months -- and it seems CEO Andy Jassy has had enough. From a report: During a pre-recorded internal Q&A session earlier this month, Jassy told employees it was \"past the time to disagree and commit\" with the policy, which requires corporate employees to be in the office three days a week. The phrase \"disagree and commit\" is one of Amazon's leadership principles, and was used often by the company's founder and current executive chairman, Jeff Bezos. \"If you can't disagree and commit, it's probably not going to work out for you at Amazon,\" Jassy said, adding it wasn't right for some employees to be in the office three days a week while others refuse to do so.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/08/30/178208/amazon-ceo-says-its-probably-not-going-to-work-out-for-employees-who-defy-return-to-office-policy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T17:25:00.000Z",
          "wordCount": 13411,
          "title": "Amazon CEO Says 'It's Probably Not Going To Work Out' For Employees Who Defy Return-to-Office Policy",
          "imageUrl": "https://a.fsdn.com/sd/topics/business_64.png"
        },
        {
          "id": "https://games.slashdot.org/story/23/08/30/1650242/sony-jacking-up-annual-playstation-plus-plans-by-as-much-as-40?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "A couple months after Microsoft revealed plans to increase Game Pass subscription prices, Sony is getting in on the act. From a report: The company is bumping up the annual prices of all three PlayStation Plus plans on September 6th. An annual Essential subscription will soon cost $80 per year, up from $60. The Extra plan is going up by $35 to $135 per year, while an annual Premium plan will soon cost $40 more at $160. The price changes won't take effect for current PS Plus users on an annual plan until their next renewal date that's on or after November 6th. If you make any changes to your plan between September 6th and then (such as changing tiers), the new pricing will apply. Sony has not announced changes to the monthly ($10 for Essential, $15 for Extra and $18 for Premium) or quarterly ($25 for Essential, $40 for Extra and $50 for Premium) for the time being. It notes that the annual plan is still less expensive than a monthly or quarterly subscription in the long run.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://games.slashdot.org/story/23/08/30/1650242/sony-jacking-up-annual-playstation-plus-plans-by-as-much-as-40?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T16:50:00.000Z",
          "wordCount": 5205,
          "title": "Sony Jacking Up Annual PlayStation Plus Plans By as Much as $40",
          "imageUrl": "https://a.fsdn.com/sd/topics/playstation_64.png"
        },
        {
          "id": "https://it.slashdot.org/story/23/08/30/1550256/microsoft-is-using-malware-like-pop-ups-in-windows-11-to-get-people-to-ditch-google?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "An anonymous reader writes: I thought I had malware on my main Windows 11 machine this weekend. There I was minding my own business in Chrome before tabbing back to a game and wham a pop-up appeared asking me to switch my default search engine to Microsoft Bing in Chrome. Stunningly, Microsoft now thinks it's ok to shove a pop-up in my face above my apps and games just because I dare to use Chrome instead of Microsoft Edge. This isn't a normal notification, either. It didn't appear in the notification center in Windows 11, nor is it connected to the part of Windows 11 that suggests new features to you. It's quite literally a rogue executable file that has somehow appeared in c:\\windows\\temp\\mubstemp and is digitally signed by Microsoft. \n\n\"We are aware of these reports and have paused this notification while we investigate and take appropriate action to address this unintended behavior,\" says Caitlin Roulston, director of communications, in a statement to The Verge. [...] This isn't Microsoft's first rodeo, either. I'm growing increasingly frustrated by the company's methods of getting people to switch from Google and Chrome to Bing and Edge. Microsoft has been using a variety of prompts for years now, with pop-ups appearing inside Chrome, on the Windows taskbar, and elsewhere. Microsoft has even forced people into Edge after a Windows Update, and regularly presents a full-screen message to switch to Bing and Edge after updates.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://it.slashdot.org/story/23/08/30/1550256/microsoft-is-using-malware-like-pop-ups-in-windows-11-to-get-people-to-ditch-google?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T16:00:00.000Z",
          "wordCount": 11670,
          "title": "Microsoft is Using Malware-like Pop-Ups in Windows 11 To Get People To Ditch Google",
          "imageUrl": "https://a.fsdn.com/sd/topics/chrome_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/08/30/1525238/freebsd-can-now-boot-in-25-milliseconds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Replacing a sort algorithm in the FreeBSD kernel has improved its boot speed by a factor of 100 or more... and although it's aimed at a micro-VM, the gains should benefit everyone. From a report: MicroVMs are a hot area of technology R&D in the last half decade or so. The core idea is a re-invention of some of concepts and technology that IBM invented along with the hypervisor in the 1960s: designing OSes specifically to run as guests under another OS. This means building the OS specifically to run inside a VM, and to talk to resources provided by a specific hypervisor rather than to fake hardware. \n\nThis means that the guest OS needs next to no support for real hardware, just VirtIO drivers which talk directly to facilities provided by the host hypervisor. In turn, the hypervisor doesn't have to provide an emulated PCI bus, emulated power management, emulated graphics card, emulated network interface cards, and so on. The result is that the hypervisor itself can be much smaller and simpler. The result of ruthlessly chopping down both the hypervisor, and the OS that runs inside it, is that both ends can be much smaller and simpler. That means that VMs can use much fewer resources, and start up much quicker.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://tech.slashdot.org/story/23/08/30/1525238/freebsd-can-now-boot-in-25-milliseconds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T15:24:00.000Z",
          "wordCount": 8585,
          "title": "FreeBSD Can Now Boot in 25 Milliseconds",
          "imageUrl": "https://a.fsdn.com/sd/topics/os_64.png"
        },
        {
          "id": "https://science.slashdot.org/story/23/08/30/017243/nasa-to-demonstrate-laser-communications-from-space-station?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "SonicSpike shares a report from NASA: In 2023, NASA is sending a technology demonstration known as the Integrated LCRD Low Earth Orbit User Modem and Amplifier Terminal (ILLUMA-T) to the space station. Together, ILLUMA-T and the Laser Communications Relay Demonstration (LCRD), which launched in December 2021, will complete NASA's first two-way, end-to-end laser relay system. With ILLUMA-T, NASA's Space Communications and Navigation (SCaN) program office will demonstrate the power of laser communications from the space station. Using invisible infrared light, laser communications systems send and receive information at higher data rates. With higher data rates, missions can send more images and videos back to Earth in a single transmission. Once installed on the space station, ILLUMA-T will…",
          "link": "https://science.slashdot.org/story/23/08/30/017243/nasa-to-demonstrate-laser-communications-from-space-station?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T07:00:00.000Z",
          "wordCount": 4318,
          "title": "NASA To Demonstrate Laser Communications From Space Station",
          "imageUrl": "https://a.fsdn.com/sd/topics/nasa_64.png"
        },
        {
          "id": "https://science.slashdot.org/story/23/08/29/232222/womans-mystery-illness-turns-out-to-be-3-inch-snake-parasite-in-her-brain?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "An anonymous reader quotes a report from Ars Technica: A neurosurgeon in Australia pulled a wriggling 3-inch roundworm from the brain of a 64-year-old woman last year -- which was quite the surprise to the woman's team of doctors and infectious disease experts, who had spent over a year trying to identify the cause of her recurring and varied symptoms. A close study of the extracted worm made clear why the diagnosis was so hard to pin down: the roundworm was one known to infect snakes -- specifically carpet pythons endemic to the area where the woman lived -- as well as the pythons' mammalian prey. The woman is thought to be the first reported human to ever have an infection with this snake-adapted worm, and it is the first time the worm has been found burrowing through a mammalian brain. …",
          "link": "https://science.slashdot.org/story/23/08/29/232222/womans-mystery-illness-turns-out-to-be-3-inch-snake-parasite-in-her-brain?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T03:30:00.000Z",
          "wordCount": 6326,
          "title": "Woman's Mystery Illness Turns Out To Be 3-Inch Snake Parasite In Her Brain",
          "imageUrl": "https://a.fsdn.com/sd/topics/medicine_64.png?refresh=now"
        },
        {
          "id": "https://it.slashdot.org/story/23/08/29/2258208/benevolent-hackers-clear-stalking-spyware-from-75000-phones?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "According to TechCrunch, unnamed hackers reportedly breached the spyware firm WebDetetive, deleting device information to protect surveillance victims and denying spyware users new data. Engadget reports: Users of the spyware won't get any new data from their targets. \"Because #fuckstalkerware,\" the hackers wrote in a note obtained by TechCrunch. The WebDetetive breach compromised more than 76,000 devices belonging to customers of the stalkerware, and more than 1.5 gigabytes of data freed from app's servers, according to the hackers.\n \nWhile TechCrunch did not independently confirm the deletion of victim's data from the WebDetetive server, a cache of data shared by the hackers provided a look at what they were able to accomplish. TechCrunch also worked with a nonprofit that logs exposed datasets, DDoSecrets, to verify and analyze the information. Hackers obtained information on customers like IP addresses and devices that they targeted.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://it.slashdot.org/story/23/08/29/2258208/benevolent-hackers-clear-stalking-spyware-from-75000-phones?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T01:25:00.000Z",
          "wordCount": 4562,
          "title": "Benevolent Hackers Clear Stalking Spyware From 75,000 Phones",
          "imageUrl": "https://a.fsdn.com/sd/topics/security_64.png"
        },
        {
          "id": "https://apple.slashdot.org/story/23/08/29/2247230/apple-to-buy-tsmcs-entire-supply-of-3nm-chips-for-2023?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "According to DigiTimes, Apple will receive all TSMC's first-generation 3-nanometer process chips this year for its upcoming devices. MacRumors reports: As early as May, Apple was known to have booked nearly 90% of the Taiwanese pure-play foundry for its upcoming next-gen devices. However, Apple is now projected to take 100% of TSMC's capacity in 2023, due to delays in Intel's wafer needs owing to later modifications to the company's CPU platform design plans. Intel's lack of orders means TSMC's sales of 3nm chips will be significantly lower this year. While TSMC is still expected to experience significant growth in the fourth quarter as it starts mass producing 3nm chips for Apple's needs, they too have been downgraded, according to DigiTimes' industry sources.\n \nThe report suggests TSMC's 3nm process output may be reduced to 50,000-60,000 wafers monthly in the fourth quarter, down from the 80,000-100,000 units previously anticipated, due to a cutback in Apple's orders. The current monthly output of TSMC's 3nm process is estimated at approximately 65,000 wafers, the outlet's sources said. Apple's upcoming iPhone 15 Pro models are expected to feature the A17 Bionic processor, Apple's first iPhone chip based on TSMC's first-generation 3nm process, also known as N3B. The E3nm technology is said to deliver a 35% power efficiency improvement and 15% faster performance compared to 4nm, which was used to make the A16 Bionic chip for the iPhone 14 Pro and Pro Max.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://apple.slashdot.org/story/23/08/29/2247230/apple-to-buy-tsmcs-entire-supply-of-3nm-chips-for-2023?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T00:45:00.000Z",
          "wordCount": 6179,
          "title": "Apple To Buy TSMC's Entire Supply of 3nm Chips For 2023",
          "imageUrl": "https://a.fsdn.com/sd/topics/apple_64.png"
        },
        {
          "id": "https://developers.slashdot.org/story/23/08/29/2118234/google-launches-bigquery-studio-a-new-way-to-work-with-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "An anonymous reader quotes a report from TechCrunch: Companies increasingly see the value in mining their data for deeper insights. According to a NewVantage survey, 97.6% of major worldwide organizations are focusing investments into big data and AI. But challenges stand in the way of executing big data analytics. One recent poll found that 65% of organizations feel they have \"too much\" data to analyze. Google's proposed solution is BigQuery Studio, a new service within BigQuery, its fully managed serverless data warehouse, that provides a single experience to edit programming languages including SQL, Python and Spark to run analytics and machine learning workloads at \"petabyte scale.\" BigQuery Studio is available in preview as of this week.\n \n\"BigQuery Studio is a new experience that rea…",
          "link": "https://developers.slashdot.org/story/23/08/29/2118234/google-launches-bigquery-studio-a-new-way-to-work-with-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-30T00:02:00.000Z",
          "wordCount": 4333,
          "title": "Google Launches BigQuery Studio, a New Way To Work With Data",
          "imageUrl": "https://a.fsdn.com/sd/topics/topicgoogle_fb.gif"
        },
        {
          "id": "https://linux.slashdot.org/story/23/08/29/2112249/linux-65-kernel-released?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "ZDNet's Steven Vaughan-Nichols shares what's new in the release of Linux 6.5: The biggest news for servers -- and cloud Linux users -- is AMD Ryzen processors' P-State support. This support should mean better performance and power use across CPU cores. Intel Alder Lake CPUs have also received improved load balancing in a related development. RISC-V architecture fans will be pleased to find Linux now has Advanced Configuration and Power Interface (ACPI) support. ACPI is used in Linux and other operating systems for power management. It's vital for laptops and other battery-powered systems.\n \nFor better security, people using virtual machines or sandboxes based on Usermode Linux for testing, or running multiple versions of Linux at once, now have Landlock support. Landock is a Linux Security Module that enables applications to sandbox themselves by selecting access rights to directories. It's designed to be used by unprivileged processes while following the system security policy. To make talking with the rest of the world easier, Linux 6.5 now supports USB 4v2. This new USB-C standard will support up to an eye-watering 120Gbps. And while we're still getting used to Wi-Fi 6E, the Wi-Fi Alliance is already working on bringing us Wi-Fi 7. When Wi-Fi 7 arrives, with its theoretical maximum speed of 46Gbps, Linux will be ready. As usual, the new Linux has many more built-in audio and graphics drivers. The Bcachefs filesystem didn't make it into Linux 6.5, notes Vaughan-Nichols. \"While the Bcachefs filesystem looks good, there's been a lot of developers fighting about the development process. These personal arguments have led Torvalds to decide not to incorporate Bcachefs into Linux 6.5.\"\n \nLinus Torvalds announced Linux 6.5's delivery in a brief post on August 27.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://linux.slashdot.org/story/23/08/29/2112249/linux-65-kernel-released?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-29T23:20:00.000Z",
          "wordCount": 5051,
          "title": "Linux 6.5 Kernel Released",
          "imageUrl": "https://a.fsdn.com/sd/topics/opensource_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/08/29/213220/netflix-added-26-million-us-subscribers-in-july-despite-password-sharing-crackdown?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "According to research firm Antenna, Netflix had 2.6 million gross subscriber additions in July. \"The company also saw the highest percentage of new sign-ups going to its advertising tier since the $7-a-month offering hit the market last November,\" reports Deadline. \"About 23% of new subscribers opted for the ad tier, a gain of four percentage points over June levels.\" From the report: The overall July gains represented a 26% downturn from June's record-breaking numbers, but they still show momentum stretching back to the May 23 introduction of paid password sharing in the U.S. From May 24 to 27, Netflix had its four biggest single days of sign-ups in the four-and-a-half years since Antenna has began tracking its subscribers, outpacing even the 2020 Covid boom.\n \nThe new password scheme followed last fall's debut of the cheaper, ad-supported subscription tier, with the combination of the two providing a potent boost. In the second quarter ending June 30, the company reported that it doubled projections by adding 5.9 million subscribers, reaching 238.3 million worldwide.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/08/29/213220/netflix-added-26-million-us-subscribers-in-july-despite-password-sharing-crackdown?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-29T22:40:00.000Z",
          "wordCount": 6288,
          "title": "Netflix Added 2.6 Million US Subscribers In July Despite Password-Sharing Crackdown",
          "imageUrl": "https://a.fsdn.com/sd/topics/business_64.png"
        },
        {
          "id": "https://yro.slashdot.org/story/23/08/29/2055240/sports-leagues-ask-us-for-instantaneous-dmca-takedowns-and-website-blocking?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "An anonymous reader quotes a report from Ars Technica: Sports leagues are urging the US to require \"instantaneous\" takedowns of pirated livestreams and new requirements for Internet service providers to block pirate websites. The Digital Millennium Copyright Act of 1998 requires websites to \"expeditiously\" remove infringing material upon being notified of its existence. But pirated livestreams of sports events often aren't taken down while the events are ongoing, said comments submitted last week by Ultimate Fighting Championship, the National Basketball Association, and National Football League.\n \nThe \"DMCA does not define 'expeditiously,' and OSPs [online service providers] have exploited this ambiguity in the statutory language to delay removing content in response to takedown requests,…",
          "link": "https://yro.slashdot.org/story/23/08/29/2055240/sports-leagues-ask-us-for-instantaneous-dmca-takedowns-and-website-blocking?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-29T22:00:00.000Z",
          "wordCount": 5887,
          "title": "Sports Leagues Ask US For 'Instantaneous' DMCA Takedowns and Website Blocking",
          "imageUrl": "https://a.fsdn.com/sd/topics/piracy_64.png"
        },
        {
          "id": "https://hardware.slashdot.org/story/23/08/29/1830233/reports-of-the-pcs-death-are-greatly-exaggerated-says-idc?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "The PC market is expected to return to growth in 2024, according to estimates from IDC analysts. From a report: Still, industry players might want to taper their enthusiasm. PC shipments are forecast to grow 3.7 percent year-on-year to hit 261.4 million units in 2024, putting them above 2018 levels, but not quite on par with 2019 demand. Meanwhile, 2023 is predicted to sink by 13.7 percent to 252 million units. Research manager Jitesh Ubrani called demand \"tepid at best\" and said 2023 will be the year with the \"greatest annual decline in consumer PC shipments since the category's inception.\" \n\nIDC recognizes the market still faces challenges including \"concerns around the consumer market refresh cycle, businesses pushing device purchases forward, and education budgets that are not rebounding in many markets.\" Market hesitancy, as always, boils down to uncertainty. For one, processors are seeing what IDC called \"some of the biggest shifts in commercial PC history\" as AMD market share hit 11 percent in 2022 and Apple pulled in just over 5 percent that year. Apple device sales have been on a decline for multiple quarters now. Q1 2023 saw new Macs plummet more than 40 percent year-on-year, compared to an overall 25-30 percent among PC vendors. The quarter before that saw Apple shipments outperform the PC market as a whole, declining a mere 2.1 percent while other manufacturers experienced 37 percent reductions.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://hardware.slashdot.org/story/23/08/29/1830233/reports-of-the-pcs-death-are-greatly-exaggerated-says-idc?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-29T21:20:00.000Z",
          "wordCount": 7910,
          "title": "Reports of the PC's Death Are Greatly Exaggerated, Says IDC",
          "imageUrl": "https://a.fsdn.com/sd/topics/hardware_64.png"
        },
        {
          "id": "https://it.slashdot.org/story/23/08/29/1826220/fbi-dismantles-a-malware-system-that-took-millions-in-ransom?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "The FBI said Tuesday that it has taken down a network of hacked devices responsible for extorting tens of millions of dollars from victims around the world. From a report: US officials described the network known as Qakbot as one of the most notorious \"botnets\" in the world, referring to computer networks that have been infected with malicious software so that they can be controlled remotely without the owner's knowledge -- often to send phishing emails. These emails can in turn be used to hack into victims' computer systems, which attackers will hold for ransom. \n\nQakbot was instrumental in enabling cyberattacks against businesses and critical services around the world, according to US officials, including hits on the San Bernardino County Sheriff's Department and hospitals run by Prospect Medical Group. The latter resulted in the closure of emergency rooms and medical facilities across the US. US officials estimated that, since its creation in 2008, Qakbot had infected around 200,000 computers in the US and 700,000 globally.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://it.slashdot.org/story/23/08/29/1826220/fbi-dismantles-a-malware-system-that-took-millions-in-ransom?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-29T20:40:00.000Z",
          "wordCount": 4753,
          "title": "FBI Dismantles a Malware System That Took Millions in Ransom",
          "imageUrl": "https://a.fsdn.com/sd/topics/security_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/08/29/1823219/google-deepmind-launches-watermarking-tool-for-ai-generated-images?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Google DeepMind has launched a new watermarking tool that labels whether images have been generated with AI. From a report: The tool, called SynthID, will initially be available only to users of Google's AI image generator Imagen, which is hosted on Google Cloud's machine learning platform Vertex. Users will be able to generate images using Imagen and then choose whether to add a watermark or not. The hope is that it could help people tell when AI-generated content is being passed off as real, or help protect copyright. [...] Traditionally images have been watermarked by adding a visible overlay onto them, or adding information into their metadata. But this method is \"brittle\" and the watermark can be lost when images are cropped, resized, or edited, says Pushmeet Kohli, vice president of research at Google DeepMind. \n\nSynthID is created using two neural networks. One takes the original image and produces another image that looks almost identical to it, but with some pixels subtly modified. This creates an embedded pattern that is invisible to the human eye. The second neural network can spot the pattern and will tell users whether it detects a watermark, suspects the image has a watermark, or finds that it doesn't have a watermark. Kohli said SynthID is designed in a way that means the watermark can still be detected even if the image is screenshotted or edited -- for example, by rotating or resizing it.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://tech.slashdot.org/story/23/08/29/1823219/google-deepmind-launches-watermarking-tool-for-ai-generated-images?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-29T20:00:00.000Z",
          "wordCount": 5106,
          "title": "Google DeepMind Launches Watermarking Tool For AI-Generated Images",
          "imageUrl": "https://a.fsdn.com/sd/topics/topicgoogle_fb.gif"
        },
        {
          "id": "https://slashdot.org/story/23/08/29/1816233/first-bitcoin-etf-could-be-coming-soon-as-court-rules-in-favor-of-grayscale-over-sec?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "The U.S. Court of Appeals for the D.C. Circuit has paved the way for bitcoin exchange-traded funds. From a report: On Tuesday, the court sided with Grayscale in a lawsuit against the Securities and Exchange Commission which had denied the company's application to convert the Grayscale Bitcoin Trust to an ETF. The decision could impact other companies that want to create bitcoin ETFs, like BlackRock and Fidelity. A spot bitcoin ETF would be traded through a traditional stock exchange, although the bitcoin would be held by a brokerage, and would allow investors to gain exposure to the world's biggest cryptocurrency without having to own the coin themselves. Many crypto bulls believe that approval of a spot bitcoin ETF will lead to more mainstream institutional adoption. \n\nBitcoin, ether and other major cap crypto coins surged on the news, and Coinbase, which is listed as the custodian partner in multiple spot bitcoin ETF applications, was up more than 14% on Tuesday. \"The Commission failed to adequately explain why it approved the listing of two bitcoin futures ETPs but not Grayscale's proposed bitcoin ETP,\" the court said, referring to exchange-traded products. \"In the absence of a coherent explanation, this unlike regulatory treatment of like products is unlawful.\" Grayscale Investments, which manages the world's biggest crypto fund, initiated its lawsuit against the SEC in June 2022 after the agency rejected its application to turn its flagship bitcoin fund, better known by its ticker GBTC, into an ETF. The company decided to pursue the ETF, which would be backed by bitcoin rather than bitcoin derivatives, after the SEC approved ProShares' futures-based bitcoin ETF in October 2021.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/08/29/1816233/first-bitcoin-etf-could-be-coming-soon-as-court-rules-in-favor-of-grayscale-over-sec?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-29T19:20:00.000Z",
          "wordCount": 5248,
          "title": "First Bitcoin ETF Could Be Coming Soon as Court Rules in Favor of Grayscale Over SEC",
          "imageUrl": "https://a.fsdn.com/sd/topics/bitcoin_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/08/29/1731251/the-new-google-chat-borrows-from-slack-teams-discord-and-even-chatgpt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Google is making some big changes to Google Chat, its answer to Slack and Microsoft Teams. The messaging app -- aka the product formerly known as hangouts -- is getting a new design, some features that will feel distinctly familiar to Slack and Teams users, and a lot of Google's new Duet AI collaboration tools. From a report: Most of the new features are rolling out later this year and early next, but they add up to a much more useful and competitive Chat platform. Duet is the flagship new feature and potentially a reason for a lot of Workspace users to start using Chat. You can use Duet to search and ask questions about all your stuff in Drive and Gmail and summarize both documents and conversations. You'll also be able to use AI-powered autocorrect in Chat, and thanks to Smart Reply, you might never have to manually talk to your co-workers again. You'll be able to talk to Duet in a one-on-one chat or invoke it in a group chat or a space to help get stuff done. \"You essentially have a co-worker who has infinite memory and amazing recall at your fingertips,\" says Vamsee Jasti, Google's product lead for Chat. \n\nOutside of the AI integrations, Chat is also getting a facelift. The app has, until now, looked like a fairly barebones messaging app, with a list of conversations on the left and the active chat on the right; now, it's going to have a lot more going on. (And, yes, it will look a lot more like Slack and Teams.) There will be a new home view with all your recent conversations, plus dedicated ways to see all your starred conversations and mentions. For now, everything will be reverse-chronological, but Google says it plans to start more intelligently organizing and ordering things next year. The interface as a whole is getting a bit of cleanup, too, with larger buttons and aesthetics borrowed from Google's Material You design language.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://tech.slashdot.org/story/23/08/29/1731251/the-new-google-chat-borrows-from-slack-teams-discord-and-even-chatgpt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-29T18:40:00.000Z",
          "wordCount": 5173,
          "title": "The New Google Chat Borrows From Slack, Teams, Discord and Even ChatGPT",
          "imageUrl": "https://a.fsdn.com/sd/topics/topicgoogle_fb.gif"
        },
        {
          "id": "https://yro.slashdot.org/story/23/08/29/1736232/ifixit-petitions-government-for-the-right-to-fix-mcdonalds-ice-cream-machines?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "samleecole writes: A group of right to repair activists and consumer rights advocates are petitioning the Librarian of Congress for the right to hack McDonald's notoriously unreliable McFlurry machines for the purposes of repair, according to a copy of the petition obtained by 404 Media. \n\n\"This is a request to expand the repair exemption for consumer electronic devices to include commercial industrial equipment such as automated building management systems and industrial equipment (i.e. soft serve ice cream machines and other industrial kitchen equipment),\" the proposal, written by right to repair group iFixit and the nonprofit Public Knowledge, says. In addition, iFixit got its hands on a Taylor ice cream machine and tore it down in an effort to determine why they are broken so damn often and published a new video showing the process of taking the machine apart and explaining why they're always broken when you want fast food ice cream.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://yro.slashdot.org/story/23/08/29/1736232/ifixit-petitions-government-for-the-right-to-fix-mcdonalds-ice-cream-machines?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-29T18:00:00.000Z",
          "wordCount": 9844,
          "title": "iFixit Petitions Government For the Right To Fix McDonald's Ice Cream Machines",
          "imageUrl": "https://a.fsdn.com/sd/topics/yro_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/08/29/1711253/google-says-over-half-of-generative-ai-startups-use-its-cloud?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "When employees leave Google to join the artificial intelligence startup race, the search giant still has a way to benefit -- by keeping those former workers as cloud customers. From a report: More than half of venture-backed generative AI startups pay for Google's cloud computing platform, Alphabet, Google's parent company, said Tuesday. Of the startups valued at over $1 billion, 70% are Google Cloud customers, and about a third of those are helmed by former employees, including Anthropic, Character.ai and Cohere, the company said. That gives Google a way to extend its influence in the field even when it sheds talent. \n\nGoogle's cloud unit, which reported a profit for the first time this year, has emerged as one of the company's best bets for growth as its core search business matures. Google still trails Amazon's AWS and Microsoft's Azure in the market. But startups in the field of generative AI -- programs that can spin up images, text and video from simple prompts -- are increasingly turning to the company, said James Lee, Google Cloud's general manager for startups and AI. \"We're seeing strong momentum in our business, and we see Google Cloud as the preferred choice for startups building generative AI,\" Lee said in an interview. Google Cloud customers have the option to use AI models from Google itself as well as other companies, a degree of flexibility that appeals to startups, Lee said.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://tech.slashdot.org/story/23/08/29/1711253/google-says-over-half-of-generative-ai-startups-use-its-cloud?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-08-29T17:20:00.000Z",
          "wordCount": 4630,
          "title": "Google Says Over Half of Generative AI Startups Use Its Cloud",
          "imageUrl": "https://a.fsdn.com/sd/topics/topicgoogle_fb.gif"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}