{
  "sources": [
    {
      "title": "tonsky.me",
      "feedUrl": "http://tonsky.me/blog/atom.xml",
      "siteUrl": "https://tonsky.me/",
      "articles": []
    },
    {
      "title": "GolangCode",
      "feedUrl": "https://golangcode.com/index.xml",
      "siteUrl": "https://golangcode.com/",
      "articles": []
    },
    {
      "title": "Applied Go",
      "feedUrl": "https://appliedgo.net/index.xml",
      "siteUrl": "https://appliedgo.net/",
      "articles": []
    },
    {
      "title": "Dave Cheney",
      "feedUrl": "https://dave.cheney.net/feed/atom",
      "siteUrl": "https://dave.cheney.net",
      "articles": []
    },
    {
      "title": "David Heinemeier Hansson",
      "feedUrl": "https://world.hey.com/dhh/feed.atom",
      "siteUrl": "https://world.hey.com/dhh",
      "articles": [
        {
          "id": "https://world.hey.com/dhh/et-tu-zoom-b90a0a0a",
          "author": null,
          "description": "The corporate cause for return-to-office just claimed its perhaps most ironic victim: Zoom! The company that literally lives to sell us all on the wonders of remote collaboration wants its own people back into the office again. Which I guess is just a regression to the mean of productivity tool makers failing to believe their own marketing, but it's a bit sad none the less.\nNot the least because this push for return-to-office has now been proven completely safe for large tech corporations. Thanks to the mixture of mass layoffs earlier this year and the now numerous proclamations that remote-first is over at the majority of big companies. Safety in sentiment, safety in numbers.\nThis is an opportunistic squeeze, because what's most tech workers supposed to do? The option of simply hopping to another company has been severely limited. Outside the small realm of AI experts, most other domains just aren't anywhere nearly as contested in hiring as they once were. So this is happening now because it can happen now.\nI just hope that people who really did enjoy that remote work-lifetyle don't forget what it was like. The balance of power will presumably turn around one day again, and when it does, voting with your feet will be an option again.\nUntil then, I suspect that the likes of Shopify, Automattic, and other stalwart defenders of remote work will continue to see their openings become increasingly oversubscribed. Just like we've had at 37signals for going on two decades.\nRemote work might be receding, but it's simply too compelling an option for too many to ever disappear. The long-term trend line ain't going anywhere.",
          "link": "https://world.hey.com/dhh/et-tu-zoom-b90a0a0a",
          "publishedOn": "2023-08-07T16:30:48.000Z",
          "wordCount": 357,
          "title": "Et tu, Zoom?",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/not-everyone-can-be-the-best-ef9ebacd",
          "author": null,
          "description": "Many software developers seem to have a uniquely hard time accepting that not everyone who just tries real hard will become so good as to be among the best in this field. That there really is a discrepancy of talent that leads to a discrepancy of competence. That not everyone can or will become equally good at this job.\nIn contrast, nobody seems to have trouble with the fact that not every soccer player who loves the game and trains their best will become eligible for the Premier League. Or that becoming a brain surgeon might indeed really be harder than making it as a general practitioner, which in itself is hard enough too!\nBut becoming a developer can happen without ever really having to face an adversarial examination of your skills. There's no 90-minute clock that ends with a look at …",
          "link": "https://world.hey.com/dhh/not-everyone-can-be-the-best-ef9ebacd",
          "publishedOn": "2023-08-04T09:59:59.000Z",
          "wordCount": 698,
          "title": "Not everyone can be the best",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/x-marks-the-motivated-reasoning-13450584",
          "author": null,
          "description": "I’ve lost track of all the things that Musk has done to Twitter that ought to have brought it down by now. Scarcely a month goes by without some action triggering the incessant bells of doom, ringing from the bellies of bloviating ding dongs. And the ringing seemingly never stops long enough to allow for some basic contemplation or correction, as reality wrecks another prediction of peril.\n\n\nBut the obsession with all things Elon is so strong that there’s no room or time for introspection of any kind. It’s just on to the next faux outrage of tomorrow. Make sure you never miss a chance to be an expert on social media, advertising, team building, economics, or branding so you can tell the world’s most successful entrepreneur what a total idiot he’s being, and how much smarter, wiser, and kin…",
          "link": "https://world.hey.com/dhh/x-marks-the-motivated-reasoning-13450584",
          "publishedOn": "2023-07-27T09:16:53.000Z",
          "wordCount": 579,
          "title": "X marks the motivated reasoning",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/working-remotely-is-a-competitive-hiring-advantage-again-c182250e",
          "author": null,
          "description": "As more and more companies, especially large ones, have started demanding remote workers return to the office, the competitive hiring advantage for remote-first companies is back. And it's even bigger than before the pandemic, now that so many workers have had a taste of what life can be like when you don't have to commute to the office. This is great news for smaller companies and startups in particular.\nLet's face it, if you're trying to compete for talent with the likes of Google or Apple, you need all the help you can get, and these companies forcing everyone back into an office might just be your biggest lift. Because for quite a few people, working remotely or not has become the defining characteristic of a job. To the point where many remote workers won't even consider a position th…",
          "link": "https://world.hey.com/dhh/working-remotely-is-a-competitive-hiring-advantage-again-c182250e",
          "publishedOn": "2023-07-26T07:44:14.000Z",
          "wordCount": 459,
          "title": "Working remotely is a competitive hiring advantage again",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/pick-promise-over-proof-756604d3",
          "author": null,
          "description": "After hiring people for twenty years, I've come to accept that it's impossible to know up front what someone is truly capable of. Sure, we try our best to make good, educated guesses during the hiring process, and this is why asking finalists to do sample work projects is so crucial. But it still remains just guessing, and the truth doesn't emerge until you afford the hire a full attempt on a real project.\nThat's why I'm such a fan of starting new employees in the deep end. Putting them to work on a real project right away. But this is only half the commitment you ought to make to their potential.\nIt's just as important to retain the possibility of rapid progression by continuing to test their promise against harder and bigger challenges. I can't tell you the number of times I've been posi…",
          "link": "https://world.hey.com/dhh/pick-promise-over-proof-756604d3",
          "publishedOn": "2023-07-25T08:49:19.000Z",
          "wordCount": 538,
          "title": "Pick promise over proof",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/clear-the-barnacles-b9558830",
          "author": null,
          "description": "The easiest way to squander your focus is by paying attention to a million inconsequential things at once. These little mental barnacles add up in imperceptible ways until you suddenly feel like you're getting nowhere, no matter how hard you push. You must keep scrubbing your mind clear of such attention-sapping colonies to remain capable of making smooth, swift progress.\nThese barnacles can accumulate from middling marketing initiatives, process theatre, and tolerance for mediocre performance. All individually presenting as more hassle to deal with than to dismiss, but combined killing the efficiency and focus on progress.\nBut they can also be things that actually appears to be working well enough, just not up to the bar of your very best. Those are the tricky ones. The base hits, the modest accomplishments, the things you might even have celebrated once. The past darlings.\nIt just doesn't matter. You can't keep stuffing your head with ever more things to pay partial attention to every month and expect to keep a clear eye on the horizon and the future. There's only room for so much.\nThe hardest part about this is not to wait until it's too much, until the drag is actually there. Keep your mind below carrying capacity, such that there's room for serendipity, at all times.\nIn short, be decisive about what you'll no longer do. Summon your inner Jack Welch to cut at least the bottom 10% of the stuff dragging your attention every few months or so.",
          "link": "https://world.hey.com/dhh/clear-the-barnacles-b9558830",
          "publishedOn": "2023-07-24T08:42:45.000Z",
          "wordCount": 331,
          "title": "Clear the barnacles",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/don-t-lose-your-unreasonable-sense-of-urgency-b381699c",
          "author": null,
          "description": "Getting anything new off the ground usually requires a tremendous amount of urgency. It's hard to launch something  from nothing into reality without being incredibly impatient for progress. Thus most founders begin 🎶Their Journey🎶 sprinting from one pressing problem to the next in rapid succession to achieve their lift off. But reaching escape velocity doesn't guarantee you'll keep going, unless you retain the propulsion from an unreasonable sense of urgency.\nYet the irony of being successful in business is that it'll invariably attract smart people who can tell you all the good reasons for why you can no longer go as quickly as you once did. Why it's actually natural, perhaps even good, that a company ten or a hundred times the size of what it was when it first became successful now has to travel at half the pace to be prudent.\nDon't listen too closely. Not because they'll be wrong in any narrow technical sense, but because they're wrong in the broad directional sense. The risk of succumbing to the rigor mortis of success is usually far greater than the risk of making a mistake by not considering and mitigating all possible bad outcomes up front.\nIt's the risk of mandating everyone put on a bike helmet, only to realize that doing so means fewer people will bike, leading to worse health outcomes for all. Being obsessive about specific, short-term risks often sits in opposition to worrying about fuzzy, long-term risks.\nAnd nobody will be as motivated as a founder to inject risk into the business. Sticking with an unreasonable sense of urgency undoubtedly comes with clear and immediate risks. But giving up on it with even worse, less defined ones.\nSo don't give up. Every company needs to have someone asking why we can't launch next Monday instead of next month. Willing to accept and underwrite the risks needed to make it happen. And with a stomach for occasionally being wrong, eating the loss, but keep playing.",
          "link": "https://world.hey.com/dhh/don-t-lose-your-unreasonable-sense-of-urgency-b381699c",
          "publishedOn": "2023-07-20T15:33:29.000Z",
          "wordCount": 420,
          "title": "Don't lose your unreasonable sense of urgency",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/there-s-no-rebound-in-sight-for-unprofitable-saas-49a06b4d",
          "author": null,
          "description": "Anyone reviewing their S&P 500 retirement fund these days will do so with a broader smile than last year. The market as a whole is up, and if you're in the whole market, you're benefitting. But all of that upside, basically, belongs to just a handful of mega tech companies. \nThis is not a general turn-around, and it's barely a turn-around at all for the unprofitable SaaS companies that saw their bubble burst last year. In software, only cash spigots like Apple and Microsoft are able to set fresh all-time highs. Investors who bought into money pits like Asana, Monday, or Smartsheet are still likely to be in despair over their evaporated values.\n  \n      \n        \n\n  \n(Analysis by Coatue from 6/30/2023.)\nThis is an important change from the marathon bull run that lifted all tech businesses, …",
          "link": "https://world.hey.com/dhh/there-s-no-rebound-in-sight-for-unprofitable-saas-49a06b4d",
          "publishedOn": "2023-07-19T17:42:50.000Z",
          "wordCount": 654,
          "title": "There's no rebound in sight for unprofitable SaaS",
          "imageUrl": "https://world.hey.com/dhh/49a06b4d/representations/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHNLd2Zqb2k1TiIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--bf444f54cdd05433fccf81d2ee0dcfb4b4c98445/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDRG9UY21WemFYcGxYM1J2WDJacGJHeGJCMmtDc0FScEFuWUNPZ3h4ZFdGc2FYUjVhUzA2Q25OMGNtbHdWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--5f3b12054ee1575e23e552561c36229a846c13ea/market-reset.png"
        }
      ]
    },
    {
      "title": "Jason Fried",
      "feedUrl": "https://world.hey.com/jason/feed.atom",
      "siteUrl": "https://world.hey.com/jason",
      "articles": [
        {
          "id": "https://world.hey.com/jason/effective-productive-acfa210d",
          "author": null,
          "description": "So much talk about hacking productivity these days. There’s an endless stream of methodologies and tools promising to make you more productive. But more productive at what?\nProductivity is for machines, not for people. There’s nothing meaningful about packing some number of work units into some amount of time or squeezing more into less.\nMachines can work 24/7; humans can’t.\nWhen people focus on productivity, they end up focusing on being busy. Filling every moment with something to do. And there’s always more to do!\nWe don’t believe in busyness at Basecamp. We believe in effectiveness. How little can we do? How much can we cut out? Instead of adding to-dos, we add to-don’ts.\nBeing productive is about occupying your time—filling your schedule to the brim and getting as much as you can. Being effective is about finding more of your time unoccupied and open for other things besides work. Time for leisure, time for family and friends. Or time for doing absolutely nothing.\nYes, it’s perfectly okay to have nothing to do. Or, better yet, nothing worth doing. If you’ve only got three hours of work to do on a given day, then stop. Don’t fill your day with five more just to stay busy or feel productive. Not doing something that isn’t worth doing is a wonderful way to spend your time.\n——\nvia It Doesn't Have to Be Crazy at Work\nhttps://basecamp.com/books/calm\n\n-Jason",
          "link": "https://world.hey.com/jason/effective-productive-acfa210d",
          "publishedOn": "2023-07-20T17:31:49.000Z",
          "wordCount": 299,
          "title": "Effective > Productive",
          "imageUrl": "https://world.hey.com/jason/avatar-9f11ce77d31e68e834c564594ee0bc32a005ee8d"
        },
        {
          "id": "https://world.hey.com/jason/stalking-not-sales-8c750b03",
          "author": null,
          "description": "What you see above is a 17-day sales sequence, or cadence. A friend of mine just sent it over and it creeped me out.\nFrom email to LinkedIn to phone to email back to LinkedIn back to phone, and so on. I assume day 18 would be a bullhorn outside your window.\nSomehow this is allowed to be called sales. But in any other realm it would be called stalking.\nThe sales industry calls these moments \"touches\", which is even creepier. And then, check out that last one: The break up email. Ouch.\nImagine if you ran this playbook when trying to sell yourself in a new relationship (or save yourself in a failing one). You meet someone new, and you contact them 15 times in a variety of ways over 17 days. And sometimes multiple times a day after they've already ignored your earlier attempts. They'd be right in calling the cops and getting a restraining order.\nI know this isn't how sales always works, but it's prevalent enough. I've been on the receiving end before. It's just wrong, even if it \"works\" sometimes.\nClean up in aisle sales! Something's broken.\n\n-Jason",
          "link": "https://world.hey.com/jason/stalking-not-sales-8c750b03",
          "publishedOn": "2023-07-17T15:09:24.000Z",
          "wordCount": 259,
          "title": "Stalking, not sales",
          "imageUrl": "https://world.hey.com/jason/8c750b03/representations/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHNLd2VmeHdSTiIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--8057cdd1b830c2a6d04b5b7c4d07bcfbbdcddfe4/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDRG9UY21WemFYcGxYM1J2WDJacGJHeGJCMmtDc0FScEFuWUNPZ3h4ZFdGc2FYUjVhUzA2Q25OMGNtbHdWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--5f3b12054ee1575e23e552561c36229a846c13ea/salessequence.png"
        },
        {
          "id": "https://world.hey.com/jason/who-do-you-do-business-with-47c6c9d5",
          "author": null,
          "description": "Way back when we launched the first version of Basecamp in 2004, we ran all our credit card charges through a merchant account provided by JP Morgan Chase.\nCharging credit cards wasn't easy in the early 2000s. This was back when being an \"internet company\" was a major red flag. The process required mounds of paperwork, proof, and business model scrutiny just to get approved. Barely capable, ancient APIs sorta kinda let you hook into internal systems. Charging a card successfully felt like a miracle. You had no idea. It wasn't years later until companies like Stripe made it simple.\nWhile you were never really happy with the service, you had to have it. And switching to another service meant going through the whole ungainly process again. And the grass was probably browner.\nHowever, one day …",
          "link": "https://world.hey.com/jason/who-do-you-do-business-with-47c6c9d5",
          "publishedOn": "2023-07-12T18:16:32.000Z",
          "wordCount": 605,
          "title": "Who do you do business with?",
          "imageUrl": "https://world.hey.com/jason/47c6c9d5/representations/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHNLd2VpMzdkTSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--38165328c6ce4d6317f10b1dc241ab93034c3a49/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDRG9UY21WemFYcGxYM1J2WDJacGJHeGJCMmtDc0FScEFuWUNPZ3h4ZFdGc2FYUjVhUzA2Q25OMGNtbHdWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--5f3b12054ee1575e23e552561c36229a846c13ea/basecampwelcomeletter.png"
        },
        {
          "id": "https://world.hey.com/jason/you-only-compete-with-one-thing-48a20d93",
          "author": null,
          "description": "There's so much chatter and advice out there about how to handle \"the competition\".\nHow much should you worry about them, what you can do to beat them, how much should you pay attention to what they're doing, how you should respond when they release or say something new, what you should say when a customer compares you to them, etc.\nEssentially, lots of they's and them's.\nOf course you compete in a market with multiple options, but that's not your real competition.\nYour real competition are your costs. Yours, not theirs. You, not them.\nYou ultimately stay in business when you make more money than you spend. The amount you make depends on a number of factors, many surprisingly far outside your control.\nBut one of the few controls you have in business is cost control. Bills don't materialize…",
          "link": "https://world.hey.com/jason/you-only-compete-with-one-thing-48a20d93",
          "publishedOn": "2023-07-10T17:24:53.000Z",
          "wordCount": 698,
          "title": "You only compete with one thing",
          "imageUrl": "https://world.hey.com/jason/avatar-9f11ce77d31e68e834c564594ee0bc32a005ee8d"
        }
      ]
    },
    {
      "title": "The Plain Text Project",
      "feedUrl": "https://plaintextproject.online/feed.xml",
      "siteUrl": "https://plaintextproject.online",
      "articles": []
    },
    {
      "title": "Andrew Kelley",
      "feedUrl": "https://andrewkelley.me/rss.xml",
      "siteUrl": "http://andrewkelley.me/",
      "articles": []
    },
    {
      "title": "Martin Fowler",
      "feedUrl": "https://martinfowler.com/feed.atom",
      "siteUrl": "https://martinfowler.com/feed.atom",
      "articles": [
        {
          "id": "https://martinfowler.com/articles/exploring-gen-ai.html#in-line-assistance---how-can-it-get-in-the-way?",
          "author": null,
          "description": "While coding assistants like Copilot can improve speed and flow, they\n     can also disrupt it. Birgitta Böckeler looks at two ways\n     in which they can get in the way: amplifying bad or outdated\n     practices, and review fatigue.\nmore…",
          "link": "https://martinfowler.com/articles/exploring-gen-ai.html#in-line-assistance---how-can-it-get-in-the-way?",
          "publishedOn": "2023-08-03T15:37:00.000Z",
          "wordCount": 4050,
          "title": "Exploring Gen AI: how can in-line assistance get in the way?",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#exit",
          "author": null,
          "description": "Sofia and Stefania begin their examination of how to\n     get out of the bottleneck of surging cloud costs by relating a case study\n     from a recent client - illustrating how the cost control can be separated\n     into reduce and sustain phases.\nmore…",
          "link": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#exit",
          "publishedOn": "2023-08-01T14:19:00.000Z",
          "wordCount": 2494,
          "title": "A case study of getting out of the costs bottleneck",
          "imageUrl": "https://martinfowler.com/articles/bottlenecks-of-scaleups/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/exploring-gen-ai.html#in-line-assistance---when-is-it-more-useful?",
          "author": null,
          "description": "The most widely used form of coding assistance in Thoughtworks at the\n     moment is in-line code generation in the IDE, where an IDE extension\n     generates suggestions for the developer as they are typing.\n     Birgitta Böckeler looks at the factors that\n     impact the usefulness of these suggestions, indicating where they\n     lead to safe waters, and the rocks that we need to look out for.\nmore…",
          "link": "https://martinfowler.com/articles/exploring-gen-ai.html#in-line-assistance---when-is-it-more-useful?",
          "publishedOn": "2023-08-01T13:51:00.000Z",
          "wordCount": 3272,
          "title": "Exploring Gen AI: When is in-line assistance useful?",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html",
          "author": null,
          "description": "As startups begin to grow rapidly, they often find that early decisions\n     that helped them find a product/market fit lead to excessive costs once\n     traffic increases. These costs can threaten a scaleup's ability to grow.\n     Sofia Tania and Stefania Stefansdottir have worked with\n     many scaleups in this predicament and share their approach to understanding\n     and reducing these costs.\nmore…",
          "link": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html",
          "publishedOn": "2023-07-31T13:30:00.000Z",
          "wordCount": 1682,
          "title": "Bottlenecks of Scaleups: Cost Efficiency",
          "imageUrl": "https://martinfowler.com/articles/bottlenecks-of-scaleups/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/exploring-gen-ai.html#median---a-tale-in-three-functions",
          "author": null,
          "description": "Birgitta Böckeler continues her explorations in using\n     LLMs, this time by asking GitHub Copilot to write a median\n     function. It gave her three suggestions to choose from. The\n     experience shows you still have to know what you're doing when asking LLMs\n     to write code, since the LLM's programming skills are often rather flawed.\nmore…",
          "link": "https://martinfowler.com/articles/exploring-gen-ai.html#median---a-tale-in-three-functions",
          "publishedOn": "2023-07-27T14:34:00.000Z",
          "wordCount": 2163,
          "title": "Exploring Gen AI - Three versions of a median",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/exploring-gen-ai.html#the-toolchain",
          "author": null,
          "description": "My colleague Birgitta Böckeler has long been one of our senior\n     technology leaders in Germany. She's now moved into a new role coordinating\n     our work with Generative AI and its effect of software delivery practices.\n     She's decided to publish her exploration in a series of memos. The first\n     memo looks at the current toolchain for LLMs, categorizing them by what\n     tasks they help with, how we interact with the LLM, and where they come from.\nmore…",
          "link": "https://martinfowler.com/articles/exploring-gen-ai.html#the-toolchain",
          "publishedOn": "2023-07-26T14:52:00.000Z",
          "wordCount": 1082,
          "title": "Exploring Gen AI - The toolchain",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/bliki/TeamTopologies.html",
          "author": null,
          "description": "Any large software effort, such as the software estate for a large\n    company, requires a lot of people - and whenever you have a lot of people\n    you have to figure out how to divide them into effective teams. Forming\n    Business Capability Centric teams helps software efforts to\n    be responsive to customers’ needs, but the range of skills required often\n    overwhelms such teams. Team Topologies is a model\n    for describing the organization of software development teams,\n    developed by Matthew Skelton and Manuel Pais. It defines four forms\n    of teams and three modes of team\n    interactions. The model encourages healthy interactions that allow \n    business-capability centric teams to flourish in their task of providing a\n    steady flow of valuable software.\nThe primary kind o…",
          "link": "https://martinfowler.com/bliki/TeamTopologies.html",
          "publishedOn": "2023-07-25T13:25:00.000Z",
          "wordCount": 1618,
          "title": "Bliki: TeamTopologies",
          "imageUrl": "https://martinfowler.com/bliki/images/team-topologies/diagram.png"
        },
        {
          "id": "https://martinfowler.com/bliki/TwoPizzaTeam.html",
          "author": null,
          "description": "A two-pizza team is a small team\n  that fully supports software for a particular business capability. The term\n  became popular as it used to describe how Amazon organized their software staff.\nThe name suggests the most obvious aspect of such teams, their size. The\n  name comes from the principle that the team should no larger than can be fed\n  with two pizzas. (Although we are talking about American Pizzas here, which\n  seemed alarmingly huge when I first encountered them over here.) Keeping a\n  team small keeps it cohesive, forming tight working relationships. Typically I\n  hear this means such teams are about 5-8 people, although my experience\n  suggests that the upper limit is somewhere about 15.\nAlthough the name focuses solely on the size, just as important is the\n  team's focus. A …",
          "link": "https://martinfowler.com/bliki/TwoPizzaTeam.html",
          "publishedOn": "2023-07-25T13:22:00.000Z",
          "wordCount": 680,
          "title": "Bliki: TwoPizzaTeam",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/platform-teams-stuff-done.html",
          "author": null,
          "description": "Platform teams have a unique reliance on other teams to ensure adoption\n     of their platform - getting code changes into other teams' codebase is\n     critical to their success. Pete Hodgson structures how\n     platform teams collaborate into phases\n     of migration, consumption, and evolution. He describes what's different in\n     each of these phases, the operating models to adopt, and which cross-team\n     collaboration patterns work best.\nmore…",
          "link": "https://martinfowler.com/articles/platform-teams-stuff-done.html",
          "publishedOn": "2023-07-19T14:21:00.000Z",
          "wordCount": 4480,
          "title": "How platform teams get stuff done",
          "imageUrl": "https://martinfowler.com/articles/platform-teams-stuff-done/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/xapo-architecture-experience.html",
          "author": null,
          "description": "It's common to see a centralized architecture function that sets\n     standards and oversees development projects. Such teams often suffer from\n     being far removed from the issues of implementation with long\n     feedback loops that slow down the flow of work. To counter these problems,\n     many organizations have explored a decentralized approach to yield\n     alignment between teams without these problems. One such organization is\n     Xapo bank, which did this using ideas taken from Domain-Driven Design, Team\n     Topologies, and the Architectural Advice Process.\nmore…",
          "link": "https://martinfowler.com/articles/xapo-architecture-experience.html",
          "publishedOn": "2023-07-18T11:46:00.000Z",
          "wordCount": 5389,
          "title": "Decentralizing the Practice of Architecture at Xapo Bank",
          "imageUrl": "https://martinfowler.com/articles/xapo-architecture-experience/card.png"
        }
      ]
    },
    {
      "title": "Adam Wathan's Work Journal",
      "feedUrl": "https://adamwathan.me/journal/rss.xml",
      "siteUrl": "https://adamwathan.me/journal",
      "articles": []
    },
    {
      "title": "Rust Blog",
      "feedUrl": "https://blog.rust-lang.org/feed.xml",
      "siteUrl": "https://blog.rust-lang.org/",
      "articles": [
        {
          "id": "https://blog.rust-lang.org/2023/08/07/Rust-Survey-2023-Results.html",
          "author": null,
          "description": "Hello, Rustaceans!\nFor the 6th year in a row, the Rust Project conducted a survey on the Rust programming language, with participation from project maintainers, contributors, and those generally interested in the future of Rust. This edition of the annual State of Rust Survey opened for submissions on December 5 and ran until December 22, 2022.\nFirst, we'd like to thank you for your patience on these long delayed results. We hope to identify a more expedient and sustainable process going forward so that the results come out more quickly and have even more actionable insights for the community.\nThe goal of this survey is always to give our wider community a chance to express their opinions about the language we all love and help shape its future. We’re grateful to those of you who took the …",
          "link": "https://blog.rust-lang.org/2023/08/07/Rust-Survey-2023-Results.html",
          "publishedOn": "2023-08-07T00:00:00.000Z",
          "wordCount": 1292,
          "title": "2022 Annual Rust Survey Results",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/2023/08/03/Rust-1.71.1.html",
          "author": null,
          "description": "The Rust team has published a new point release of Rust, 1.71.1. Rust is a\nprogramming language that is empowering everyone to build reliable and\nefficient software.\nIf you have a previous version of Rust installed via rustup, getting Rust\n1.71.1 is as easy as:\nrustup update stable\n\nIf you don't have it already, you can get rustup from the\nappropriate page on our website.\nWhat's in 1.71.1 stable\nRust 1.71.1 fixes Cargo not respecting the umask when extracting dependencies,\nwhich could allow a local attacker to edit the cache of extracted source code\nbelonging to another local user, potentially executing code as another user.\nThis security vulnerability is tracked as CVE-2023-38497, and you can read\nmore about it on the advisory we published earlier today. We\nrecommend all users to update their toolchain as soon as possible.\nRust 1.71.1 also addresses several regressions introduced in Rust 1.71.0,\nincluding bash completion being broken for users of Rustup, and the\nsuspicious_double_ref_op being emitted when calling borrow() even though it\nshouldn't.\nYou can find more detailed information on the specific regressions, and other\nminor fixes, in the release notes.\nContributors to 1.71.1\nMany people came together to create Rust 1.71.1. We couldn't have done it\nwithout all of you. Thanks!",
          "link": "https://blog.rust-lang.org/2023/08/03/Rust-1.71.1.html",
          "publishedOn": "2023-08-03T00:00:00.000Z",
          "wordCount": 277,
          "title": "Announcing Rust 1.71.1",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/2023/08/03/cve-2023-38497.html",
          "author": null,
          "description": "This is a cross-post of the official security advisory. The\nofficial advisory contains a signed version with our PGP key, as well.\nThe Rust Security Response WG was notified that Cargo did not respect the umask\nwhen extracting crate archives on UNIX-like systems. If the user downloaded a\ncrate containing files writeable by any local user, another local user could\nexploit this to change the source code compiled and executed by the current\nuser.\nThis vulnerability has been assigned CVE-2023-38497.\nOverview\nIn UNIX-like systems, each file has three sets of permissions: for the user\nowning the file, for the group owning the file, and for all other local users.\nThe \"umask\" is configured on most systems to limit those permissions\nduring file creation, removing dangerous ones. For example, the de…",
          "link": "https://blog.rust-lang.org/2023/08/03/cve-2023-38497.html",
          "publishedOn": "2023-08-03T00:00:00.000Z",
          "wordCount": 585,
          "title": "Security advisory for Cargo (CVE-2023-38497)",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/2023/07/13/Rust-1.71.0.html",
          "author": null,
          "description": "The Rust team is happy to announce a new version of Rust, 1.71.0. Rust is a programming language empowering everyone to build reliable and efficient software.\nIf you have a previous version of Rust installed via rustup, you can get 1.71.0 with:\nrustup update stable\n\nIf you don't have it already, you can get rustup from the appropriate page on our website, and check out the detailed release notes for 1.71.0 on GitHub.\nIf you'd like to help us out by testing future releases, you might consider updating locally to use the beta channel (rustup default beta) or the nightly channel (rustup default nightly). Please report any bugs you might come across!\nWhat's in 1.71.0 stable\nC-unwind ABI\n1.71.0 stabilizes C-unwind (and other -unwind suffixed ABI variants1).\nThe behavior for unforced unwinding (…",
          "link": "https://blog.rust-lang.org/2023/07/13/Rust-1.71.0.html",
          "publishedOn": "2023-07-13T00:00:00.000Z",
          "wordCount": 757,
          "title": "Announcing Rust 1.71.0",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        }
      ]
    },
    {
      "title": "Inside Rust Blog",
      "feedUrl": "https://blog.rust-lang.org/inside-rust/feed.xml",
      "siteUrl": "https://blog.rust-lang.org/inside-rust/",
      "articles": [
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/08/02/rotating-compiler-leads.html",
          "author": null,
          "description": "As initiated in late 2020 and ratified by RFC 3262, the Rust compiler team uses a rotating system of co-leads.\nAfter two and a half years, we've decided its time to rotate the leadership again!\nWelcome David Wood\nFelix Klock is stepping down from his role as senior lead and David Wood is joining Wesley Wiser as the new junior lead for the team.\nFelix remains a valued member of the compiler team (and also the language design team).\nFelix will be focusing on reducing the sizes of Rust futures, and on improving the state of the art for authoring Unsafe Rust, via projects such as Krabcake.\nDavid has been a contributor to the Rust project since 2017, a compiler-contributor since 2019 and became a compiler team member in 2021.\nHis contributions include work on the diagnostic translation effort, split DWARF support, polymorphisation, non-lexical lifetimes initiative and general maintenance to the compiler.\nDavid has also been a contributor to the governance and organization of the compiler team itself via policy proposals and regular participation in our weekly triage and steering meetings.\nFelix and I are excited to welcome David into this leadership role and I am thrilled to be working alongside him.",
          "link": "https://blog.rust-lang.org/inside-rust/2023/08/02/rotating-compiler-leads.html",
          "publishedOn": "2023-08-02T00:00:00.000Z",
          "wordCount": 281,
          "title": "Rotating Rust compiler team leadership",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/08/01/1.71.1-prerelease.html",
          "author": null,
          "description": "The 1.71.1 pre-release is ready for testing. The release is scheduled for\nAugust 3. Release notes can be found here.\nYou can try it out locally by running:\nRUSTUP_DIST_SERVER=https://dev-static.rust-lang.org rustup update stable\n\nThe index is https://dev-static.rust-lang.org/dist/2023-08-01/index.html.\nYou can leave feedback on the internals thread.\nThe release team is also thinking about changes to our pre-release process:\nwe'd love your feedback on this GitHub issue.",
          "link": "https://blog.rust-lang.org/inside-rust/2023/08/01/1.71.1-prerelease.html",
          "publishedOn": "2023-08-01T00:00:00.000Z",
          "wordCount": 139,
          "title": "1.71.1 pre-release testing",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/07/25/leadership-council-update.html",
          "author": null,
          "description": "Hello again from the Rust Leadership Council. In our first blog post, we laid out several immediate goals for the council and promised to report back on their progress. It has been about a month since our first update so we wanted to share how it's going and what we're working on now.\nAccomplishments so far\nIn our first post, we wrote:\nIn the coming weeks we will be establishing the basic infrastructure for the group, including creating a plan for regular meetings and a process for raising agenda items, setting up a team repository, and ultimately completing the transition from the former Rust leadership structures.\nWe have made progress on each of these things.\nFor the last month we have been holding weekly meetings and will continue to do so for at least the next month. In the long term,…",
          "link": "https://blog.rust-lang.org/inside-rust/2023/07/25/leadership-council-update.html",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 895,
          "title": "July 2023 Leadership Council Update",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/07/21/crates-io-postmortem.html",
          "author": null,
          "description": "(based on https://www.atlassian.com/incident-management/postmortem/templates)\nSummary\nOn 2023-07-20 between 12:17 and 12:30 UTC all crate downloads from crates.io were broken due to a deployment that contained a bug in the download URL generation.\nDuring this time we had an average of 4.71K requests per second to crates.io, resulting in about 3.7M failed requests, including the retry attempts from cargo.\nThe incident was noticed by the developer triggering the production deployment after seeing elevated request-per-second numbers in our monitoring dashboard after the deployment. At this point the root cause for the elevated numbers was not clear yet, but a community member notified the developer via Zulip.\nImmediately after the notification, the broken deployment was rolled back to the pre…",
          "link": "https://blog.rust-lang.org/inside-rust/2023/07/21/crates-io-postmortem.html",
          "publishedOn": "2023-07-21T00:00:00.000Z",
          "wordCount": 1653,
          "title": "crates.io Postmortem: Broken Crate Downloads",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/07/17/trait-system-refactor-initiative.html",
          "author": null,
          "description": "As announced in the Types Team announcement post at the start of this year, the Types Team has started to reimplement the trait solver of rustc. This refactor is similar to Chalk, but directly integrated into the existing codebase using the experience gathered over the last few years. Unlike Chalk, the new trait solver has the sole goal of replacing the existing implementation. We are separately working on formalizing the type system in a-mir-formality. It has now been half a year since that announcement which matches the first step of our roadmap.\nBy reimplementing the trait solver of rustc we are able to fix many subtle bugs and inefficiencies of the existing implementation. This should result in faster compilation speed and fewer bugs. The new trait solver implementation should also unb…",
          "link": "https://blog.rust-lang.org/inside-rust/2023/07/17/trait-system-refactor-initiative.html",
          "publishedOn": "2023-07-17T00:00:00.000Z",
          "wordCount": 903,
          "title": "Rustc Trait System Refactor Initiative Update",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/07/10/1.71.0-prerelease.html",
          "author": null,
          "description": "The 1.71.0 pre-release is ready for testing. The release is scheduled for\nJuly 13. Release notes can be found here.\nYou can try it out locally by running:\nRUSTUP_DIST_SERVER=https://dev-static.rust-lang.org rustup update stable\n\nThe index is https://dev-static.rust-lang.org/dist/2023-07-10/index.html.\nYou can leave feedback on the internals thread.\nThe release team is also thinking about changes to our pre-release process:\nwe'd love your feedback on this GitHub issue.",
          "link": "https://blog.rust-lang.org/inside-rust/2023/07/10/1.71.0-prerelease.html",
          "publishedOn": "2023-07-10T00:00:00.000Z",
          "wordCount": 139,
          "title": "1.71.0 pre-release testing",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        }
      ]
    },
    {
      "title": "Jorge Manrubia",
      "feedUrl": "https://world.hey.com/jorge/feed.atom",
      "siteUrl": "https://world.hey.com/jorge",
      "articles": [
        {
          "id": "https://world.hey.com/jorge/globals-callbacks-and-other-sacrileges-d9832c35",
          "author": null,
          "description": "This article was originally published in the 37signals dev blog.\n\nSacrificing purity for convenience is one of the Rails pillars. This principle informs several Rails features that some recommend avoiding but that we happily use in our apps. In this post, I’ll discuss how we use three of those in Basecamp.\n\nI’ll show some examples involving projects. In Basecamp, a Bucket represents a top-level container of data, and there are several types of buckets, one of which is a Project. Internally, we implement this with delegated type attribute, where a Bucket has an associated Bucketable. A Bucket can contain many Events, and an Event is a holder for information on the related request, such as the IP or the transaction id (Event::Request) and some additional information (Event::Detail).\n\n  \n    …",
          "link": "https://world.hey.com/jorge/globals-callbacks-and-other-sacrileges-d9832c35",
          "publishedOn": "2023-08-01T07:18:20.000Z",
          "wordCount": 1903,
          "title": "Globals, callbacks and other sacrileges",
          "imageUrl": "https://world.hey.com/jorge/d9832c35/representations/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHNLd2YyT3c1TyIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--4ab7d06f3d845b2692f05bfaaee944187585be01/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDRG9UY21WemFYcGxYM1J2WDJacGJHeGJCMmtDc0FScEFuWUNPZ3h4ZFdGc2FYUjVhUzA2Q25OMGNtbHdWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--5f3b12054ee1575e23e552561c36229a846c13ea/CleanShot%202023-08-01%20at%2009.18.53@2x.png"
        },
        {
          "id": "https://world.hey.com/jorge/let-people-be-52bd85a4",
          "author": null,
          "description": "Have side-projects / don’t have them.\nDo open source / don’t do it.\nHave tech-related hobbies / have completely unrelated ones.\nHave children / don’t have them. \nWork long hours / never put in an extra hour.\nSmall and risky / large and secure.\nWork for others / work for yourself.\nWork out of passion / work to pay the bills. \n\n\nThose are examples of dichotomies that enter my radar from time to time. Usually, someone criticizes someone else’s position after performing some intellectual judo to vilify it.\n\n\nWhenever I see people telling others how to live, I can’t help wondering: isn’t figuring out what works for you already difficult enough?\n\n\nLet people be.",
          "link": "https://world.hey.com/jorge/let-people-be-52bd85a4",
          "publishedOn": "2023-07-10T15:20:49.000Z",
          "wordCount": 156,
          "title": "Let people be",
          "imageUrl": "https://world.hey.com/jorge/avatar-1dbd00c15bf56ad31d816708f6e138fd7d92ff21"
        }
      ]
    },
    {
      "title": "Notes on software development",
      "feedUrl": "https://notes.eatonphil.com/rss.xml",
      "siteUrl": "http://notes.eatonphil.com/",
      "articles": [
        {
          "id": "http://notes.eatonphil.com/2023-07-11-we-put-a-distributed-database-in-the-browse.html",
          "author": null,
          "description": "This is an external post of mine. Click\nhere\nif you are not redirected.",
          "link": "http://notes.eatonphil.com/2023-07-11-we-put-a-distributed-database-in-the-browse.html",
          "publishedOn": "2023-07-11T00:00:00.000Z",
          "wordCount": 1989,
          "title": "We put a distributed database in the browser – and made a game of it",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "CoRecursive: Coding Stories",
      "feedUrl": "https://corecursive.libsyn.com/feed",
      "siteUrl": "http://corecursive.com",
      "articles": [
        {
          "id": "f2245ac3-a554-43ca-a0f1-14bac7674e2b",
          "author": null,
          "description": "Learning to code can feel impossible. Like facing a sheer rock wall with no ropes or harnesses. But what if there was a path up the mountain? A trail blazed smooth by master coders who went before? \n In this episode, we'll follow that path. We'll hear the stories of legends like Seymour Papert, who championed active, project-based learning. Of Fred Brooks, who discovered that pairing accelerates learning. And more. \n The research shows that with the right methods, motivation, and support, anyone can master learning curves and summit. So join me as we uncover the science behind learning to code. You'll walk away fired up, equipped with proven techniques to unlock your potential and conquer new technical skills. \n  \n  The climb is on!  \n  \nEpisode Page\n Support The Show\n Subscribe To The Podcast\n Join The Newsletter",
          "link": "https://corecursive.com/the-science-of-learning-to-code/",
          "publishedOn": "2023-08-02T10:00:00.000Z",
          "wordCount": null,
          "title": "The Science of Learning to Code",
          "itunes": {
            "duration": "50:45"
          },
          "enclosure": {
            "length": "74229971",
            "type": "audio/mpeg",
            "url": "https://chtbl.com/track/7D91G/traffic.libsyn.com/secure/corecursive/091-Learning_Research.mp3?dest-id=628353"
          },
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Notes on software development",
      "feedUrl": "https://notes.eatonphil.com/rss.xml",
      "siteUrl": "http://notes.eatonphil.com/",
      "articles": [
        {
          "id": "http://notes.eatonphil.com/2023-07-11-we-put-a-distributed-database-in-the-browse.html",
          "author": null,
          "description": "This is an external post of mine. Click\nhere\nif you are not redirected.",
          "link": "http://notes.eatonphil.com/2023-07-11-we-put-a-distributed-database-in-the-browse.html",
          "publishedOn": "2023-07-11T00:00:00.000Z",
          "wordCount": 1989,
          "title": "We put a distributed database in the browser – and made a game of it",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Dmitri Pavlutin Blog",
      "feedUrl": "https://dmitripavlutin.com/rss.xml",
      "siteUrl": "https://dmitripavlutin.com",
      "articles": []
    },
    {
      "title": "Dietcode | Sid's blog",
      "feedUrl": "https://dietcode.io/rss",
      "siteUrl": "https://dietcode.io/",
      "articles": []
    },
    {
      "title": "Infrequently Noted",
      "feedUrl": "https://infrequently.org/feed/",
      "siteUrl": "https://infrequently.org/feed/feed.xml",
      "articles": []
    },
    {
      "title": "Moving the Limit",
      "feedUrl": "https://movingthelimit.com/feed/",
      "siteUrl": "https://movingthelimit.com/",
      "articles": [
        {
          "id": "https://movingthelimit.com/a-practical-way-to-detect-cargo-cult-thinking/",
          "author": null,
          "description": "Note: sharp readers on Hacker News pointed out that this article seems to talk more about unfalsifiable beliefs and cognitive dissonance than cargo-culting. To be clear, in this article, \"cargo cults\" are purely an illustrative tool to talk about the dangers of holding unfalsifiable beliefs. Thanks for helping me clarify!\nNobody describes it better than Richard Feynman:\nIn the South Seas there is a Cargo Cult of people.  During the war they saw airplanes land with lots of good materials, and they want the same thing to happen now.  So they’ve arranged to make things like runways, to put fires along the sides of the runways, to make a wooden hut for a man to sit in, with two wooden pieces on his head like headphones and bars of bamboo sticking out like antennas — he’s the controller — and t…",
          "link": "https://movingthelimit.com/a-practical-way-to-detect-cargo-cult-thinking/",
          "publishedOn": "2023-08-04T19:46:40.997Z",
          "wordCount": 1506,
          "title": "a practical way to detect cargo-cult thinking",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Lucas F. Costa",
      "feedUrl": "https://lucasfcosta.com/feed.xml",
      "siteUrl": "https://lucasfcosta.com/",
      "articles": []
    },
    {
      "title": "taylor.town",
      "feedUrl": "https://taylor.town/feed.xml",
      "siteUrl": "https://taylor.town/feed.xml",
      "articles": [
        {
          "id": "https://taylor.town/friday-demos",
          "author": null,
          "description": "Add demos to a #demo-friday channel in Slack or Teams.",
          "link": "https://taylor.town/friday-demos",
          "publishedOn": "2023-08-06T00:00:00.000Z",
          "wordCount": 666,
          "title": "Share Demos Every Friday",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/entire-career",
          "author": null,
          "description": "Westbrook spent 35 years in a codebase that allegedly powers some sort of medical software somewhere. During his tenure, he contributed hundreds of lines of code to his projects.",
          "link": "https://taylor.town/entire-career",
          "publishedOn": "2023-08-02T00:00:00.000Z",
          "wordCount": 273,
          "title": "Man Spends Entire Career Mastering Crappy Codebase",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/medium",
          "author": null,
          "description": "Big things make life meaningful. Small things make life delightful.",
          "link": "https://taylor.town/medium",
          "publishedOn": "2023-08-01T00:00:00.000Z",
          "wordCount": 319,
          "title": "go big or go small or go home but don't go medium",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/town-hall-0013",
          "author": null,
          "description": "Your skull cannot be tented nor fumigated.",
          "link": "https://taylor.town/town-hall-0013",
          "publishedOn": "2023-07-31T00:00:00.000Z",
          "wordCount": 673,
          "title": "Town Hall #13: Pests",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/corporate-camouflage",
          "author": null,
          "description": "Stay at your company for a long time, not a good time.",
          "link": "https://taylor.town/corporate-camouflage",
          "publishedOn": "2023-07-28T00:00:00.000Z",
          "wordCount": 603,
          "title": "How to Coast with Corporate Camouflage",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/demonstrate-evergreen-proof",
          "author": null,
          "description": "Find something that matters and distill it into as few words as possible.",
          "link": "https://taylor.town/demonstrate-evergreen-proof",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 438,
          "title": "Demonstrate Evergreen Proof",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/do-unforgettable-work",
          "author": null,
          "description": "There are no shortcuts. Hand-written notes and flowers and donuts are cute but completely forgettable. Exceed common convention. Continually reinvent your reputation.",
          "link": "https://taylor.town/do-unforgettable-work",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 282,
          "title": "Do Unforgettable Work",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/dont-fight-customers",
          "author": null,
          "description": "Revenge is wasteful. Reputation is worth more than petty justice.",
          "link": "https://taylor.town/dont-fight-customers",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 584,
          "title": "Don't Fight Customers",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/find-your-value",
          "author": null,
          "description": "When a behavior is valuable, people call it a \"skill\".",
          "link": "https://taylor.town/find-your-value",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 355,
          "title": "Find Your Value",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/pick-your-price",
          "author": null,
          "description": "Most people live fewer than 25,000 days. What are your hours worth?",
          "link": "https://taylor.town/pick-your-price",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 426,
          "title": "How To Pick Your Price",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/ruck-kids",
          "author": null,
          "description": "Leave the stroller at home. Ruck with children. Climb up stairs! Reclaim your mobility! Take back your hands!",
          "link": "https://taylor.town/ruck-kids",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 405,
          "title": "Rucking with Children",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/select-your-service",
          "author": null,
          "description": "Plant giant flags in uncontested territories. Never squabble over tiny crowded plots.",
          "link": "https://taylor.town/select-your-service",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 397,
          "title": "Select Your Service",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/sell-your-service",
          "author": null,
          "description": "Given a fixed amount, you have one major knob to turn: risk.",
          "link": "https://taylor.town/sell-your-service",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 767,
          "title": "Sell Your Service",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/productize-yourself",
          "author": null,
          "description": "Find your value. Select your service. Pick your price. Sell your service. Do unforgettable work. Don't fight customers. Demonstrate evergreen proof.",
          "link": "https://taylor.town/productize-yourself",
          "publishedOn": "2023-07-24T00:00:00.000Z",
          "wordCount": 127,
          "title": "Productize Yourself",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/fancy-rats",
          "author": null,
          "description": "Would you rather see your name on a novel or a thousand tweets?",
          "link": "https://taylor.town/fancy-rats",
          "publishedOn": "2023-07-20T00:00:00.000Z",
          "wordCount": 341,
          "title": "Things That Outlive Fancy Rats",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/secret-sauce",
          "author": null,
          "description": "Go on an adventure. Find a New Thing™. Bring it back. Share it, and demonstrate why the New Thing™ is worth sharing.",
          "link": "https://taylor.town/secret-sauce",
          "publishedOn": "2023-07-19T00:00:00.000Z",
          "wordCount": 1298,
          "title": "Spoil Your Secret Sauce",
          "imageUrl": null
        },
        {
          "id": "https://chexs.io/",
          "author": null,
          "description": "Putting the \"hex\" in chess.",
          "link": "https://chexs.io/",
          "publishedOn": "2023-07-16T00:00:00.000Z",
          "wordCount": 10,
          "title": "chexs.io",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/town-hall-0012",
          "author": null,
          "description": "Your time is scarce; nobody can protect it but you.",
          "link": "https://taylor.town/town-hall-0012",
          "publishedOn": "2023-07-11T00:00:00.000Z",
          "wordCount": 594,
          "title": "Town Hall #12: WONTFIX",
          "imageUrl": null
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}