{
  "sources": [
    {
      "title": "tonsky.me",
      "feedUrl": "http://tonsky.me/blog/atom.xml",
      "siteUrl": "https://tonsky.me/",
      "articles": [
        {
          "id": "https://tonsky.me/blog/humble-state/",
          "author": null,
          "description": "Search for the best state management solution for Humble UI",
          "link": "https://tonsky.me/blog/humble-state/",
          "publishedOn": "2023-04-29T00:00:00.000Z",
          "wordCount": 4179,
          "title": "Humble Chronicles: State Management",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "GolangCode",
      "feedUrl": "https://golangcode.com/index.xml",
      "siteUrl": "https://golangcode.com/",
      "articles": []
    },
    {
      "title": "Applied Go",
      "feedUrl": "https://appliedgo.net/index.xml",
      "siteUrl": "https://appliedgo.net/",
      "articles": []
    },
    {
      "title": "Dave Cheney",
      "feedUrl": "https://dave.cheney.net/feed/atom",
      "siteUrl": "https://dave.cheney.net",
      "articles": []
    },
    {
      "title": "David Heinemeier Hansson",
      "feedUrl": "https://world.hey.com/dhh/feed.atom",
      "siteUrl": "https://world.hey.com/dhh",
      "articles": [
        {
          "id": "https://world.hey.com/dhh/programming-types-and-mindsets-5b8490bc",
          "author": null,
          "description": "One of the longest running schisms in programming is that of static vs dynamic typing. I've heard a million arguments from both sides throughout my entire career, but seen very few of them ever convinced anyone of anything. As rationalizations masquerading as reason rarely do in matters of faith. The rider will always justify the way of the elephant.\nThat's not to say there aren't people who've switched camps. In fact, such individuals usually shout the loudest rationalizations of all. Often with the charm of a livelong omnivore suddenly turning vegan or a traditional banker who caught a lucky ride on crypto. The shorter the faith, the brighter the flame.\nPersonally, I'm unashamedly a dynamic typing kind of guy. That's why I love Ruby so very much. It takes full advantage of dynamic typing…",
          "link": "https://world.hey.com/dhh/programming-types-and-mindsets-5b8490bc",
          "publishedOn": "2023-05-07T14:02:30.000Z",
          "wordCount": 644,
          "title": "Programming types and mindsets",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/escaping-creative-downturns-15281997",
          "author": null,
          "description": "If I'm stuck in a creative downturn, there's usually only one remedy: keep going. That is, accept the downturn, but continue to stare at the computer, waiting for it to pass. While staring at the computer, there's room for menial and managerial tasks put aside during more inspired times. Checking up on things, getting back to people, and reading copious amount of internet. But it's still a creative deadzone.\nThen the curse is usually broken when I'm sufficiently bored with the menial, the managerial, and the internet. That's the moment the creativity returns. When all the distractions have been drained of their doldrum. When there is literally nothing better to do than open the editor and code. \nI usually hit these downturns after a dopamine high, like one propelled by a particularly intense creative period. From working fervently on an idea, seeing it bloom, and then feeling the release of summer. As if fall must follow the flowers. As if the creative juices really are juices, and you can chug the jug. \nBut it can also happen after being out of the routine for too long. Maybe a particularly bad streak of weeks filled with meetings or travel. Like the mind has to settle back into a comfortable groove before sprouting again.\nI used to be more impatient with this oscillating process. Overly eager to get back riding high again. But as I've grown older, I've come to terms with the fact that it can't be eternal sunshine in the productive mind. You need to let weather pass. The grey, wet days of today soak the soil for the sun of tomorrow.\nComplaining about the rain won't do you any good, anyway. Don't argue with nature. Just wait. It'll be bright before you know it.",
          "link": "https://world.hey.com/dhh/escaping-creative-downturns-15281997",
          "publishedOn": "2023-05-06T15:10:09.000Z",
          "wordCount": 371,
          "title": "Escaping creative downturns",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/how-to-recover-from-microservices-ce3803cc",
          "author": null,
          "description": "I won't deny there may well be cases where a microservices-first architecture makes sense, but I think they're few and far in between. The vast majority of systems are much better served by starting and staying with a majestic monolith. The Prime Video case study that blew up the internet yesterday is but the latest illustration.\nMaybe once you reach the scale of Netflix or Amazon, there are areas where it starts to make sense, but remember that even the likes of GitHub and Shopify run their main applications as monoliths with millions of lines of code and have thousands of programmers collaborating on them. Do you have many more millions of lines of code or thousands of programmers working on the same code bases? If not, exercise extreme caution before even thinking about microservices.\nB…",
          "link": "https://world.hey.com/dhh/how-to-recover-from-microservices-ce3803cc",
          "publishedOn": "2023-05-05T08:33:52.000Z",
          "wordCount": 1227,
          "title": "How to recover from microservices",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/even-amazon-can-t-make-sense-of-serverless-or-microservices-59625580",
          "author": null,
          "description": "The Prime Video team at Amazon has published a rather remarkable case study on their decision to dump their serverless, microservices architecture and replace it with a monolith instead. This move saved them a staggering 90%(!!) on operating costs, and simplified the system too. What a win!\nBut beyond celebrating their good sense, I think there's a bigger point here that applies to our entire industry. Here's the telling bit:\n\n\"We designed our initial solution as a distributed system using serverless components... In theory, this would allow us to scale each service component independently. However, the way we used some components caused us to hit a hard scaling limit at around 5% of the expected load.\"\n\nThat really sums up so much of the microservices craze that was tearing through the te…",
          "link": "https://world.hey.com/dhh/even-amazon-can-t-make-sense-of-serverless-or-microservices-59625580",
          "publishedOn": "2023-05-04T09:23:57.000Z",
          "wordCount": 635,
          "title": "Even Amazon can't make sense of serverless or microservices",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/sovereign-clouds-661eb5e4",
          "author": null,
          "description": "I've been talking about our departure from renting computers via AWS to owning them in a colocated datacenter as our \"cloud exit\". But I recognize this terminology can rub some people the wrong way. There's an entire generation of technologists who see themselves as \"cloud native\", and alienating them just because we want to own our hardware rather than rent it doesn't help anyone. Most of the skills of these cloud natives are useful regardless of where the applications run.\nThat skill overlap is actually part of why our transition out of AWS has gone so incredibly fast. 80-90% of what you need to know to run your own hardware these days is the same as what you need to know to operate in the rental clouds. From containers to load balancers to monitoring to performance analysis, and a milli…",
          "link": "https://world.hey.com/dhh/sovereign-clouds-661eb5e4",
          "publishedOn": "2023-05-03T08:01:29.000Z",
          "wordCount": 547,
          "title": "Sovereign clouds",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/cloud-exit-pays-off-in-performance-too-4c53b697",
          "author": null,
          "description": "Last week, we successfully pulled off our biggest cloud exit yet for Basecamp Classic. This is the original app that started it all for us from way back in 2004. And now, after a couple of years running on AWS, it's back on our own hardware, using MRSK, and holy smokes is it fast! Just look at these charts:\n  \n      \n        \n\n  \nThe median request now runs in just 19ms, compared to 67ms before. The mean request in 95ms vs 138ms. The median query time has dropped in half (which adds up when you do a lot of queries per request!). Basecamp Classic was no slouch in the cloud before, but now 95% of all requests are below that magic 300ms cut-off.\n(But take these comparisons with a pound of salt. It's not exactly a clean-room, scientific test. Just a peak at the reality of leaving a fine-tuned …",
          "link": "https://world.hey.com/dhh/cloud-exit-pays-off-in-performance-too-4c53b697",
          "publishedOn": "2023-05-02T13:50:22.000Z",
          "wordCount": 558,
          "title": "Cloud exit pays off in performance too",
          "imageUrl": "https://world.hey.com/dhh/4c53b697/representations/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHNLd2N4aU9CSCIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--2ea18fe4df25864aeb312b318edb0514eefea4ef/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDRG9UY21WemFYcGxYM1J2WDJacGJHeGJCMmtDc0FScEFuWUNPZ3h4ZFdGc2FYUjVhUzA2Q25OMGNtbHdWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--5f3b12054ee1575e23e552561c36229a846c13ea/cloud-exit-performance.png"
        },
        {
          "id": "https://world.hey.com/dhh/the-responsibility-is-the-reward-69e5b73f",
          "author": null,
          "description": "One of the straightest paths to purpose in life is to take responsibility for something (or someone). Becoming a person whose presence and competence benefits others. For both your sake and theirs.\nJordan Peterson calls this the \"meaningful burden\" in 12 Rules for Life, and downright posits it as an antidote to depression. Echoing Victor Frankl's famous quote \"he who has a why to live for can bear almost any how\" from Man's Search for Meaning.\nThere's something inherently counterintuitive about this notion that people who feel overwhelmed by life, or lost in its endless possibilities, might not need a lighter load, but a more meaningful burden instead. It reminds me of the version of burnout that stems not from overwork, but from under-purpose. Sometimes, the answer to \"it's just all too m…",
          "link": "https://world.hey.com/dhh/the-responsibility-is-the-reward-69e5b73f",
          "publishedOn": "2023-05-02T10:23:55.000Z",
          "wordCount": 498,
          "title": "The responsibility is the reward",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/getting-america-s-mojo-back-7889dec1",
          "author": null,
          "description": "There is no end to accounts of America's current ailments. From deaths of despair, soaring crime in some cities, ballooning debts, dysfunctional politics, and a raging culture war. It's easy to be down on those United States. Too easy, in fact.\nTake gun deaths, for example. Americans own more guns per capita than any other country in the world, and by a huge margin too. Those guns are used by people to kill others and themselves. But while the homicide rate is up recently, it's still below where it was in the 90s or even the 70s. Suicides by gun haven't really swung that much either.\n  \n      \n        \n\n  \nIs this a great place to be? No. Is it some historical new peak? No. Have past peaks come down? Yes. America is a violent country. It's been a violent country for a long time. This is no…",
          "link": "https://world.hey.com/dhh/getting-america-s-mojo-back-7889dec1",
          "publishedOn": "2023-04-26T09:35:35.000Z",
          "wordCount": 965,
          "title": "Getting America's mojo back",
          "imageUrl": "https://world.hey.com/dhh/7889dec1/representations/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHNLd2NUUW5SSCIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--72de7fe13a2a5ed92701082c53cffdad3443d4ad/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDRG9UY21WemFYcGxYM1J2WDJacGJHeGJCMmtDc0FScEFuWUNPZ3h4ZFdGc2FYUjVhUzA2Q25OMGNtbHdWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--5f3b12054ee1575e23e552561c36229a846c13ea/gun-deaths-usa-per-capita.png"
        },
        {
          "id": "https://world.hey.com/dhh/how-to-continue-making-kerosene-lamps-on-the-eve-of-electricity-5a8b8e1a",
          "author": null,
          "description": "The recent and rapid advance of AI has rightfully giving many in software real doubts about the future of their profession. I'd probably still wager that the fears are overstated – that we also got prematurely euphoric about the imminent prospects of self-driving cars – and that AI generating code is different from it evolving existing systems. But I wouldn't want to bet the house on it. This might just be The Big One.\nThat uncertainty, whether we truly are on the cusp of a total transformation, is a surprising novelty to me, despite thirty years in software. We've been through so many breathless predictions about how this or that advancement in software would simply \"Change. Everything. Forever.\" that a certain pessimism would be perfectly reasonable.\nI've seen, for example, at least thre…",
          "link": "https://world.hey.com/dhh/how-to-continue-making-kerosene-lamps-on-the-eve-of-electricity-5a8b8e1a",
          "publishedOn": "2023-04-18T12:43:10.000Z",
          "wordCount": 567,
          "title": "How to continue making kerosene lamps on the eve of electricity",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/we-spent-300k-on-billboards-in-boston-and-it-was-a-bust-2ae8c9dd",
          "author": null,
          "description": "Our 2023 marketing campaign for Basecamp kicked off on a ton of different channels at once. Web ads, search ads, podcast ads, and TV ads all blasted the message of JUST LET ME DO MY JOB. Our flagship commercial was a hit with the audience and the critics. But our attempt at out-of-home advertising, with billboards all over Boston, was a bust at a $300,000 cost.\n\n\n    \n      \n        \n\n    \n      \n        \n\n    \n      \n        \n\n  \n\nThat's advertisement! It's hard to know what's going to work unless you give it a go. And since we're fighting competitors with one hand behind our back by refusing to use privacy-invasive ads targeted on personal data, we thought it was worth trying some more conventional channels, like billboards. But at least for software like Basecamp, it's clear that isn't likely to work.\nIt's not that it did nothing. We did have 98 billboards all over Boston for about a month. But the effect was only barely measurable:\n  \n      \n        \n\n  \nAs you can see, we were at the top end of the predicted normal range, or even slightly above. But even with that, we ended up spending thousands of dollars on every attributable trial signup. Way outside the realm of anything we could claim a return on, even if you factored in a fair bit of long-run brand awareness.\nI will say that it felt pretty cool to see the irreverent Basecamp marketing messages appear on building-hugging billboards. There was an emotionally gratifying return on the investment. And perhaps that explains why it used to be common to see business software advertised in places like San Francisco where a lot of executives of such companies could feel good about seeing them. There's something gratifying about being in the real world like this.\nBut yeah, it didn't work. We won't be doing that again. But we'll always have the pictures 😄",
          "link": "https://world.hey.com/dhh/we-spent-300k-on-billboards-in-boston-and-it-was-a-bust-2ae8c9dd",
          "publishedOn": "2023-04-10T14:24:32.000Z",
          "wordCount": 398,
          "title": "We spent $300K on billboards in Boston and it was a bust",
          "imageUrl": "https://world.hey.com/dhh/2ae8c9dd/representations/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHNLd2MrVW1GRyIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--e42125ccd1aec27496165a67dfe0e9f4397959f1/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDRG9UY21WemFYcGxYM1J2WDJacGJHeGJCMmtDc0FScEFuWUNPZ3h4ZFdGc2FYUjVhUzA2Q25OMGNtbHdWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--5f3b12054ee1575e23e552561c36229a846c13ea/boston-ad-3.jpg"
        }
      ]
    },
    {
      "title": "Jason Fried",
      "feedUrl": "https://world.hey.com/jason/feed.atom",
      "siteUrl": "https://world.hey.com/jason",
      "articles": [
        {
          "id": "https://world.hey.com/jason/heard-something-read-something-saw-something-14-d7628c64",
          "author": null,
          "description": "Hey!\nIt’s been many months since my last installment of the Heard Something, Read Something, Saw Something series. Let’s get back into it.\nSo, what do we have this time...\nHeard Something\nA buddy randomly sent me this Turkish Electro Funk Güzel Mix on YouTube. This wasn’t on my radar at all, which is all the more reason I was glad he sent it.\nHear it: https://youtu.be/DQWokgdyeYw\nRead Something\n19 sharks were all found in the same condition: missing their livers, which had been sucked out through a clean tear in their shoulders. The rest of their organs remained intact. Who’s performing such surgery at sea, and possibly teaching others how to do it as well?\nRead it: https://www.nationalgeographic.co.uk/animals/2023/03/why-are-these-orcas-killing-sharks-and-removing-their-livers\nSaw Something\nI can look at Slime Molds all day. Their forms, textures, and wide, whimsical variety are sublimely captivating. Here’s a good collection to get you started:\nSee it: https://www.barrywebbimages.co.uk/Images/Macro/Slime-Moulds-Myxomycetes/\nUntil next time.\nBTW, if you like these, and think someone else might too, please forward it on. They can subscribe to my newsletter right at the top at https://world.hey.com/jason. Thank you.\n\n\n-Jason",
          "link": "https://world.hey.com/jason/heard-something-read-something-saw-something-14-d7628c64",
          "publishedOn": "2023-05-05T21:23:36.000Z",
          "wordCount": 250,
          "title": "Heard Something, Read Something, Saw Something [#14]",
          "imageUrl": "https://world.hey.com/jason/avatar-20230413145313000000-2745081"
        },
        {
          "id": "https://world.hey.com/jason/evaluating-a-redesign-80309257",
          "author": null,
          "description": "We're fortunate we get to make things. But sometimes something sticks around long enough that we have the good fortune to have a chance to remake it.\nWhen evaluating a redesign, your first instinct is to compare the new design to the old design. But don’t do that.\nThe first step is to understand what you’re evaluating. If you just put the new design up against the old design, and compare the two, the old design will strongly influence your evaluation of the new design.\n\nThis is OK if nothing’s changed since the original design was launched. But it’s likely a lot has changed since then – especially if many months or years have passed.\n\nMaybe there are new insights, maybe there’s new data, maybe there’s a new goal, maybe there’s a new hunch, or maybe there’s a whole new strategy at play. Maybe “make it readable” was important 3 years ago, while “help people see things they couldn’t see before” is more important today. Or maybe it’s both now.\n\nBut if the old design sets the tone about what’s important, then you may be losing out on an opportunity to make a significant leap forward. A design should never set the tone – ideas should set the tone. Ideas are independent of the design.\n\nSo, when evaluating a redesign you have to know what you’re looking for, not just what you’re looking at. How the new design compares to the old may be the least important thing to consider.\n\nIt’s a subtle thing, but it can make all the difference.\n\n\n-Jason",
          "link": "https://world.hey.com/jason/evaluating-a-redesign-80309257",
          "publishedOn": "2023-05-02T17:26:50.000Z",
          "wordCount": 327,
          "title": "Evaluating a redesign",
          "imageUrl": "https://world.hey.com/jason/avatar-20230413145313000000-2745081"
        },
        {
          "id": "https://world.hey.com/jason/founder-ceo-is-kinda-a-bs-title-9fe101e9",
          "author": null,
          "description": "Founder & CEO is a common title, especially in tech.\nIt happens to be my title too.\nI've come to believe it's an impossible title. You're either CEO, or you're Founder. You can't hold both full-time jobs.\nAnd unless your company is probably 100+, CEO isn't really a job anyway. It's more of a role someone needs to play occasionally.\nThere simply aren't that many big picture things or decisions to \"execute\" day in and day out — or even week in and week out — to make it a true full time job. A role yes, a hat to wear yes, a full-time job at a smallish company? No. It's part-time at best, quarter-time even better.\nFurther, the fundamental responsibilities of Founders and CEOs are at odds. Having them mashed up in the same title is as ridiculous as having someone who's a \"CTO & Chief Luddite\".\n…",
          "link": "https://world.hey.com/jason/founder-ceo-is-kinda-a-bs-title-9fe101e9",
          "publishedOn": "2023-04-26T20:24:39.000Z",
          "wordCount": 568,
          "title": "Founder & CEO is kinda a BS title",
          "imageUrl": "https://world.hey.com/jason/avatar-20230413145313000000-2745081"
        },
        {
          "id": "https://world.hey.com/jason/innovation-is-overrated-4994874c",
          "author": null,
          "description": "Yesterday I was speaking to a university class and, as it usually does, a question about innovation came up.\n\n\n\"How do you stay innovative? How do you encourage innovative thinking at work?\"\n\n\nMy answer: You don't stay innovative and you don't encourage innovative thinking at work.\n\n\nWHAT? Yes.\n\n\nInnovation should almost never happen. It's incredibly rare. It mostly happens by accident, not by intention. It's wonderful when it does, but you merely fluctuate in and out of it, it's not steady state.\n\n\nWork is mostly mundane. It's mostly maintenance. It's mostly local improvement and iteration. Work is mostly... Work. Any innovation is an outlier, nearly a rounding error.\n\n\nEven the most innovative projects or products are full of rote, prosaic stuff that still needs building. The poetic magic may be in the 5%, but the bulk of the work is in the other 95.\n\n\nSo I told the students they'd better get used to that. Work is not often very exciting, but it can absolutely be fulfilling. And you can be excited about that. But if you're expecting breakthroughs all the time, riff sessions that constantly lead somewhere new, or brainstorms that shoot lightning, you're going to be disappointed.\n\n\nYes innovation happens. Occasionally. Being happy at work is about finding challenge, reward, growth, and creative and intellectual stimulation in everything else.\n\n\nNow... back to this new product we're building.\n\n\n-Jason",
          "link": "https://world.hey.com/jason/innovation-is-overrated-4994874c",
          "publishedOn": "2023-04-14T19:02:44.000Z",
          "wordCount": 293,
          "title": "Innovation is overrated",
          "imageUrl": "https://world.hey.com/jason/avatar-20230413145313000000-2745081"
        },
        {
          "id": "https://world.hey.com/jason/rescuing-a-project-in-progress-d31883f7",
          "author": null,
          "description": "A friend of mine called. He was overwhelmed by a home renovation project that ballooned in size.\nWhat started as a simple kitchen countertop replacement turned into more work in the kitchen, new lighting throughout the house, a master bathroom gut rehab, and new flooring in every room.\nIt became too much. He felt like he was sinking and he couldn't find a grip to grab to prevent the downward spiral.\nThis was his first time managing so many things at once, along with living with the mess that's inherent to demolition. Calm was hard to find, and clarity had left the building.\nWith genuine concern distorting his voice, he said \"I'm in a bad spot. What do I do?\"\nSo I asked him to give me a rundown on what was finished, and what was in progress. Essentially, step one is simply taking inventory.…",
          "link": "https://world.hey.com/jason/rescuing-a-project-in-progress-d31883f7",
          "publishedOn": "2023-04-11T17:34:35.000Z",
          "wordCount": 656,
          "title": "Rescuing a project in progress",
          "imageUrl": "https://world.hey.com/jason/avatar-20230411224311000000-2745081"
        }
      ]
    },
    {
      "title": "The Plain Text Project",
      "feedUrl": "https://plaintextproject.online/feed.xml",
      "siteUrl": "https://plaintextproject.online",
      "articles": []
    },
    {
      "title": "Andrew Kelley",
      "feedUrl": "https://andrewkelley.me/rss.xml",
      "siteUrl": "http://andrewkelley.me/",
      "articles": []
    },
    {
      "title": "Martin Fowler",
      "feedUrl": "https://martinfowler.com/feed.atom",
      "siteUrl": "https://martinfowler.com/feed.atom",
      "articles": [
        {
          "id": "https://martinfowler.com/articles/2023-chatgpt-tech-writing.html",
          "author": null,
          "description": "My colleague Mike Mason is an experienced software\n     developer and architect. He's also an skillful writer, with a couple of\n     books under his belt together with plenty of writing for Thoughtworks,\n     including a regular macro-trends article and contributing to the\n     Thoughtworks Technology Radar. In the last couple of months he's been\n     experimenting with Large Language Models (LLMs) both for programming and\n     prose writing. Here he focuses on the latter, sharing how he's been able to\n     make effective use of ChatGPT.\nmore…",
          "link": "https://martinfowler.com/articles/2023-chatgpt-tech-writing.html",
          "publishedOn": "2023-04-26T14:49:00.000Z",
          "wordCount": 3961,
          "title": "Using ChatGPT as a technical writing assistant",
          "imageUrl": "https://martinfowler.com/articles/2023-chatgpt-tech-writing/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/2023-tech-author-portrait.html",
          "author": null,
          "description": "While working with my colleague Mike Mason on a forthcoming article, we\n     asked Stable Diffusion to come up with portraits of technical authors. We\n     thought the results were worth sharing.\nmore…",
          "link": "https://martinfowler.com/articles/2023-tech-author-portrait.html",
          "publishedOn": "2023-04-24T17:30:00.000Z",
          "wordCount": 538,
          "title": "What Does a Technical Author Look Like?",
          "imageUrl": "https://martinfowler.com/articles/2023-tech-author-portrait/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/2023-chatgpt-xu-hao.html",
          "author": null,
          "description": "A couple of weeks ago I watched a fascinating Zoom call hosted by Xu\n     Hao, Thoughtworks's Head of Technology in China. He showed an\n     example of how he uses ChatGPT to help him code in a self-testing\n     style. His initial prompt primes the LLM with an implementation strategy\n     (chain of thought prompting). His prompt also asks for an implementation\n     plan rather than code (general knowledge prompting). Once he has the plan\n     he uses it to refine the implementation and generate useful sections of\n     code.\nmore…",
          "link": "https://martinfowler.com/articles/2023-chatgpt-xu-hao.html",
          "publishedOn": "2023-04-13T13:30:00.000Z",
          "wordCount": 2863,
          "title": "An example of LLM prompting for programming",
          "imageUrl": "https://martinfowler.com/articles/2023-chatgpt-xu-hao/xu-chat-final.png"
        }
      ]
    },
    {
      "title": "Adam Wathan's Work Journal",
      "feedUrl": "https://adamwathan.me/journal/rss.xml",
      "siteUrl": "https://adamwathan.me/journal",
      "articles": []
    },
    {
      "title": "Rust Blog",
      "feedUrl": "https://blog.rust-lang.org/feed.xml",
      "siteUrl": "https://blog.rust-lang.org/",
      "articles": [
        {
          "id": "https://blog.rust-lang.org/2023/04/25/Rustup-1.26.0.html",
          "author": null,
          "description": "The rustup working group is happy to announce the release of rustup version 1.26.0. Rustup is the recommended tool to install Rust, a programming language that is empowering everyone to build reliable and efficient software.\nIf you have a previous version of rustup installed, getting rustup 1.26.0 is as easy as stopping any programs which may be using Rustup (e.g. closing your IDE) and running:\nrustup self update\n\nRustup will also automatically update itself at the end of a normal toolchain update:\nrustup update\n\nIf you don't have it already, you can get rustup from the appropriate page on our website.\nWhat's new in rustup 1.26.0\nThis version of Rustup involves a significant number of internal cleanups, both in terms\nof the Rustup code and its tests. In addition to a lot of work on the cod…",
          "link": "https://blog.rust-lang.org/2023/04/25/Rustup-1.26.0.html",
          "publishedOn": "2023-04-25T00:00:00.000Z",
          "wordCount": 501,
          "title": "Announcing Rustup 1.26.0",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/2023/04/20/Rust-1.69.0.html",
          "author": null,
          "description": "The Rust team is happy to announce a nice version of Rust, 1.69.0. Rust is a programming language empowering everyone to build reliable and efficient software.\nIf you have a previous version of Rust installed via rustup, you can get 1.69.0 with:\nrustup update stable\n\nIf you don't have it already, you can get rustup from the appropriate page on our website, and check out the detailed release notes for 1.69.0 on GitHub.\nIf you'd like to help us out by testing future releases, you might consider updating locally to use the beta channel (rustup default beta) or the nightly channel (rustup default nightly). Please report any bugs you might come across!\nWhat's in 1.69.0 stable\nRust 1.69.0 introduces no major new features. However, it contains many small improvements, including over 3,000 commits…",
          "link": "https://blog.rust-lang.org/2023/04/20/Rust-1.69.0.html",
          "publishedOn": "2023-04-20T00:00:00.000Z",
          "wordCount": 502,
          "title": "Announcing Rust 1.69.0",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        }
      ]
    },
    {
      "title": "Inside Rust Blog",
      "feedUrl": "https://blog.rust-lang.org/inside-rust/feed.xml",
      "siteUrl": "https://blog.rust-lang.org/inside-rust/",
      "articles": [
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/05/03/stabilizing-async-fn-in-trait.html",
          "author": null,
          "description": "The async working group's headline goal for 2023 is to stabilize a \"minimum viable product\" (MVP) version of async functions in traits. We are currently targeting Rust 1.74 for stabilization. This post lays out the features we plan to ship and the status of each one.\nIn November, we blogged about nightly support for async fn in trait and identified some key next steps, most importantly support for send bounds to allow spawning in generic functions. Since then we've done a significant amount of design exploration and collected a set of case studies evaluating how well the current code works in practice.\nAs of now, all of the functionality described in this blog post is available on the nightly compiler. Some of this work was implemented using experimental feature gates so that we could cond…",
          "link": "https://blog.rust-lang.org/inside-rust/2023/05/03/stabilizing-async-fn-in-trait.html",
          "publishedOn": "2023-05-03T00:00:00.000Z",
          "wordCount": 1700,
          "title": "Stabilizing async fn in traits in 2023",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/05/01/cargo-postmortem.html",
          "author": null,
          "description": "At 01:52 UTC, 2022-10-28, rust-lang/cargo#11183 was merged into the Cargo master branch. It introduced a bug that caused Cargo to fail to build packages that use a particular, but very common, dependency setup. The change nearly made its way into the next nightly release. If it had, it would have rendered any of the 30k crates with serde_derive as a dependency (one of the most popular crate on crates.io) unbuildable for anyone using the resulting nightly release.\nFollowing this incident, the Cargo team went through a postmortem analysis, as is appropriate for incidents with (a potential for) broad blast-radius or otherwise significant impact. This time around, we followed a particular structured postmortem template in the hopes that it might make the resulting write-up more thorough, insig…",
          "link": "https://blog.rust-lang.org/inside-rust/2023/05/01/cargo-postmortem.html",
          "publishedOn": "2023-05-01T00:00:00.000Z",
          "wordCount": 620,
          "title": "Postmortem Analysis in Cargo",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/04/17/1.69.0-prerelease.html",
          "author": null,
          "description": "The 1.69.0 pre-release is ready for testing. The release is scheduled for\nApril 20. Release notes can be found here.\nYou can try it out locally by running:\nRUSTUP_DIST_SERVER=https://dev-static.rust-lang.org rustup update stable\n\nThe index is https://dev-static.rust-lang.org/dist/2023-04-17/index.html.\nYou can leave feedback on the internals thread.\nThe release team is also thinking about changes to our pre-release process:\nwe'd love your feedback on this GitHub issue.",
          "link": "https://blog.rust-lang.org/inside-rust/2023/04/17/1.69.0-prerelease.html",
          "publishedOn": "2023-04-17T00:00:00.000Z",
          "wordCount": 139,
          "title": "1.69.0 pre-release testing",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/04/12/trademark-policy-draft-feedback.html",
          "author": null,
          "description": "A note on the Trademark Policy Draft\nFor the past eight months, the Rust Foundation Project Directors have been working with the informal Trademark Working Group and the Foundation staff to draft an updated policy and FAQ for the Rust trademark. We'd like to provide some context around this work and address the community response to the feedback form for the recently circulated draft.\nBackground\nBack when the Rust Foundation was created, one of the first things to happen was Mozilla transferring its ownership of the Rust trademark to the newly created foundation. An update to the existing policy was needed, and project leadership planned for this to be done together with the Foundation.\nSince we wanted to incorporate community input to this policy and make it accessible as possible, the bo…",
          "link": "https://blog.rust-lang.org/inside-rust/2023/04/12/trademark-policy-draft-feedback.html",
          "publishedOn": "2023-04-12T00:00:00.000Z",
          "wordCount": 1072,
          "title": "A note on the Trademark Policy Draft",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        }
      ]
    },
    {
      "title": "Jorge Manrubia",
      "feedUrl": "https://world.hey.com/jorge/feed.atom",
      "siteUrl": "https://world.hey.com/jorge",
      "articles": [
        {
          "id": "https://world.hey.com/jorge/energy-fd7c84d8",
          "author": null,
          "description": "Internal energy is tricky. \n\n\nOn the one hand, energy is more reliable than happiness. I liked this reflection by Jocko Willink in the Huberman podacast. Everyone experiences joy and sadness as part of their daily lives: keeping a certain energy level is more feasible than a certain level of happiness.\n\n\nOn the other hand, as with anything related to habits, it's way easier to preach than practice. Many years ago, someone I love dearly told me that he tried to do more of what he liked and less of what he didn't. I remember thinking, \"Doh, what a naive approach to life\". Now I think there is deep wisdom there. Your internal energy is the result of a balance. You can have more money by either making more or spending less; you need to pay attention to both.\n\n\nIn my case, I know pretty well wh…",
          "link": "https://world.hey.com/jorge/energy-fd7c84d8",
          "publishedOn": "2023-04-23T18:49:48.000Z",
          "wordCount": 439,
          "title": "Energy",
          "imageUrl": "https://world.hey.com/jorge/fd7c84d8/representations/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHNLd2QydTBaSCIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--41658909d6b1af01da17efa7774cd803ffabfb99/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDRG9UY21WemFYcGxYM1J2WDJacGJHeGJCMmtDc0FScEFuWUNPZ3h4ZFdGc2FYUjVhUzA2Q25OMGNtbHdWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--5f3b12054ee1575e23e552561c36229a846c13ea/roland-larsson-k9e4KXs6AGQ-unsplash.jpg"
        }
      ]
    },
    {
      "title": "Notes on software development",
      "feedUrl": "https://notes.eatonphil.com/rss.xml",
      "siteUrl": "http://notes.eatonphil.com/",
      "articles": []
    },
    {
      "title": "CoRecursive: Coding Stories",
      "feedUrl": "https://corecursive.libsyn.com/feed",
      "siteUrl": "http://corecursive.com",
      "articles": [
        {
          "id": "9a2308c2-d87e-44a2-921f-721115d24fdc",
          "author": null,
          "description": "How do you accomplish something massive over time? I've had the chance to meet with a number of exceptional software developers and it's something I always wonder about. \n Today, I might have an answer with the incredible story of Yann Collet.\n Yann was a project manager who went from being burnt out on corporate life to becoming one of the most sought-after developers in the world. What happens when you build something so impressive and valuable that it essentially becomes invisible?\n And how do you do that when your day job is mainly organizing spreadsheets and keeping timelines on track?\n Yann built LZ4 and ZStandard - two of the world's fastest compression algorithms that have transformed databases, operating systems, file systems, and much more. We'll go back in time to Yann's initial steps with programming, his game-changing discoveries along the way and how his devotion to data compression hobby led him to create something that saves billions of dollars worldwide.\n Episode Links\n  \nEpisode Page\n Bonus 17 - Accomplishing Hard Things\n Support The Show\n Subscribe To The Podcast\n Join The Newsletter",
          "link": "https://corecursive.com/data-compression-yann--collet/",
          "publishedOn": "2023-05-02T10:00:00.000Z",
          "wordCount": null,
          "title": "Story: From Project Management to Data Compression Innovator",
          "itunes": {
            "duration": "59:23"
          },
          "enclosure": {
            "length": "86666432",
            "type": "audio/mpeg",
            "url": "https://chtbl.com/track/7D91G/traffic.libsyn.com/secure/corecursive/088_-_Yann_Collet.mp3?dest-id=628353"
          },
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Notes on software development",
      "feedUrl": "https://notes.eatonphil.com/rss.xml",
      "siteUrl": "http://notes.eatonphil.com/",
      "articles": []
    },
    {
      "title": "Dmitri Pavlutin Blog",
      "feedUrl": "https://dmitripavlutin.com/rss.xml",
      "siteUrl": "https://dmitripavlutin.com",
      "articles": [
        {
          "id": "https://dmitripavlutin.com/typescript-record/",
          "author": "Dmitri Pavlutin",
          "description": "Record type simplifies typing objects in TypeScript. Let's see how you can benefit from it.",
          "link": "https://dmitripavlutin.com/typescript-record/",
          "publishedOn": "2023-04-28T00:00:00.000Z",
          "wordCount": 2182,
          "title": "Record Type in TypeScript",
          "imageUrl": "https://dmitripavlutin.com/typescript-record/cover.png"
        },
        {
          "id": "https://dmitripavlutin.com/react-comments/",
          "author": "Dmitri Pavlutin",
          "description": "{/* Comment */} is the usual way to write comments in React. But there are 2 better ways to comment you just have to know.",
          "link": "https://dmitripavlutin.com/react-comments/",
          "publishedOn": "2023-04-21T00:00:00.000Z",
          "wordCount": 2075,
          "title": "How to Write Comments in React: The Good, the Bad and the Ugly",
          "imageUrl": "https://dmitripavlutin.com/react-comments/cover.png"
        },
        {
          "id": "https://dmitripavlutin.com/javascript-enum/",
          "author": "Dmitri Pavlutin",
          "description": "An enum is a set of named constants. The plain object, frozen object, proxied object or class-based are the 4 ways to create enums in JavaScript.",
          "link": "https://dmitripavlutin.com/javascript-enum/",
          "publishedOn": "2023-04-14T00:00:00.000Z",
          "wordCount": 3325,
          "title": "4 Ways to Create an Enum in JavaScript",
          "imageUrl": "https://dmitripavlutin.com/javascript-enum/cover.png"
        }
      ]
    },
    {
      "title": "Dietcode | Sid's blog",
      "feedUrl": "https://dietcode.io/rss",
      "siteUrl": "https://dietcode.io/",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}