{
  "sources": [
    {
      "title": "tonsky.me",
      "feedUrl": "http://tonsky.me/blog/atom.xml",
      "siteUrl": "https://tonsky.me/",
      "articles": [
        {
          "id": "https://tonsky.me/blog/humble-signals/",
          "author": null,
          "description": "An experiment of using incremental computations for managing state in Humble UI",
          "link": "https://tonsky.me/blog/humble-signals/",
          "publishedOn": "2023-05-18T00:00:00.000Z",
          "wordCount": 3820,
          "title": "Humble Chronicles: Managing State with Signals",
          "imageUrl": null
        },
        {
          "id": "https://tonsky.me/blog/humble-state/",
          "author": null,
          "description": "Search for the best state management solution for Humble UI",
          "link": "https://tonsky.me/blog/humble-state/",
          "publishedOn": "2023-04-29T00:00:00.000Z",
          "wordCount": 4179,
          "title": "Humble Chronicles: State Management",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "GolangCode",
      "feedUrl": "https://golangcode.com/index.xml",
      "siteUrl": "https://golangcode.com/",
      "articles": []
    },
    {
      "title": "Applied Go",
      "feedUrl": "https://appliedgo.net/index.xml",
      "siteUrl": "https://appliedgo.net/",
      "articles": []
    },
    {
      "title": "Dave Cheney",
      "feedUrl": "https://dave.cheney.net/feed/atom",
      "siteUrl": "https://dave.cheney.net",
      "articles": []
    },
    {
      "title": "David Heinemeier Hansson",
      "feedUrl": "https://world.hey.com/dhh/feed.atom",
      "siteUrl": "https://world.hey.com/dhh",
      "articles": [
        {
          "id": "https://world.hey.com/dhh/sitting-on-the-bench-ba937b84",
          "author": null,
          "description": "There are many reasons to pick working for a bigger company in tech. The benefits, the pay, and, at least until recently, the job security. In many ways, it's hard to argue with the cold logic of taking a seat on a star destroyer, if you can land one. But odds are you'll be sitting on the bench if you do.\nThat is, your talents won't get to play center stage in a way that really matters. If you weren't there, there'd probably just be someone else to fill the slot, and it'd rarely make a big difference either way. That's part of the resilience of a big ship, it's built to withstand whatever the weather, so much of the crew is redundant by design.\nThat just isn't so in a small boat. If you're not rowing, everyone will notice. You can't just rest and vest. You gotta play. That's the appeal. You gotta play.\nThat can be intellectually exhausting, but it's also the kind of flexing of your talents that make them grow rapidly. It's the fact that others, and the boat as a whole, count on you being there that rewards you with meaning.\nWould you rather be on the bench in the big leagues or playing every game with an underdog team moving up?",
          "link": "https://world.hey.com/dhh/sitting-on-the-bench-ba937b84",
          "publishedOn": "2023-05-15T08:17:29.000Z",
          "wordCount": 302,
          "title": "Sitting on the bench",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/that-underdog-dna-62795a00",
          "author": null,
          "description": "Jason just penned a beautiful, succinct ode to the underdogs. Go read it.\nIt's funny how finding just the right word unlocks the perfect mental image. We've often thought of ourselves as being in the corner of the small business, but that was never quite right. There are many kinds of small businesses, not all of them thinking of themselves as underdogs. But for the ones who do, those are our people.\nWhat I love most about underdogs is how they can't help having something on the line. As Nassim Taleb would say, they have skin in the game. And it's incredible what kind of difference that makes. The easiest way to solve the agent-principle problem is to skip the agent, at least at the top.\nThat's why \"small\" never really did capture our audience or our allegiance either. 37signals isn't even technically a small business any more. We're just under eighty people. We've got over a hundred thousand customers. We have cloud bills in the millions, and revenue many times that. But we sure as hell are underdogs. Fierce and feisty ones.\nThere's a deep bond in that attitude. The people who connect the most with our writing, our books, our process, our tools, and our offerings usually share that underdog DNA. They might not always be as bold about it as we frequently are, but they're thinking it, and they appreciate when we give those thoughts a strong voice in the public sphere.\nAs Jason writes, being an underdog is an ethos: Drive. Grit. Scrappiness. Independence. Those as the signals, but they're also often dimmed by fear, doubt, and uncertainty. Are we going to make it? Will the big dogs eat our lunch? What's the next move? Helping to allay those sentiments, and encouraging someone to keep on, is what continues to give me the spark to stick with it twenty years in.\nUnderdogs stick together. We're making Basecamp for them.",
          "link": "https://world.hey.com/dhh/that-underdog-dna-62795a00",
          "publishedOn": "2023-05-12T08:25:03.000Z",
          "wordCount": 404,
          "title": "That underdog DNA",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/it-s-not-just-cloud-costs-that-are-out-of-control-efcd098c",
          "author": null,
          "description": "We're letting our yearly commitment to Datadog, a performance and monitoring tool, expire at the end of this month. Not because we don't like the service. It's actually really nice! But because the $88,000/year it was going to cost us to continue is just ridiculous. And it's emblematic of a larger issue: Enterprise SaaS pricing is getting silly.\nBut as silly as I thought our bill was going to be, there's a Datadog customer paying $65 million for their services!! This came up on their most recent earnings call. It's apparently a crypto company who \"optimized\" their bill by committing to this ludicrous spend:\n  \n      \n        \n\n  \nAt the risk of invoking a tired cliche, this kind of outlay for a performance and monitoring service sounds like a 0% interest rate phenomenon. There's just no un…",
          "link": "https://world.hey.com/dhh/it-s-not-just-cloud-costs-that-are-out-of-control-efcd098c",
          "publishedOn": "2023-05-11T08:40:28.000Z",
          "wordCount": 452,
          "title": "It's not just cloud costs that are out of control",
          "imageUrl": "https://world.hey.com/dhh/efcd098c/representations/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHNLd2RxWFgxSSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--034767300620f0766911ecf12bd27747f0328057/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDRG9UY21WemFYcGxYM1J2WDJacGJHeGJCMmtDc0FScEFuWUNPZ3h4ZFdGc2FYUjVhUzA2Q25OMGNtbHdWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--5f3b12054ee1575e23e552561c36229a846c13ea/datadog-costs.jpeg"
        },
        {
          "id": "https://world.hey.com/dhh/the-misallocation-of-tech-talent-6c3b4403",
          "author": null,
          "description": "Getting fired sucks. It doesn't matter how or when. It just sucks. And right now there are an awful lot of people in the tech industry feeling just how much. But what's bad for the individual isn't always bad for the group. Believe it or not, there's also collective upside to the massive tech layoffs happening at the moment.\nLike undoing the absurd hiring spree committed by the largest tech companies during the pandemic. This spree swallowed up a preposterous amount of talent, then put much of it to work on bullshit projects with little to no value for the company or the economy as a whole.\nSuch hoarding of tech talent represented a tragic misallocation of productive capacity. The likes of Amazon, Meta, Google, and many others added tens of thousands of positions to already bloated bureauc…",
          "link": "https://world.hey.com/dhh/the-misallocation-of-tech-talent-6c3b4403",
          "publishedOn": "2023-05-09T09:13:09.000Z",
          "wordCount": 581,
          "title": "The misallocation of tech talent",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/in-defense-of-the-office-450fc177",
          "author": null,
          "description": "You're never getting me back into an office. I credit much of my career to escaping that place in the early 2000s. It wasn't until I found the prolonged solitude of working from home that I could consistently make big leaps in my creative process. The pandemic taught millions the same lesson. And yet – AND YET! – I'm going to come to the defense of the office. \nBecause I find it so nonsensical to hear remote-work advocates proclaim the universal, moral superiority of abolishing the office, as I did listening to those who couldn't envision productive work from home just a few minutes ago. Let's be real here. The modern world we live in was designed and executed from an office. It's a perfectly legitimate way of working.\nIt may not be your preferred way of working. It sure as hell isn't mine…",
          "link": "https://world.hey.com/dhh/in-defense-of-the-office-450fc177",
          "publishedOn": "2023-05-08T07:14:43.000Z",
          "wordCount": 448,
          "title": "In defense of the office",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/programming-types-and-mindsets-5b8490bc",
          "author": null,
          "description": "One of the longest running schisms in programming is that of static vs dynamic typing. I've heard a million arguments from both sides throughout my entire career, but seen very few of them ever convinced anyone of anything. As rationalizations masquerading as reason rarely do in matters of faith. The rider will always justify the way of the elephant.\nThat's not to say there aren't people who've switched camps. In fact, such individuals usually shout the loudest rationalizations of all. Often with the charm of a livelong omnivore suddenly turning vegan or a traditional banker who caught a lucky ride on crypto. The shorter the faith, the brighter the flame.\nPersonally, I'm unashamedly a dynamic typing kind of guy. That's why I love Ruby so very much. It takes full advantage of dynamic typing…",
          "link": "https://world.hey.com/dhh/programming-types-and-mindsets-5b8490bc",
          "publishedOn": "2023-05-07T14:02:30.000Z",
          "wordCount": 644,
          "title": "Programming types and mindsets",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/escaping-creative-downturns-15281997",
          "author": null,
          "description": "If I'm stuck in a creative downturn, there's usually only one remedy: keep going. That is, accept the downturn, but continue to stare at the computer, waiting for it to pass. While staring at the computer, there's room for menial and managerial tasks put aside during more inspired times. Checking up on things, getting back to people, and reading copious amount of internet. But it's still a creative deadzone.\nThen the curse is usually broken when I'm sufficiently bored with the menial, the managerial, and the internet. That's the moment the creativity returns. When all the distractions have been drained of their doldrum. When there is literally nothing better to do than open the editor and code. \nI usually hit these downturns after a dopamine high, like one propelled by a particularly intense creative period. From working fervently on an idea, seeing it bloom, and then feeling the release of summer. As if fall must follow the flowers. As if the creative juices really are juices, and you can chug the jug. \nBut it can also happen after being out of the routine for too long. Maybe a particularly bad streak of weeks filled with meetings or travel. Like the mind has to settle back into a comfortable groove before sprouting again.\nI used to be more impatient with this oscillating process. Overly eager to get back riding high again. But as I've grown older, I've come to terms with the fact that it can't be eternal sunshine in the productive mind. You need to let weather pass. The grey, wet days of today soak the soil for the sun of tomorrow.\nComplaining about the rain won't do you any good, anyway. Don't argue with nature. Just wait. It'll be bright before you know it.",
          "link": "https://world.hey.com/dhh/escaping-creative-downturns-15281997",
          "publishedOn": "2023-05-06T15:10:09.000Z",
          "wordCount": 371,
          "title": "Escaping creative downturns",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/how-to-recover-from-microservices-ce3803cc",
          "author": null,
          "description": "I won't deny there may well be cases where a microservices-first architecture makes sense, but I think they're few and far in between. The vast majority of systems are much better served by starting and staying with a majestic monolith. The Prime Video case study that blew up the internet yesterday is but the latest illustration.\nMaybe once you reach the scale of Netflix or Amazon, there are areas where it starts to make sense, but remember that even the likes of GitHub and Shopify run their main applications as monoliths with millions of lines of code and have thousands of programmers collaborating on them. Do you have many more millions of lines of code or thousands of programmers working on the same code bases? If not, exercise extreme caution before even thinking about microservices.\nB…",
          "link": "https://world.hey.com/dhh/how-to-recover-from-microservices-ce3803cc",
          "publishedOn": "2023-05-05T08:33:52.000Z",
          "wordCount": 1227,
          "title": "How to recover from microservices",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/even-amazon-can-t-make-sense-of-serverless-or-microservices-59625580",
          "author": null,
          "description": "The Prime Video team at Amazon has published a rather remarkable case study on their decision to dump their serverless, microservices architecture and replace it with a monolith instead. This move saved them a staggering 90%(!!) on operating costs, and simplified the system too. What a win!\nBut beyond celebrating their good sense, I think there's a bigger point here that applies to our entire industry. Here's the telling bit:\n\n\"We designed our initial solution as a distributed system using serverless components... In theory, this would allow us to scale each service component independently. However, the way we used some components caused us to hit a hard scaling limit at around 5% of the expected load.\"\n\nThat really sums up so much of the microservices craze that was tearing through the te…",
          "link": "https://world.hey.com/dhh/even-amazon-can-t-make-sense-of-serverless-or-microservices-59625580",
          "publishedOn": "2023-05-04T09:23:57.000Z",
          "wordCount": 635,
          "title": "Even Amazon can't make sense of serverless or microservices",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/sovereign-clouds-661eb5e4",
          "author": null,
          "description": "I've been talking about our departure from renting computers via AWS to owning them in a colocated datacenter as our \"cloud exit\". But I recognize this terminology can rub some people the wrong way. There's an entire generation of technologists who see themselves as \"cloud native\", and alienating them just because we want to own our hardware rather than rent it doesn't help anyone. Most of the skills of these cloud natives are useful regardless of where the applications run.\nThat skill overlap is actually part of why our transition out of AWS has gone so incredibly fast. 80-90% of what you need to know to run your own hardware these days is the same as what you need to know to operate in the rental clouds. From containers to load balancers to monitoring to performance analysis, and a milli…",
          "link": "https://world.hey.com/dhh/sovereign-clouds-661eb5e4",
          "publishedOn": "2023-05-03T08:01:29.000Z",
          "wordCount": 547,
          "title": "Sovereign clouds",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/cloud-exit-pays-off-in-performance-too-4c53b697",
          "author": null,
          "description": "Last week, we successfully pulled off our biggest cloud exit yet for Basecamp Classic. This is the original app that started it all for us from way back in 2004. And now, after a couple of years running on AWS, it's back on our own hardware, using MRSK, and holy smokes is it fast! Just look at these charts:\n  \n      \n        \n\n  \nThe median request now runs in just 19ms, compared to 67ms before. The mean request in 95ms vs 138ms. The median query time has dropped in half (which adds up when you do a lot of queries per request!). Basecamp Classic was no slouch in the cloud before, but now 95% of all requests are below that magic 300ms cut-off.\n(But take these comparisons with a pound of salt. It's not exactly a clean-room, scientific test. Just a peak at the reality of leaving a fine-tuned …",
          "link": "https://world.hey.com/dhh/cloud-exit-pays-off-in-performance-too-4c53b697",
          "publishedOn": "2023-05-02T13:50:22.000Z",
          "wordCount": 558,
          "title": "Cloud exit pays off in performance too",
          "imageUrl": "https://world.hey.com/dhh/4c53b697/representations/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHNLd2N4aU9CSCIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--2ea18fe4df25864aeb312b318edb0514eefea4ef/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDRG9UY21WemFYcGxYM1J2WDJacGJHeGJCMmtDc0FScEFuWUNPZ3h4ZFdGc2FYUjVhUzA2Q25OMGNtbHdWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--5f3b12054ee1575e23e552561c36229a846c13ea/cloud-exit-performance.png"
        },
        {
          "id": "https://world.hey.com/dhh/the-responsibility-is-the-reward-69e5b73f",
          "author": null,
          "description": "One of the straightest paths to purpose in life is to take responsibility for something (or someone). Becoming a person whose presence and competence benefits others. For both your sake and theirs.\nJordan Peterson calls this the \"meaningful burden\" in 12 Rules for Life, and downright posits it as an antidote to depression. Echoing Victor Frankl's famous quote \"he who has a why to live for can bear almost any how\" from Man's Search for Meaning.\nThere's something inherently counterintuitive about this notion that people who feel overwhelmed by life, or lost in its endless possibilities, might not need a lighter load, but a more meaningful burden instead. It reminds me of the version of burnout that stems not from overwork, but from under-purpose. Sometimes, the answer to \"it's just all too m…",
          "link": "https://world.hey.com/dhh/the-responsibility-is-the-reward-69e5b73f",
          "publishedOn": "2023-05-02T10:23:55.000Z",
          "wordCount": 498,
          "title": "The responsibility is the reward",
          "imageUrl": "https://world.hey.com/dhh/avatar-20210222112907000000-293866624"
        },
        {
          "id": "https://world.hey.com/dhh/getting-america-s-mojo-back-7889dec1",
          "author": null,
          "description": "There is no end to accounts of America's current ailments. From deaths of despair, soaring crime in some cities, ballooning debts, dysfunctional politics, and a raging culture war. It's easy to be down on those United States. Too easy, in fact.\nTake gun deaths, for example. Americans own more guns per capita than any other country in the world, and by a huge margin too. Those guns are used by people to kill others and themselves. But while the homicide rate is up recently, it's still below where it was in the 90s or even the 70s. Suicides by gun haven't really swung that much either.\n  \n      \n        \n\n  \nIs this a great place to be? No. Is it some historical new peak? No. Have past peaks come down? Yes. America is a violent country. It's been a violent country for a long time. This is no…",
          "link": "https://world.hey.com/dhh/getting-america-s-mojo-back-7889dec1",
          "publishedOn": "2023-04-26T09:35:35.000Z",
          "wordCount": 965,
          "title": "Getting America's mojo back",
          "imageUrl": "https://world.hey.com/dhh/7889dec1/representations/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHNLd2NUUW5SSCIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--72de7fe13a2a5ed92701082c53cffdad3443d4ad/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDRG9UY21WemFYcGxYM1J2WDJacGJHeGJCMmtDc0FScEFuWUNPZ3h4ZFdGc2FYUjVhUzA2Q25OMGNtbHdWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--5f3b12054ee1575e23e552561c36229a846c13ea/gun-deaths-usa-per-capita.png"
        }
      ]
    },
    {
      "title": "Jason Fried",
      "feedUrl": "https://world.hey.com/jason/feed.atom",
      "siteUrl": "https://world.hey.com/jason",
      "articles": [
        {
          "id": "https://world.hey.com/jason/kill-overkill-4689acac",
          "author": null,
          "description": "Business is often seen as the art of acquisition. Acquiring talent, customers, revenue, profits, mindshare, marketshare. Building and growing requires consumption, addition, parlaying some of this into a lot of that.\nBut the smartest businesses — the ones that tend to stick around for the long haul — know that existence is also about avoidance.\nAvoiding careening variable costs, avoiding getting involved with things that aren't core to your business, avoiding spending time on things that don't matter, avoiding bad investments, avoiding people who don't help you prosper, and even avoiding customers who aren't the right fit.\nHowever, there's something even more fundamental to avoid. It would be easy to call it \"complexity\" but that's not quite it. Complexity can be necessary, and intricacy c…",
          "link": "https://world.hey.com/jason/kill-overkill-4689acac",
          "publishedOn": "2023-05-17T16:27:49.000Z",
          "wordCount": 520,
          "title": "Kill Overkill",
          "imageUrl": "https://world.hey.com/jason/avatar-20230413145313000000-2745081"
        },
        {
          "id": "https://world.hey.com/jason/yet-1b219fa8",
          "author": null,
          "description": "In the past I’ve written about how I used to be a hothead, reacting instantly to whatever I disagreed with. I didn’t even let someone finish their thought before I started forming my rebuttal. The remainder of their statement was just filler before I could slam back.\nI’m far from perfect, and I still occasionally catch myself doing this today, but far less frequently. And when I do it, I spot it and correct for it. I’d say I’m 90% better.\nLately I’ve been using another tool to help create some space before I form an opinion. It’s a simple word called “yet”.\nOver the past years I’ve found a lot of joy in things I’d normally have dismissed. And it’s all because of “yet”.\nInstead of “I don’t like that color”, it’s “I don’t like that color… yet”. Instead of I don’t like that taste, it’s “I don…",
          "link": "https://world.hey.com/jason/yet-1b219fa8",
          "publishedOn": "2023-05-12T16:41:06.000Z",
          "wordCount": 472,
          "title": "Yet",
          "imageUrl": "https://world.hey.com/jason/avatar-20230413145313000000-2745081"
        },
        {
          "id": "https://world.hey.com/jason/we-stand-with-the-underdogs-7d487d64",
          "author": null,
          "description": "What do they got?\nA big team, lots of money, a strong brand, seemingly unlimited resources, panache, reputation, all that. They’re established.\nThey’re your competitors.\nYou want to look away, but you see them everywhere. Their ads on your social, their name in the media, your dream clients on their website.\nBut you know what else they got?\nBigger company bloat. Overflowing obligations. Narratives to uphold. Appearances to maintain. Entitlement. Too much overhead. \nThey’re slow. They’re conservative. They talk too much. They’ve stopped taking risks. They’re resting on their laurels, gliding on their reputation. They’re on defense.\nWhat they’ve really got is a lot to lose.\nWhat do you got?\nHunger. Drive. Grit. Scrappiness. Independence. You’re on offense.\nYou don’t have enough, which is why you’re dangerous. You have no choice but to be clever and creative. To make up for what you don’t have with something they can’t have: The underdog spirit.\nYou can move. You can adjust. You can adapt. You can get it done while they’re still stuck deciding what to do.\nSmall is not a stepping stone. Small is not less than. It’s greater than. It’s faster than. It’s better than.\nSavor your position. You don’t get to be the underdog forever. The baton will be passed. But for now, it’s your magic wand. Use it.\nWe stand with the underdogs.\n\n-Jason",
          "link": "https://world.hey.com/jason/we-stand-with-the-underdogs-7d487d64",
          "publishedOn": "2023-05-11T17:52:59.000Z",
          "wordCount": 289,
          "title": "We stand with the Underdogs",
          "imageUrl": "https://world.hey.com/jason/avatar-20230413145313000000-2745081"
        },
        {
          "id": "https://world.hey.com/jason/you-can-learn-ai-later-08fce896",
          "author": null,
          "description": "Throw a dart on LinkedIn, or toss one into the ether on Twitter, and you'll likely hit a post proclaiming that you better \"learn AI\" or you're falling behind.\nMaster the tools and become a prompt engineer or someone else will tell the AI to summarize the long documents, kick off initial first drafts, and rewrite the headlines for you!\nNonsense.\nThis isn't saying AI, ChatGPT, or whatever comes next is nonsense. It's very real, very powerful, and very here.\nBut there's nothing you need to learn, or do, right now, other than be curious. Play around, kick the tires, poke and prod. Get a feel for what this new sauce tastes like. Have fun, it's not a test.\nBut become a master at once or you're going to lose your job to some AI expert? Nah. That's pure FUD. The stuff that everyone's talking about is barely 6 months old — there are no experts, there are just people playing experts on the internet.\nBesides, the best way to learn something is to need that something. Learning when you don't really need to is a good way to give up early. Learning when there's something you truly need to do, but can't, but could, is the right time to figure something out.\nThey say necessity is the mother of invention, but it's really the impetus for learning. The time will come, and you can figure it out then. If anything, it'll be easier to learn how to use AI once it settles in a bit. Currently it's a moving target.\nSo wait on it. Pop the pressure. Don't feel like you're falling behind. And don't drop everything to dig in. Start curious, stay curious, know what it's capable of, and, when the necessity strikes, figure it out. Until then, ignore the demands and focus on doing what you're already good at.\n\n-Jason",
          "link": "https://world.hey.com/jason/you-can-learn-ai-later-08fce896",
          "publishedOn": "2023-05-10T16:06:06.000Z",
          "wordCount": 381,
          "title": "You can learn AI later",
          "imageUrl": "https://world.hey.com/jason/avatar-20230413145313000000-2745081"
        },
        {
          "id": "https://world.hey.com/jason/on-hiring-rehiring-and-one-question-to-answer-them-all-5db97bcb",
          "author": null,
          "description": "Out of all things I’m asked about, hiring tops the list. From the actual hiring process, to reviews, to motivation and retention strategies, curiosity about hiring is on full charge.\nThere’s a lot to cover, but I’d like to share some thoughts about a moment that doesn’t get enough attention: The end of the first year and the beginning of the second.\nHiring is typically thought of as something you do once per person. Once someone’s hired, training, growing, and retaining are the next things you do. You may keep training someone, you may keep growing someone, you may keep promoting someone, but you surely don’t keep hiring someone.\nIt’s on that point I disagree.\nI’ve found that, actually, you hire someone at least twice. You hire someone initially, and then, if all goes well, you hire them a…",
          "link": "https://world.hey.com/jason/on-hiring-rehiring-and-one-question-to-answer-them-all-5db97bcb",
          "publishedOn": "2023-05-08T15:52:19.000Z",
          "wordCount": 723,
          "title": "On hiring, rehiring, and one question to answer them all",
          "imageUrl": "https://world.hey.com/jason/avatar-20230413145313000000-2745081"
        },
        {
          "id": "https://world.hey.com/jason/heard-something-read-something-saw-something-14-d7628c64",
          "author": null,
          "description": "Hey!\nIt’s been many months since my last installment of the Heard Something, Read Something, Saw Something series. Let’s get back into it.\nSo, what do we have this time...\nHeard Something\nA buddy randomly sent me this Turkish Electro Funk Güzel Mix on YouTube. This wasn’t on my radar at all, which is all the more reason I was glad he sent it.\nHear it: https://youtu.be/DQWokgdyeYw\nRead Something\n19 sharks were all found in the same condition: missing their livers, which had been sucked out through a clean tear in their shoulders. The rest of their organs remained intact. Who’s performing such surgery at sea, and possibly teaching others how to do it as well?\nRead it: https://www.nationalgeographic.co.uk/animals/2023/03/why-are-these-orcas-killing-sharks-and-removing-their-livers\nSaw Something\nI can look at Slime Molds all day. Their forms, textures, and wide, whimsical variety are sublimely captivating. Here’s a good collection to get you started:\nSee it: https://www.barrywebbimages.co.uk/Images/Macro/Slime-Moulds-Myxomycetes/\nUntil next time.\nBTW, if you like these, and think someone else might too, please forward it on. They can subscribe to my newsletter right at the top at https://world.hey.com/jason. Thank you.\n\n\n-Jason",
          "link": "https://world.hey.com/jason/heard-something-read-something-saw-something-14-d7628c64",
          "publishedOn": "2023-05-05T21:23:36.000Z",
          "wordCount": 250,
          "title": "Heard Something, Read Something, Saw Something [#14]",
          "imageUrl": "https://world.hey.com/jason/avatar-20230413145313000000-2745081"
        },
        {
          "id": "https://world.hey.com/jason/evaluating-a-redesign-80309257",
          "author": null,
          "description": "We're fortunate we get to make things. But sometimes something sticks around long enough that we have the good fortune to have a chance to remake it.\nWhen evaluating a redesign, your first instinct is to compare the new design to the old design. But don’t do that.\nThe first step is to understand what you’re evaluating. If you just put the new design up against the old design, and compare the two, the old design will strongly influence your evaluation of the new design.\n\nThis is OK if nothing’s changed since the original design was launched. But it’s likely a lot has changed since then – especially if many months or years have passed.\n\nMaybe there are new insights, maybe there’s new data, maybe there’s a new goal, maybe there’s a new hunch, or maybe there’s a whole new strategy at play. Maybe “make it readable” was important 3 years ago, while “help people see things they couldn’t see before” is more important today. Or maybe it’s both now.\n\nBut if the old design sets the tone about what’s important, then you may be losing out on an opportunity to make a significant leap forward. A design should never set the tone – ideas should set the tone. Ideas are independent of the design.\n\nSo, when evaluating a redesign you have to know what you’re looking for, not just what you’re looking at. How the new design compares to the old may be the least important thing to consider.\n\nIt’s a subtle thing, but it can make all the difference.\n\n\n-Jason",
          "link": "https://world.hey.com/jason/evaluating-a-redesign-80309257",
          "publishedOn": "2023-05-02T17:26:50.000Z",
          "wordCount": 327,
          "title": "Evaluating a redesign",
          "imageUrl": "https://world.hey.com/jason/avatar-20230413145313000000-2745081"
        },
        {
          "id": "https://world.hey.com/jason/founder-ceo-is-kinda-a-bs-title-9fe101e9",
          "author": null,
          "description": "Founder & CEO is a common title, especially in tech.\nIt happens to be my title too.\nI've come to believe it's an impossible title. You're either CEO, or you're Founder. You can't hold both full-time jobs.\nAnd unless your company is probably 100+, CEO isn't really a job anyway. It's more of a role someone needs to play occasionally.\nThere simply aren't that many big picture things or decisions to \"execute\" day in and day out — or even week in and week out — to make it a true full time job. A role yes, a hat to wear yes, a full-time job at a smallish company? No. It's part-time at best, quarter-time even better.\nFurther, the fundamental responsibilities of Founders and CEOs are at odds. Having them mashed up in the same title is as ridiculous as having someone who's a \"CTO & Chief Luddite\".\n…",
          "link": "https://world.hey.com/jason/founder-ceo-is-kinda-a-bs-title-9fe101e9",
          "publishedOn": "2023-04-26T20:24:39.000Z",
          "wordCount": 568,
          "title": "Founder & CEO is kinda a BS title",
          "imageUrl": "https://world.hey.com/jason/avatar-20230413145313000000-2745081"
        }
      ]
    },
    {
      "title": "The Plain Text Project",
      "feedUrl": "https://plaintextproject.online/feed.xml",
      "siteUrl": "https://plaintextproject.online",
      "articles": []
    },
    {
      "title": "Andrew Kelley",
      "feedUrl": "https://andrewkelley.me/rss.xml",
      "siteUrl": "http://andrewkelley.me/",
      "articles": []
    },
    {
      "title": "Martin Fowler",
      "feedUrl": "https://martinfowler.com/feed.atom",
      "siteUrl": "https://martinfowler.com/feed.atom",
      "articles": [
        {
          "id": "https://martinfowler.com/articles/2023-xref-problem.html",
          "author": null,
          "description": "Recently I found that xref in Emacs had stopped working for me on my mac laptop. Today I finally tried to figure out what went wrong. xref is just a front-end, all the work is done by backends. It took a while for me to realize (ie remember) that I was using the excellent dumb-jump package as the backend. dumb-jump uses a range of fast search commands (such as ag and ripgrep) to detect references without using the awkward tags tables that Emacs used to rely on.\nThe command flow between xref and dumb-jump is difficult to follow, but looking at the dumb-jump customization page alerted me to dumb-jump having a debug option. With this enabled, I could see what command dumb-jump was sending to the operating system. By default it uses git grep while in a git repo (almost everything I do is in a git repo). Its git grep command is quite complex, using regexps to (I assume) get more sensible results. I tried out the command it issued in my own terminal and it failed to find anything, while a simple git grep worked fine.\nArmed with a better knowledge of what was failing, I dug into dumb-jump’s issues and found Issue with git-grep. Reading that, I discovered that a change to git grep means that how git grep processes regexes differs depending on the operating system. This would mean that dumb-jump would need to detect git-grep’s version and the underlying OS to pick the right regexes for its search.\nThe fix for me is to force dumb-jump to use another searcher with (setq dumb-jump-force-searcher 'rg). With that my xref commands worked again.",
          "link": "https://martinfowler.com/articles/2023-xref-problem.html",
          "publishedOn": "2023-05-19T16:48:00.000Z",
          "wordCount": 389,
          "title": "Emacs xref stopped working on Macs with dumb-jump",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/2023-chatgpt-tech-writing.html",
          "author": null,
          "description": "My colleague Mike Mason is an experienced software\n     developer and architect. He's also an skillful writer, with a couple of\n     books under his belt together with plenty of writing for Thoughtworks,\n     including a regular macro-trends article and contributing to the\n     Thoughtworks Technology Radar. In the last couple of months he's been\n     experimenting with Large Language Models (LLMs) both for programming and\n     prose writing. Here he focuses on the latter, sharing how he's been able to\n     make effective use of ChatGPT.\nmore…",
          "link": "https://martinfowler.com/articles/2023-chatgpt-tech-writing.html",
          "publishedOn": "2023-04-26T14:49:00.000Z",
          "wordCount": 3961,
          "title": "Using ChatGPT as a technical writing assistant",
          "imageUrl": "https://martinfowler.com/articles/2023-chatgpt-tech-writing/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/2023-tech-author-portrait.html",
          "author": null,
          "description": "While working with my colleague Mike Mason on a forthcoming article, we\n     asked Stable Diffusion to come up with portraits of technical authors. We\n     thought the results were worth sharing.\nmore…",
          "link": "https://martinfowler.com/articles/2023-tech-author-portrait.html",
          "publishedOn": "2023-04-24T17:30:00.000Z",
          "wordCount": 538,
          "title": "What Does a Technical Author Look Like?",
          "imageUrl": "https://martinfowler.com/articles/2023-tech-author-portrait/card.png"
        }
      ]
    },
    {
      "title": "Adam Wathan's Work Journal",
      "feedUrl": "https://adamwathan.me/journal/rss.xml",
      "siteUrl": "https://adamwathan.me/journal",
      "articles": []
    },
    {
      "title": "Rust Blog",
      "feedUrl": "https://blog.rust-lang.org/feed.xml",
      "siteUrl": "https://blog.rust-lang.org/",
      "articles": [
        {
          "id": "https://blog.rust-lang.org/2023/05/09/Updating-musl-targets.html",
          "author": null,
          "description": "Beginning with Rust 1.71 (slated for stable release on 2023-07-13), the various *-linux-musl targets will ship with musl 1.2.3.\nThese targets currently use musl 1.1.24.\nWhile musl 1.2.3 introduces some new features, most notably 64-bit time on all platforms, it is ABI compatible with earlier musl versions.\nAs such, this change is unlikely to affect you.\nUpdated targets\nThe following targets will be updated:\nTarget\nSupport Tier\n\n\n\n\naarch64-unknown-linux-musl\nTier 2 with Host Tools\n\n\nx86_64-unknown-linux-musl\nTier 2 with Host Tools\n\n\narm-unknown-linux-musleabi\nTier 2\n\n\narm-unknown-linux-musleabihf\nTier 2\n\n\narmv5te-unknown-linux-musleabi\nTier 2\n\n\narmv7-unknown-linux-musleabi\nTier 2\n\n\narmv7-unknown-linux-musleabihf\nTier 2\n\n\ni586-unknown-linux-musl\nTier 2\n\n\ni686-unknown-linux-musl\nTier 2\n\n\nmips-unknown-linux-musl\nTier 2\n\n\nmips64-unknown-linux-muslabi64\nTier 2\n\n\nmips64el-unknown-linux-muslabi64\nTier 2\n\n\nmipsel-unknown-linux-musl\nTier 2\n\n\nhexagon-unknown-linux-musl\nTier 3\n\n\nmips64-openwrt-linux-musl\nTier 3\n\n\npowerpc-unknown-linux-musl\nTier 3\n\n\npowerpc64-unknown-linux-musl\nTier 3\n\n\npowerpc64le-unknown-linux-musl\nTier 3\n\n\nriscv32gc-unknown-linux-musl\nTier 3\n\n\nriscv64gc-unknown-linux-musl\nTier 3\n\n\ns390x-unknown-linux-musl\nTier 3\n\n\nthumbv7neon-unknown-linux-musleabihf\nTier 3\n\n\n\nNote: musl 1.2.3 does not raise the minimum required Linux kernel version for any target.\nWill 64-bit time break the libc crate on 32-bit targets?\nNo, the musl project made this change carefully preserving ABI compatibility.\nThe libc crate will continue to function correctly without modification.\nA future version of the libc crate will update the definitions of time-related structures and functions to be 64-bit on all musl targets however this is blocked on the musl targets themselves first being updated.\nAt present, there is no anticipated date when this change will take place and care will be taken to help the Rust ecosystem transition successfully to the updated time-related definitions.",
          "link": "https://blog.rust-lang.org/2023/05/09/Updating-musl-targets.html",
          "publishedOn": "2023-05-09T00:00:00.000Z",
          "wordCount": 327,
          "title": "Updating Rust's Linux musl targets",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/2023/04/25/Rustup-1.26.0.html",
          "author": null,
          "description": "The rustup working group is happy to announce the release of rustup version 1.26.0. Rustup is the recommended tool to install Rust, a programming language that is empowering everyone to build reliable and efficient software.\nIf you have a previous version of rustup installed, getting rustup 1.26.0 is as easy as stopping any programs which may be using Rustup (e.g. closing your IDE) and running:\nrustup self update\n\nRustup will also automatically update itself at the end of a normal toolchain update:\nrustup update\n\nIf you don't have it already, you can get rustup from the appropriate page on our website.\nWhat's new in rustup 1.26.0\nThis version of Rustup involves a significant number of internal cleanups, both in terms\nof the Rustup code and its tests. In addition to a lot of work on the cod…",
          "link": "https://blog.rust-lang.org/2023/04/25/Rustup-1.26.0.html",
          "publishedOn": "2023-04-25T00:00:00.000Z",
          "wordCount": 501,
          "title": "Announcing Rustup 1.26.0",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        }
      ]
    },
    {
      "title": "Inside Rust Blog",
      "feedUrl": "https://blog.rust-lang.org/inside-rust/feed.xml",
      "siteUrl": "https://blog.rust-lang.org/inside-rust/",
      "articles": [
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/05/09/api-token-scopes.html",
          "author": null,
          "description": "Roughly three years ago Pietro Albini opened an RFC called \"crates.io token scopes\". This RFC described an improvement to the existing API tokens, that everyone is using to publish crates to the crates.io package registry. The proposal was to make it possible to restrict API tokens to 1) certain operations and 2) certain crates.\nUnfortunately, the crates.io team members were quite busy at the time, so it took a while for this proposal to get accepted. To be precise, during the EuroRust conference in October 2022 we talked about the RFC again and after a few modifications the RFC was moved into FCP status and then finally merged.\nThe implementation was started soon after, but was paused again due to other priorities at the time. Fortunately, I was lucky enough to get one of the software engineering jobs at the Rust Foundation, so in early April the development continued, and I am happy to report:\nAPI token scopes on crates.io are now in a public beta testing period!\nFor details on what these token scopes are and how they are supposed to work, I recommend reading through the RFC. If you want to try them out, you can go to https://crates.io/settings/tokens/new and create a new API token scoped to the operations and crates you want:\n\nPlease note that this page is currently not reachable from the regular user interface, you have to access it via URL directly while we test it out.\nFinally, if you notice any issues, or if you have any questions don't hesitate to find us on Zulip or open an issue on GitHub.",
          "link": "https://blog.rust-lang.org/inside-rust/2023/05/09/api-token-scopes.html",
          "publishedOn": "2023-05-09T00:00:00.000Z",
          "wordCount": 342,
          "title": "API token scopes",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/05/03/stabilizing-async-fn-in-trait.html",
          "author": null,
          "description": "The async working group's headline goal for 2023 is to stabilize a \"minimum viable product\" (MVP) version of async functions in traits. We are currently targeting Rust 1.74 for stabilization. This post lays out the features we plan to ship and the status of each one.\nIn November, we blogged about nightly support for async fn in trait and identified some key next steps, most importantly support for send bounds to allow spawning in generic functions. Since then we've done a significant amount of design exploration and collected a set of case studies evaluating how well the current code works in practice.\nAs of now, all of the functionality described in this blog post is available on the nightly compiler. Some of this work was implemented using experimental feature gates so that we could cond…",
          "link": "https://blog.rust-lang.org/inside-rust/2023/05/03/stabilizing-async-fn-in-trait.html",
          "publishedOn": "2023-05-03T00:00:00.000Z",
          "wordCount": 1700,
          "title": "Stabilizing async fn in traits in 2023",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/05/01/cargo-postmortem.html",
          "author": null,
          "description": "At 01:52 UTC, 2022-10-28, rust-lang/cargo#11183 was merged into the Cargo master branch. It introduced a bug that caused Cargo to fail to build packages that use a particular, but very common, dependency setup. The change nearly made its way into the next nightly release. If it had, it would have rendered any of the 30k crates with serde_derive as a dependency (one of the most popular crate on crates.io) unbuildable for anyone using the resulting nightly release.\nFollowing this incident, the Cargo team went through a postmortem analysis, as is appropriate for incidents with (a potential for) broad blast-radius or otherwise significant impact. This time around, we followed a particular structured postmortem template in the hopes that it might make the resulting write-up more thorough, insig…",
          "link": "https://blog.rust-lang.org/inside-rust/2023/05/01/cargo-postmortem.html",
          "publishedOn": "2023-05-01T00:00:00.000Z",
          "wordCount": 620,
          "title": "Postmortem Analysis in Cargo",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        }
      ]
    },
    {
      "title": "Jorge Manrubia",
      "feedUrl": "https://world.hey.com/jorge/feed.atom",
      "siteUrl": "https://world.hey.com/jorge",
      "articles": [
        {
          "id": "https://world.hey.com/jorge/energy-fd7c84d8",
          "author": null,
          "description": "Internal energy is tricky. \n\n\nOn the one hand, energy is more reliable than happiness. I liked this reflection by Jocko Willink in the Huberman podacast. Everyone experiences joy and sadness as part of their daily lives: keeping a certain energy level is more feasible than a certain level of happiness.\n\n\nOn the other hand, as with anything related to habits, it's way easier to preach than practice. Many years ago, someone I love dearly told me that he tried to do more of what he liked and less of what he didn't. I remember thinking, \"Doh, what a naive approach to life\". Now I think there is deep wisdom there. Your internal energy is the result of a balance. You can have more money by either making more or spending less; you need to pay attention to both.\n\n\nIn my case, I know pretty well wh…",
          "link": "https://world.hey.com/jorge/energy-fd7c84d8",
          "publishedOn": "2023-04-23T18:49:48.000Z",
          "wordCount": 439,
          "title": "Energy",
          "imageUrl": "https://world.hey.com/jorge/fd7c84d8/representations/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHNLd2QydTBaSCIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--41658909d6b1af01da17efa7774cd803ffabfb99/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDRG9UY21WemFYcGxYM1J2WDJacGJHeGJCMmtDc0FScEFuWUNPZ3h4ZFdGc2FYUjVhUzA2Q25OMGNtbHdWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--5f3b12054ee1575e23e552561c36229a846c13ea/roland-larsson-k9e4KXs6AGQ-unsplash.jpg"
        }
      ]
    },
    {
      "title": "Notes on software development",
      "feedUrl": "https://notes.eatonphil.com/rss.xml",
      "siteUrl": "http://notes.eatonphil.com/",
      "articles": [
        {
          "id": "http://notes.eatonphil.com/high-quality-subreddits-you-should-be-following.html",
          "author": null,
          "description": "Originally published on December 5, 2021.\n\nIf you are an experienced software developer whose only exposure to\nreddit is dank memes, proggit or even\nlanguage-specific subreddits like\n/r/python, you're missing out.\nWhat follows are my favorite subreddits in tech. My criteria is that:\nThe subreddit topic is relevant to advancing as a programmer\nPosts generally go into good depth\nThe comments stay on topic\nAnd the shit-posting is minimal\nThis list isn't hard to guess at if you consider advanced topics\nin software. But I wanted to share because I think it's worth\nexplicitly supporting high-quality subreddits.\n/r/EmuDev\nMy favorite sub of all. Also has a phenomenal Discord group.\n/r/ProgrammingLanguages\nFocuses a little more on PLT topics (parsing techniques, syntax, type systems) than on compiling and interpreting techniques, but still good.\n/r/DatabaseDevelopment\nAll about database internals, which ends up involving a bunch of\ncorrectness and distributed systems stuff as well.\nDisclosure: I run this sub. It's at 2.7k+ members at time of publishing.\n/r/ReverseEngineering\nThe largest subreddit on this list but still has pretty good posts.\n/r/EsoLangs\nOne of the best/most fun intros to programming languages/compilers/interpreters is through languages like Brainfuck. This sub does a good job of keeping the fun going.\n/r/Compilers\n/r/GraphicsProgramming\nWhile some language subreddits are pretty good, they are more so a\nmixed bag than some of the topic-specific subreddits here. So they\ndon't make my list, more on principle than anything else.\nIf there is a good one already, send me it!\nWhat am I missing?\nAm I missing other amazing subreddits? Just don't say\nlanguage-specific ones. :)\n\nIt's an incorrect meme IMO that tech Reddit is low-quality. You just have to find the interesting subreddits.\nI've updated my list for 2023.https://t.co/OtM2tk8HOn pic.twitter.com/ymyzChp0SO\n— Phil Eaton (@eatonphil) May 16, 2023",
          "link": "http://notes.eatonphil.com/high-quality-subreddits-you-should-be-following.html",
          "publishedOn": "2023-05-16T00:00:00.000Z",
          "wordCount": 2242,
          "title": "My favorite software subreddits",
          "imageUrl": null
        },
        {
          "id": "http://notes.eatonphil.com/books-developers-should-read.html",
          "author": null,
          "description": "Originally published on February 1, 2021. The original version\n  included two books I don't think are actually so worthwhile. This\n  list is down to two. I think that's a good thing actually.\n\nThese are the books I recommend to developers wanting to improve their\nskills as professional programmers because of high information\ndensity, believable premises/examples, and being well edited.\nYou don't need to read books to improve as a developer but\nthey are unparalleled in quickly helping you gain depth in a subject.\nHigh Performance Browser Networking\nIf you deal with networks, you would probably benefit from this book.\nIt is a thorough high level introduction to mobile networks, browser\nnetwork protocols, and fundementals of networking.\nDesigning Data-Intensive Applications\nIf you use a database (including an in-memory array of items you\nsearch periodically) or if you build APIs, you would probably benefit\nfrom this book. A solid introduction to distributed computing, data\ntransfer, indexing, etc.\nThat's it!\nGeneric software books conspicuously not on this list for\nme:\nClean Code\nJavaScript the Good Parts\nDesign Patterns/Gang of Four\nStructure and Interpretation of Computer Programs\nA Philosophy of Software Design\nThey're not all bad but give nowhere near as much return for the\ninvestment of your time.\n\nFour books I recommend to professional developers wanting to improve their craft, and a few I'd nothttps://t.co/1aTrfqZ9bd\n— Phil Eaton (@phil_eaton) February 2, 2021",
          "link": "http://notes.eatonphil.com/books-developers-should-read.html",
          "publishedOn": "2023-05-16T00:00:00.000Z",
          "wordCount": 2179,
          "title": "Two books I recommend to developers",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "CoRecursive: Coding Stories",
      "feedUrl": "https://corecursive.libsyn.com/feed",
      "siteUrl": "http://corecursive.com",
      "articles": [
        {
          "id": "9a2308c2-d87e-44a2-921f-721115d24fdc",
          "author": null,
          "description": "How do you accomplish something massive over time? I've had the chance to meet with a number of exceptional software developers and it's something I always wonder about. \n Today, I might have an answer with the incredible story of Yann Collet.\n Yann was a project manager who went from being burnt out on corporate life to becoming one of the most sought-after developers in the world. What happens when you build something so impressive and valuable that it essentially becomes invisible?\n And how do you do that when your day job is mainly organizing spreadsheets and keeping timelines on track?\n Yann built LZ4 and ZStandard - two of the world's fastest compression algorithms that have transformed databases, operating systems, file systems, and much more. We'll go back in time to Yann's initial steps with programming, his game-changing discoveries along the way and how his devotion to data compression hobby led him to create something that saves billions of dollars worldwide.\n Episode Links\n  \nEpisode Page\n Bonus 17 - Accomplishing Hard Things\n Support The Show\n Subscribe To The Podcast\n Join The Newsletter",
          "link": "https://corecursive.com/data-compression-yann--collet/",
          "publishedOn": "2023-05-02T10:00:00.000Z",
          "wordCount": null,
          "title": "Story: From Project Management to Data Compression Innovator",
          "itunes": {
            "duration": "59:23"
          },
          "enclosure": {
            "length": "86666432",
            "type": "audio/mpeg",
            "url": "https://chtbl.com/track/7D91G/traffic.libsyn.com/secure/corecursive/088_-_Yann_Collet.mp3?dest-id=628353"
          },
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Notes on software development",
      "feedUrl": "https://notes.eatonphil.com/rss.xml",
      "siteUrl": "http://notes.eatonphil.com/",
      "articles": [
        {
          "id": "http://notes.eatonphil.com/high-quality-subreddits-you-should-be-following.html",
          "author": null,
          "description": "Originally published on December 5, 2021.\n\nIf you are an experienced software developer whose only exposure to\nreddit is dank memes, proggit or even\nlanguage-specific subreddits like\n/r/python, you're missing out.\nWhat follows are my favorite subreddits in tech. My criteria is that:\nThe subreddit topic is relevant to advancing as a programmer\nPosts generally go into good depth\nThe comments stay on topic\nAnd the shit-posting is minimal\nThis list isn't hard to guess at if you consider advanced topics\nin software. But I wanted to share because I think it's worth\nexplicitly supporting high-quality subreddits.\n/r/EmuDev\nMy favorite sub of all. Also has a phenomenal Discord group.\n/r/ProgrammingLanguages\nFocuses a little more on PLT topics (parsing techniques, syntax, type systems) than on compiling and interpreting techniques, but still good.\n/r/DatabaseDevelopment\nAll about database internals, which ends up involving a bunch of\ncorrectness and distributed systems stuff as well.\nDisclosure: I run this sub. It's at 2.7k+ members at time of publishing.\n/r/ReverseEngineering\nThe largest subreddit on this list but still has pretty good posts.\n/r/EsoLangs\nOne of the best/most fun intros to programming languages/compilers/interpreters is through languages like Brainfuck. This sub does a good job of keeping the fun going.\n/r/Compilers\n/r/GraphicsProgramming\nWhile some language subreddits are pretty good, they are more so a\nmixed bag than some of the topic-specific subreddits here. So they\ndon't make my list, more on principle than anything else.\nIf there is a good one already, send me it!\nWhat am I missing?\nAm I missing other amazing subreddits? Just don't say\nlanguage-specific ones. :)\n\nIt's an incorrect meme IMO that tech Reddit is low-quality. You just have to find the interesting subreddits.\nI've updated my list for 2023.https://t.co/OtM2tk8HOn pic.twitter.com/ymyzChp0SO\n— Phil Eaton (@eatonphil) May 16, 2023",
          "link": "http://notes.eatonphil.com/high-quality-subreddits-you-should-be-following.html",
          "publishedOn": "2023-05-16T00:00:00.000Z",
          "wordCount": 2242,
          "title": "My favorite software subreddits",
          "imageUrl": null
        },
        {
          "id": "http://notes.eatonphil.com/books-developers-should-read.html",
          "author": null,
          "description": "Originally published on February 1, 2021. The original version\n  included two books I don't think are actually so worthwhile. This\n  list is down to two. I think that's a good thing actually.\n\nThese are the books I recommend to developers wanting to improve their\nskills as professional programmers because of high information\ndensity, believable premises/examples, and being well edited.\nYou don't need to read books to improve as a developer but\nthey are unparalleled in quickly helping you gain depth in a subject.\nHigh Performance Browser Networking\nIf you deal with networks, you would probably benefit from this book.\nIt is a thorough high level introduction to mobile networks, browser\nnetwork protocols, and fundementals of networking.\nDesigning Data-Intensive Applications\nIf you use a database (including an in-memory array of items you\nsearch periodically) or if you build APIs, you would probably benefit\nfrom this book. A solid introduction to distributed computing, data\ntransfer, indexing, etc.\nThat's it!\nGeneric software books conspicuously not on this list for\nme:\nClean Code\nJavaScript the Good Parts\nDesign Patterns/Gang of Four\nStructure and Interpretation of Computer Programs\nA Philosophy of Software Design\nThey're not all bad but give nowhere near as much return for the\ninvestment of your time.\n\nFour books I recommend to professional developers wanting to improve their craft, and a few I'd nothttps://t.co/1aTrfqZ9bd\n— Phil Eaton (@phil_eaton) February 2, 2021",
          "link": "http://notes.eatonphil.com/books-developers-should-read.html",
          "publishedOn": "2023-05-16T00:00:00.000Z",
          "wordCount": 2179,
          "title": "Two books I recommend to developers",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Dmitri Pavlutin Blog",
      "feedUrl": "https://dmitripavlutin.com/rss.xml",
      "siteUrl": "https://dmitripavlutin.com",
      "articles": [
        {
          "id": "https://dmitripavlutin.com/javascript-pure-function/",
          "author": "Dmitri Pavlutin",
          "description": "A pure function always returns the same value for the same arguments and produces no side-effects.",
          "link": "https://dmitripavlutin.com/javascript-pure-function/",
          "publishedOn": "2023-05-15T00:00:00.000Z",
          "wordCount": 2617,
          "title": "Pure Functions in JavaScript: A Beginner's Guide",
          "imageUrl": "https://dmitripavlutin.com/javascript-pure-function/cover.png"
        },
        {
          "id": "https://dmitripavlutin.com/typescript-record/",
          "author": "Dmitri Pavlutin",
          "description": "Record type simplifies typing objects in TypeScript. Let's see how you can benefit from it.",
          "link": "https://dmitripavlutin.com/typescript-record/",
          "publishedOn": "2023-04-28T00:00:00.000Z",
          "wordCount": 2182,
          "title": "Record Type in TypeScript",
          "imageUrl": "https://dmitripavlutin.com/typescript-record/cover.png"
        }
      ]
    },
    {
      "title": "Dietcode | Sid's blog",
      "feedUrl": "https://dietcode.io/rss",
      "siteUrl": "https://dietcode.io/",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}