{
  "sources": [
    {
      "title": "tonsky.me",
      "feedUrl": "http://tonsky.me/blog/atom.xml",
      "siteUrl": "https://tonsky.me/",
      "articles": []
    },
    {
      "title": "GolangCode",
      "feedUrl": "https://golangcode.com/index.xml",
      "siteUrl": "https://golangcode.com/",
      "articles": []
    },
    {
      "title": "Applied Go",
      "feedUrl": "https://appliedgo.net/index.xml",
      "siteUrl": "https://appliedgo.net/",
      "articles": []
    },
    {
      "title": "Dave Cheney",
      "feedUrl": "https://dave.cheney.net/feed/atom",
      "siteUrl": "https://dave.cheney.net",
      "articles": []
    },
    {
      "title": "David Heinemeier Hansson",
      "feedUrl": "https://world.hey.com/dhh/feed.atom",
      "siteUrl": "https://world.hey.com/dhh",
      "articles": [
        {
          "id": "https://world.hey.com/dhh/learning-to-accept-defeat-against-reality-141fb093",
          "author": null,
          "description": "A great many smart people terminably hamper their ability to better understand the world by refusing to accept defeat when reality proves them wrong. Armed with an intellect that's at once both too proud to recognize it's own failings and cunningly capable of producing sophisticated excuses, they're adapt at spotting this failing in others but not in themselves.\nYou see this all the time in the realm of public policy. Someone presents a plausible thesis on how to deal with a given problem. They drum up support for an attempt that follows their ideas, but when the attempt is defeated by reality, they can't retreat, and become stuck trying to defend the path in ever-more creative yet ludicrous ways.\nWatch the cadre of \"harm reduction\" activists attempt to defend the increasingly decrepit sta…",
          "link": "https://world.hey.com/dhh/learning-to-accept-defeat-against-reality-141fb093",
          "publishedOn": "2023-08-11T10:53:48.000Z",
          "wordCount": 611,
          "title": "Learning to accept defeat against reality",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/turns-out-nobody-cared-about-panel-gaps-914127d5",
          "author": null,
          "description": "One of the most fascinating aspects of Tesla's rise to dominance has been how they discarded many of the traditional values of car making. While the rest of the industry was stuck competing on the size of their panel gaps, and other aspects of precision and quality assembly, Tesla didn't even show up to participate. Their cars are legendary for being delivered with shoddy paint jobs, rattling interiors, and even mismatched doors. But it just didn't matter! Consumers voted with their wallets for poorly built EVs because well-built gas-powered cars were deemed irrelevant in comparison.\nThere's tremendous wisdom for product makers of all kinds in this lesson. It's the epitome of Blue Ocean Strategy. To find a breakthrough angle in commerce, it's as important to decide where you will not compe…",
          "link": "https://world.hey.com/dhh/turns-out-nobody-cared-about-panel-gaps-914127d5",
          "publishedOn": "2023-08-10T11:55:28.000Z",
          "wordCount": 497,
          "title": "Turns out nobody cared about panel gaps",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/the-curing-value-of-creation-98736f9f",
          "author": null,
          "description": "It's hard not to see your spirits lifted when you're part of bringing something to life. Be that a product, an organization, or a community, or all three at once. Like exercise, it's one of those rare avenues of human endeavor that almost invariably will make anyone feel better. And, also like exercise, the hard part is getting started when you need it the most!\nThat's the curious chasm between knowledge and action. As much as you may know that regular, high-intensity training of the body does wonders for the mind, summoning the motivation to follow through with a commitment to working out only gets harder and harder the more you need it. I've had periods in my life where being removed from meaningful acts of creation felt just the same way.\nThose periods were especially depressing when they felt like a simulacra of creation. Being in a situation designed to mimic the motions of making, but bereft of any meaningful progress towards that end. The pretending of purpose. The appearance of collaboration. Without any thrust towards completion.\nAnd just as how getting a positive streak of accomplishment going provides its own momentum to keep at it, so too does a negative streak of performative busyness. It pulls you back into the comfort of the mental couch, and hands you the bag of chips to soothe your nagging sense of uselessness. For every day you stay there, the harder it is to get up, so best to muster everything you got to escape the dulling inertia now.\nMake something. Participate in something. Engage with someone. All of it might feel as unnatural as strapping on those running shoes after too long of a break, but once you're back to creating, the energy comes by itself.",
          "link": "https://world.hey.com/dhh/the-curing-value-of-creation-98736f9f",
          "publishedOn": "2023-08-08T09:52:21.000Z",
          "wordCount": 382,
          "title": "The curing value of creation",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/et-tu-zoom-b90a0a0a",
          "author": null,
          "description": "The corporate cause for return-to-office just claimed its perhaps most ironic victim: Zoom! The company that literally lives to sell us all on the wonders of remote collaboration wants its own people back into the office again. Which I guess is just a regression to the mean of productivity tool makers failing to believe their own marketing, but it's a bit sad none the less.\nNot the least because this push for return-to-office has now been proven completely safe for large tech corporations. Thanks to the mixture of mass layoffs earlier this year and the now numerous proclamations that remote-first is over at the majority of big companies. Safety in sentiment, safety in numbers.\nThis is an opportunistic squeeze, because what's most tech workers supposed to do? The option of simply hopping to another company has been severely limited. Outside the small realm of AI experts, most other domains just aren't anywhere nearly as contested in hiring as they once were. So this is happening now because it can happen now.\nI just hope that people who really did enjoy that remote work-lifetyle don't forget what it was like. The balance of power will presumably turn around one day again, and when it does, voting with your feet will be an option again.\nUntil then, I suspect that the likes of Shopify, Automattic, and other stalwart defenders of remote work will continue to see their openings become increasingly oversubscribed. Just like we've had at 37signals for going on two decades.\nRemote work might be receding, but it's simply too compelling an option for too many to ever disappear. The long-term trend line ain't going anywhere.",
          "link": "https://world.hey.com/dhh/et-tu-zoom-b90a0a0a",
          "publishedOn": "2023-08-07T16:30:48.000Z",
          "wordCount": 357,
          "title": "Et tu, Zoom?",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/not-everyone-can-be-the-best-ef9ebacd",
          "author": null,
          "description": "Many software developers seem to have a uniquely hard time accepting that not everyone who just tries real hard will become so good as to be among the best in this field. That there really is a discrepancy of talent that leads to a discrepancy of competence. That not everyone can or will become equally good at this job.\nIn contrast, nobody seems to have trouble with the fact that not every soccer player who loves the game and trains their best will become eligible for the Premier League. Or that becoming a brain surgeon might indeed really be harder than making it as a general practitioner, which in itself is hard enough too!\nBut becoming a developer can happen without ever really having to face an adversarial examination of your skills. There's no 90-minute clock that ends with a look at …",
          "link": "https://world.hey.com/dhh/not-everyone-can-be-the-best-ef9ebacd",
          "publishedOn": "2023-08-04T09:59:59.000Z",
          "wordCount": 698,
          "title": "Not everyone can be the best",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/x-marks-the-motivated-reasoning-13450584",
          "author": null,
          "description": "I’ve lost track of all the things that Musk has done to Twitter that ought to have brought it down by now. Scarcely a month goes by without some action triggering the incessant bells of doom, ringing from the bellies of bloviating ding dongs. And the ringing seemingly never stops long enough to allow for some basic contemplation or correction, as reality wrecks another prediction of peril.\n\n\nBut the obsession with all things Elon is so strong that there’s no room or time for introspection of any kind. It’s just on to the next faux outrage of tomorrow. Make sure you never miss a chance to be an expert on social media, advertising, team building, economics, or branding so you can tell the world’s most successful entrepreneur what a total idiot he’s being, and how much smarter, wiser, and kin…",
          "link": "https://world.hey.com/dhh/x-marks-the-motivated-reasoning-13450584",
          "publishedOn": "2023-07-27T09:16:53.000Z",
          "wordCount": 579,
          "title": "X marks the motivated reasoning",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/working-remotely-is-a-competitive-hiring-advantage-again-c182250e",
          "author": null,
          "description": "As more and more companies, especially large ones, have started demanding remote workers return to the office, the competitive hiring advantage for remote-first companies is back. And it's even bigger than before the pandemic, now that so many workers have had a taste of what life can be like when you don't have to commute to the office. This is great news for smaller companies and startups in particular.\nLet's face it, if you're trying to compete for talent with the likes of Google or Apple, you need all the help you can get, and these companies forcing everyone back into an office might just be your biggest lift. Because for quite a few people, working remotely or not has become the defining characteristic of a job. To the point where many remote workers won't even consider a position th…",
          "link": "https://world.hey.com/dhh/working-remotely-is-a-competitive-hiring-advantage-again-c182250e",
          "publishedOn": "2023-07-26T07:44:14.000Z",
          "wordCount": 459,
          "title": "Working remotely is a competitive hiring advantage again",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/pick-promise-over-proof-756604d3",
          "author": null,
          "description": "After hiring people for twenty years, I've come to accept that it's impossible to know up front what someone is truly capable of. Sure, we try our best to make good, educated guesses during the hiring process, and this is why asking finalists to do sample work projects is so crucial. But it still remains just guessing, and the truth doesn't emerge until you afford the hire a full attempt on a real project.\nThat's why I'm such a fan of starting new employees in the deep end. Putting them to work on a real project right away. But this is only half the commitment you ought to make to their potential.\nIt's just as important to retain the possibility of rapid progression by continuing to test their promise against harder and bigger challenges. I can't tell you the number of times I've been posi…",
          "link": "https://world.hey.com/dhh/pick-promise-over-proof-756604d3",
          "publishedOn": "2023-07-25T08:49:19.000Z",
          "wordCount": 538,
          "title": "Pick promise over proof",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        }
      ]
    },
    {
      "title": "Jason Fried",
      "feedUrl": "https://world.hey.com/jason/feed.atom",
      "siteUrl": "https://world.hey.com/jason",
      "articles": []
    },
    {
      "title": "The Plain Text Project",
      "feedUrl": "https://plaintextproject.online/feed.xml",
      "siteUrl": "https://plaintextproject.online",
      "articles": []
    },
    {
      "title": "Andrew Kelley",
      "feedUrl": "https://andrewkelley.me/rss.xml",
      "siteUrl": "https://andrewkelley.me/",
      "articles": []
    },
    {
      "title": "Martin Fowler",
      "feedUrl": "https://martinfowler.com/feed.atom",
      "siteUrl": "https://martinfowler.com/feed.atom",
      "articles": [
        {
          "id": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#SupportingThePeople",
          "author": null,
          "description": "Having a robust digital talent strategy is a competitive advantage in\n     today’s fiercely competitive market. This enables businesses to have the\n     right talent and have the right competencies to meet current and future\n     demand to meet business goals or to stay on track for digital\n     transformation aspirations. Sarah Taraporewalla continues\n     her article on how to create an integrated business and technology strategy\n     by looking at questions raised by two strategic directions that\n     support people: culture and internal systems.\nmore…",
          "link": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#SupportingThePeople",
          "publishedOn": "2023-08-22T15:22:00.000Z",
          "wordCount": 9504,
          "title": "Strategic Directions supporting the people",
          "imageUrl": "https://martinfowler.com/articles/creating-integrated-tech-strategy/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/bottlenecks-of-scaleups/05-resilience-and-observability.html",
          "author": null,
          "description": "Here is a new article in the bottlenecks of scaleups series, looking at\n     resilience and observability. Startups tend to only address resilience when\n     their systems are already down, often taking a very reactive approach. For\n     a scaleup, excessive system downtime represents a significant\n     bottleneck to the organization, both from the effort expended on\n     restoring function and also from the impact of customer dissatisfaction.\n     Punit Lad and Carl Nygard explain that to\n     move past this, resilience needs to be built into the business objectives,\n     which will influence the architecture, design, product management, and even\n     governance of business systems. \nmore…",
          "link": "https://martinfowler.com/articles/bottlenecks-of-scaleups/05-resilience-and-observability.html",
          "publishedOn": "2023-08-22T14:21:00.000Z",
          "wordCount": 7837,
          "title": "Bottlenecks of Scaleups #05: Resilience and Observability",
          "imageUrl": "https://martinfowler.com/articles/bottlenecks-of-scaleups/card-resilience-observability.png"
        },
        {
          "id": "https://martinfowler.com/articles/exploring-gen-ai.html#memo-06",
          "author": null,
          "description": "At Thoughtworks, we are strong practitioners of Test Driven Development (TDD).\n     Naturally this leads to the question of how generative AI can help with\n     this technique. Paul Sobocinski writes a brief memo\n     explaining how some of our teams have used TDD with GitHub\n     Copilot. As ever, co-pilot can't be relied on to fly the plane, but\n     can suggest some useful ideas for the red and green steps. It isn't\n     very helpful for the all-important refactoring step.\nmore…",
          "link": "https://martinfowler.com/articles/exploring-gen-ai.html#memo-06",
          "publishedOn": "2023-08-17T18:44:00.000Z",
          "wordCount": 5691,
          "title": "TDD with GitHub Copilot",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#ReviewAndGovernTechnologyPortfolio",
          "author": null,
          "description": "Sofia Tania  and  Stefania\n       Stefansdottir complete their examination of how to overcome the\n       bottleneck that costs impose on a scaleup. In this final installment,\n       they look at how to review and govern the technology portfolio,\n       optimize rates, and provide a general view of cost efficiency initiatives\n       during the life-cycle of a scaleup.\nmore…",
          "link": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#ReviewAndGovernTechnologyPortfolio",
          "publishedOn": "2023-08-17T00:00:00.000Z",
          "wordCount": 7371,
          "title": "Final parts of the cost bottleneck of scaleups",
          "imageUrl": "https://martinfowler.com/articles/bottlenecks-of-scaleups/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#risk",
          "author": null,
          "description": "Time for two more strategic directions from Sarah\n     Taraporewalla. These look at the questions that need to be investigated when\n     reducing cost, minimizing operation risk, and enabling data-driven decision\n     making.\nmore…",
          "link": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#risk",
          "publishedOn": "2023-08-16T19:49:00.000Z",
          "wordCount": 7866,
          "title": "Strategic directions: minimizing risk and being data driven",
          "imageUrl": "https://martinfowler.com/articles/creating-integrated-tech-strategy/card.png"
        },
        {
          "id": "https://www.thoughtworks.com/about-us/events/webinars/scaling-bottlenecks--technology-mistakes-every-growing-startup-m",
          "author": null,
          "description": "Join Tim Cochran and Rickey Zachery on Thursday, September 7th 1-2pm EST\n     for a webinar on Bottlenecks of\n     Scaleups: Technology mistakes every growing startup makes. They researched\n     Thoughtwork's portfolio to analyze why companies struggle to scale,\n     spanning across Technology, People, and Product. Covering areas such as\n     experimentation culture, overcomplicated architectures, onboarding,\n     developer productivity, product and engineering collaboration, and cost\n     efficiency.\nmore…",
          "link": "https://www.thoughtworks.com/about-us/events/webinars/scaling-bottlenecks--technology-mistakes-every-growing-startup-m",
          "publishedOn": "2023-08-15T18:35:00.000Z",
          "wordCount": 1060,
          "title": "Bottlenecks of Scaleups Webinar: Sep 7 2023",
          "imageUrl": "https://www.thoughtworks.com/content/dam/thoughtworks/images/photography/meta/about-us/ab_meta_scaling_bottlenecks2.jpg"
        },
        {
          "id": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#BuildingAStrongFoundation",
          "author": null,
          "description": "Any business that wants to grow needs to be built on strong and stable\n     foundations. While these strategic directions are often familiar to\n     technical folks it's important that the improvements to engineering align\n     with the themes that resonate with the rest of the organization.\n     Sarah Taraporewalla illustrates how this appears with two\n     strategic directions that consider improvements in efficiency and quality.\nmore…",
          "link": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#BuildingAStrongFoundation",
          "publishedOn": "2023-08-15T14:16:00.000Z",
          "wordCount": 6389,
          "title": "Strategic directions to build a strong foundation",
          "imageUrl": "https://martinfowler.com/articles/creating-integrated-tech-strategy/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#SustainPhase",
          "author": null,
          "description": "When scaling up, getting costs under control is vital to stabilizing\n       financial health. But as a weight-loss expert might say, the key to\n       long-term health is to do things that promote a sustainable lifestyle.\n       Sofia Tania  and  Stefania\n       Stefansdottir now move on to begin to describe these\n       initiatives: federated accountability, visibility, and nudges\n       towards better financial discipline.\n       \nmore…",
          "link": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#SustainPhase",
          "publishedOn": "2023-08-15T14:15:00.000Z",
          "wordCount": 6073,
          "title": "Actions to sustain cost control for scaleups",
          "imageUrl": "https://martinfowler.com/articles/bottlenecks-of-scaleups/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/202308-stefan-tilkov.html",
          "author": null,
          "description": "We are saddened today to learn of the passing of Stefan Tilkov. We’ve met Stefan several times at workshops and conferences and always enjoyed his good company and insightful views. He advocated many of the things that we and our colleagues support - and as well as skillfully explaining these ideas, he also backed them up with concrete experience from his work. We shall really miss his wise contributions online, and regret that we won’t get the chance to chat with him again. We offer our condolences to his family, friends, and colleagues at INNOQ.\nBirgitta Boeckeler\nErik Dörnenburg\nNeal Ford\nMartin Fowler\nJames Lewis\nRebecca Parsons\nDaniel Terhorst-North",
          "link": "https://martinfowler.com/articles/202308-stefan-tilkov.html",
          "publishedOn": "2023-08-14T18:58:00.000Z",
          "wordCount": 216,
          "title": "We will miss Stefan Tilkov",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#ReducePhase",
          "author": null,
          "description": "When scaleups need to start working on cost efficiency, our experience\n       is that they need to form a cost optimization team to work on the\n       immediate steps that are needed. In this installment Sofia and\n       Stefania describe how to understand the primary cost drivers,\n       together with the levers to get them under control. \nmore…",
          "link": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#ReducePhase",
          "publishedOn": "2023-08-10T15:17:00.000Z",
          "wordCount": 4476,
          "title": "First stage of reducing costs for a scaleup",
          "imageUrl": "https://martinfowler.com/articles/bottlenecks-of-scaleups/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#expand-segments",
          "author": null,
          "description": "Sarah Taraporewalla moves on to the remaining two\n     strategic directions that are part of growing the business.\n     Expanding into new customer segments can introduce new operational\n     processes or channels. Inorganic growth (eg acquisitions and mergers) needs\n     an understanding of the drivers of increased value and the long term\n     expectation (eg merge or keep separate and divest) for the business unit. \nmore…",
          "link": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html#expand-segments",
          "publishedOn": "2023-08-10T14:12:00.000Z",
          "wordCount": 4345,
          "title": "Tech strategy for new customer segments and inorganic growth",
          "imageUrl": "https://martinfowler.com/articles/creating-integrated-tech-strategy/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/exploring-gen-ai.html#memo-05",
          "author": null,
          "description": "In her 5th memo about exploring GenAI for software development,\n      Birgitta Böckeler answers the frequently asked question if\n      coding assistants are making the practice of Pair Programming\n      obsolete. Spoiler alert: They don't.\nmore…",
          "link": "https://martinfowler.com/articles/exploring-gen-ai.html#memo-05",
          "publishedOn": "2023-08-10T13:31:00.000Z",
          "wordCount": 4578,
          "title": "Coding assistants do not replace pair programming",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html",
          "author": null,
          "description": "My colleague Sarah Taraporewalla describes an approach\n     to building technology strategy that challenges the convention. It starts\n     by identifying the overall strategic directions that the organization is\n     considering, and using common aspects of these directions to indicate the\n     investigations needed for the organization to understand the technology\n     implications raised by that strategic change. This first\n     installment looks at two of these directions: expanding the business\n     by creating complementary products, and expanding the business into new\n     markets and regions. \nmore…",
          "link": "https://martinfowler.com/articles/creating-integrated-tech-strategy.html",
          "publishedOn": "2023-08-08T10:35:00.000Z",
          "wordCount": 2802,
          "title": "Creating an integrated business and technology strategy",
          "imageUrl": "https://martinfowler.com/articles/creating-integrated-tech-strategy/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/exploring-gen-ai.html#in-line-assistance---how-can-it-get-in-the-way?",
          "author": null,
          "description": "While coding assistants like Copilot can improve speed and flow, they\n     can also disrupt it. Birgitta Böckeler looks at two ways\n     in which they can get in the way: amplifying bad or outdated\n     practices, and review fatigue.\nmore…",
          "link": "https://martinfowler.com/articles/exploring-gen-ai.html#in-line-assistance---how-can-it-get-in-the-way?",
          "publishedOn": "2023-08-03T15:37:00.000Z",
          "wordCount": 4050,
          "title": "Exploring Gen AI: how can in-line assistance get in the way?",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#exit",
          "author": null,
          "description": "Sofia and Stefania begin their examination of how to\n     get out of the bottleneck of surging cloud costs by relating a case study\n     from a recent client - illustrating how the cost control can be separated\n     into reduce and sustain phases.\nmore…",
          "link": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html#exit",
          "publishedOn": "2023-08-01T14:19:00.000Z",
          "wordCount": 2494,
          "title": "A case study of getting out of the costs bottleneck",
          "imageUrl": "https://martinfowler.com/articles/bottlenecks-of-scaleups/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/exploring-gen-ai.html#in-line-assistance---when-is-it-more-useful?",
          "author": null,
          "description": "The most widely used form of coding assistance in Thoughtworks at the\n     moment is in-line code generation in the IDE, where an IDE extension\n     generates suggestions for the developer as they are typing.\n     Birgitta Böckeler looks at the factors that\n     impact the usefulness of these suggestions, indicating where they\n     lead to safe waters, and the rocks that we need to look out for.\nmore…",
          "link": "https://martinfowler.com/articles/exploring-gen-ai.html#in-line-assistance---when-is-it-more-useful?",
          "publishedOn": "2023-08-01T13:51:00.000Z",
          "wordCount": 3272,
          "title": "Exploring Gen AI: When is in-line assistance useful?",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html",
          "author": null,
          "description": "As startups begin to grow rapidly, they often find that early decisions\n     that helped them find a product/market fit lead to excessive costs once\n     traffic increases. These costs can threaten a scaleup's ability to grow.\n     Sofia Tania and Stefania Stefansdottir have worked with\n     many scaleups in this predicament and share their approach to understanding\n     and reducing these costs.\nmore…",
          "link": "https://martinfowler.com/articles/bottlenecks-of-scaleups/04-costs.html",
          "publishedOn": "2023-07-31T13:30:00.000Z",
          "wordCount": 1682,
          "title": "Bottlenecks of Scaleups: Cost Efficiency",
          "imageUrl": "https://martinfowler.com/articles/bottlenecks-of-scaleups/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/exploring-gen-ai.html#median---a-tale-in-three-functions",
          "author": null,
          "description": "Birgitta Böckeler continues her explorations in using\n     LLMs, this time by asking GitHub Copilot to write a median\n     function. It gave her three suggestions to choose from. The\n     experience shows you still have to know what you're doing when asking LLMs\n     to write code, since the LLM's programming skills are often rather flawed.\nmore…",
          "link": "https://martinfowler.com/articles/exploring-gen-ai.html#median---a-tale-in-three-functions",
          "publishedOn": "2023-07-27T14:34:00.000Z",
          "wordCount": 2163,
          "title": "Exploring Gen AI - Three versions of a median",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/exploring-gen-ai.html#the-toolchain",
          "author": null,
          "description": "My colleague Birgitta Böckeler has long been one of our senior\n     technology leaders in Germany. She's now moved into a new role coordinating\n     our work with Generative AI and its effect of software delivery practices.\n     She's decided to publish her exploration in a series of memos. The first\n     memo looks at the current toolchain for LLMs, categorizing them by what\n     tasks they help with, how we interact with the LLM, and where they come from.\nmore…",
          "link": "https://martinfowler.com/articles/exploring-gen-ai.html#the-toolchain",
          "publishedOn": "2023-07-26T14:52:00.000Z",
          "wordCount": 1082,
          "title": "Exploring Gen AI - The toolchain",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/bliki/TeamTopologies.html",
          "author": null,
          "description": "Any large software effort, such as the software estate for a large\n    company, requires a lot of people - and whenever you have a lot of people\n    you have to figure out how to divide them into effective teams. Forming\n    Business Capability Centric teams helps software efforts to\n    be responsive to customers’ needs, but the range of skills required often\n    overwhelms such teams. Team Topologies is a model\n    for describing the organization of software development teams,\n    developed by Matthew Skelton and Manuel Pais. It defines four forms\n    of teams and three modes of team\n    interactions. The model encourages healthy interactions that allow \n    business-capability centric teams to flourish in their task of providing a\n    steady flow of valuable software.\nThe primary kind o…",
          "link": "https://martinfowler.com/bliki/TeamTopologies.html",
          "publishedOn": "2023-07-25T13:25:00.000Z",
          "wordCount": 1618,
          "title": "Bliki: TeamTopologies",
          "imageUrl": "https://martinfowler.com/bliki/images/team-topologies/diagram.png"
        },
        {
          "id": "https://martinfowler.com/bliki/TwoPizzaTeam.html",
          "author": null,
          "description": "A two-pizza team is a small team\n  that fully supports software for a particular business capability. The term\n  became popular as it used to describe how Amazon organized their software staff.\nThe name suggests the most obvious aspect of such teams, their size. The\n  name comes from the principle that the team should no larger than can be fed\n  with two pizzas. (Although we are talking about American Pizzas here, which\n  seemed alarmingly huge when I first encountered them over here.) Keeping a\n  team small keeps it cohesive, forming tight working relationships. Typically I\n  hear this means such teams are about 5-8 people, although my experience\n  suggests that the upper limit is somewhere about 15.\nAlthough the name focuses solely on the size, just as important is the\n  team's focus. A …",
          "link": "https://martinfowler.com/bliki/TwoPizzaTeam.html",
          "publishedOn": "2023-07-25T13:22:00.000Z",
          "wordCount": 680,
          "title": "Bliki: TwoPizzaTeam",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        }
      ]
    },
    {
      "title": "Adam Wathan's Work Journal",
      "feedUrl": "https://adamwathan.me/journal/rss.xml",
      "siteUrl": "https://adamwathan.me/journal",
      "articles": []
    },
    {
      "title": "Rust Blog",
      "feedUrl": "https://blog.rust-lang.org/feed.xml",
      "siteUrl": "https://blog.rust-lang.org/",
      "articles": [
        {
          "id": "https://blog.rust-lang.org/2023/08/07/Rust-Survey-2023-Results.html",
          "author": null,
          "description": "Hello, Rustaceans!\nFor the 6th year in a row, the Rust Project conducted a survey on the Rust programming language, with participation from project maintainers, contributors, and those generally interested in the future of Rust. This edition of the annual State of Rust Survey opened for submissions on December 5 and ran until December 22, 2022.\nFirst, we'd like to thank you for your patience on these long delayed results. We hope to identify a more expedient and sustainable process going forward so that the results come out more quickly and have even more actionable insights for the community.\nThe goal of this survey is always to give our wider community a chance to express their opinions about the language we all love and help shape its future. We’re grateful to those of you who took the …",
          "link": "https://blog.rust-lang.org/2023/08/07/Rust-Survey-2023-Results.html",
          "publishedOn": "2023-08-07T00:00:00.000Z",
          "wordCount": 1292,
          "title": "2022 Annual Rust Survey Results",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/2023/08/03/Rust-1.71.1.html",
          "author": null,
          "description": "The Rust team has published a new point release of Rust, 1.71.1. Rust is a\nprogramming language that is empowering everyone to build reliable and\nefficient software.\nIf you have a previous version of Rust installed via rustup, getting Rust\n1.71.1 is as easy as:\nrustup update stable\n\nIf you don't have it already, you can get rustup from the\nappropriate page on our website.\nWhat's in 1.71.1 stable\nRust 1.71.1 fixes Cargo not respecting the umask when extracting dependencies,\nwhich could allow a local attacker to edit the cache of extracted source code\nbelonging to another local user, potentially executing code as another user.\nThis security vulnerability is tracked as CVE-2023-38497, and you can read\nmore about it on the advisory we published earlier today. We\nrecommend all users to update their toolchain as soon as possible.\nRust 1.71.1 also addresses several regressions introduced in Rust 1.71.0,\nincluding bash completion being broken for users of Rustup, and the\nsuspicious_double_ref_op being emitted when calling borrow() even though it\nshouldn't.\nYou can find more detailed information on the specific regressions, and other\nminor fixes, in the release notes.\nContributors to 1.71.1\nMany people came together to create Rust 1.71.1. We couldn't have done it\nwithout all of you. Thanks!",
          "link": "https://blog.rust-lang.org/2023/08/03/Rust-1.71.1.html",
          "publishedOn": "2023-08-03T00:00:00.000Z",
          "wordCount": 277,
          "title": "Announcing Rust 1.71.1",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/2023/08/03/cve-2023-38497.html",
          "author": null,
          "description": "This is a cross-post of the official security advisory. The\nofficial advisory contains a signed version with our PGP key, as well.\nThe Rust Security Response WG was notified that Cargo did not respect the umask\nwhen extracting crate archives on UNIX-like systems. If the user downloaded a\ncrate containing files writeable by any local user, another local user could\nexploit this to change the source code compiled and executed by the current\nuser.\nThis vulnerability has been assigned CVE-2023-38497.\nOverview\nIn UNIX-like systems, each file has three sets of permissions: for the user\nowning the file, for the group owning the file, and for all other local users.\nThe \"umask\" is configured on most systems to limit those permissions\nduring file creation, removing dangerous ones. For example, the de…",
          "link": "https://blog.rust-lang.org/2023/08/03/cve-2023-38497.html",
          "publishedOn": "2023-08-03T00:00:00.000Z",
          "wordCount": 585,
          "title": "Security advisory for Cargo (CVE-2023-38497)",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        }
      ]
    },
    {
      "title": "Inside Rust Blog",
      "feedUrl": "https://blog.rust-lang.org/inside-rust/feed.xml",
      "siteUrl": "https://blog.rust-lang.org/inside-rust/",
      "articles": [
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/08/21/1.72.0-prerelease.html",
          "author": null,
          "description": "The 1.72.0 pre-release is ready for testing. The release is scheduled for\nAugust 24. Release notes can be found here.\nYou can try it out locally by running:\nRUSTUP_DIST_SERVER=https://dev-static.rust-lang.org rustup update stable\n\nThe index is https://dev-static.rust-lang.org/dist/2023-08-21/index.html.\nYou can leave feedback on the internals thread.\nThe release team is also thinking about changes to our pre-release process:\nwe'd love your feedback on this GitHub issue.",
          "link": "https://blog.rust-lang.org/inside-rust/2023/08/21/1.72.0-prerelease.html",
          "publishedOn": "2023-08-21T00:00:00.000Z",
          "wordCount": 139,
          "title": "1.72.0 pre-release testing",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/08/02/rotating-compiler-leads.html",
          "author": null,
          "description": "As initiated in late 2020 and ratified by RFC 3262, the Rust compiler team uses a rotating system of co-leads.\nAfter two and a half years, we've decided its time to rotate the leadership again!\nWelcome David Wood\nFelix Klock is stepping down from his role as senior lead and David Wood is joining Wesley Wiser as the new junior lead for the team.\nFelix remains a valued member of the compiler team (and also the language design team).\nFelix will be focusing on reducing the sizes of Rust futures, and on improving the state of the art for authoring Unsafe Rust, via projects such as Krabcake.\nDavid has been a contributor to the Rust project since 2017, a compiler-contributor since 2019 and became a compiler team member in 2021.\nHis contributions include work on the diagnostic translation effort, split DWARF support, polymorphisation, non-lexical lifetimes initiative and general maintenance to the compiler.\nDavid has also been a contributor to the governance and organization of the compiler team itself via policy proposals and regular participation in our weekly triage and steering meetings.\nFelix and I are excited to welcome David into this leadership role and I am thrilled to be working alongside him.",
          "link": "https://blog.rust-lang.org/inside-rust/2023/08/02/rotating-compiler-leads.html",
          "publishedOn": "2023-08-02T00:00:00.000Z",
          "wordCount": 281,
          "title": "Rotating Rust compiler team leadership",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/08/01/1.71.1-prerelease.html",
          "author": null,
          "description": "The 1.71.1 pre-release is ready for testing. The release is scheduled for\nAugust 3. Release notes can be found here.\nYou can try it out locally by running:\nRUSTUP_DIST_SERVER=https://dev-static.rust-lang.org rustup update stable\n\nThe index is https://dev-static.rust-lang.org/dist/2023-08-01/index.html.\nYou can leave feedback on the internals thread.\nThe release team is also thinking about changes to our pre-release process:\nwe'd love your feedback on this GitHub issue.",
          "link": "https://blog.rust-lang.org/inside-rust/2023/08/01/1.71.1-prerelease.html",
          "publishedOn": "2023-08-01T00:00:00.000Z",
          "wordCount": 139,
          "title": "1.71.1 pre-release testing",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/07/25/leadership-council-update.html",
          "author": null,
          "description": "Hello again from the Rust Leadership Council. In our first blog post, we laid out several immediate goals for the council and promised to report back on their progress. It has been about a month since our first update so we wanted to share how it's going and what we're working on now.\nAccomplishments so far\nIn our first post, we wrote:\nIn the coming weeks we will be establishing the basic infrastructure for the group, including creating a plan for regular meetings and a process for raising agenda items, setting up a team repository, and ultimately completing the transition from the former Rust leadership structures.\nWe have made progress on each of these things.\nFor the last month we have been holding weekly meetings and will continue to do so for at least the next month. In the long term,…",
          "link": "https://blog.rust-lang.org/inside-rust/2023/07/25/leadership-council-update.html",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 895,
          "title": "July 2023 Leadership Council Update",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        }
      ]
    },
    {
      "title": "Jorge Manrubia",
      "feedUrl": "https://world.hey.com/jorge/feed.atom",
      "siteUrl": "https://world.hey.com/jorge",
      "articles": [
        {
          "id": "https://world.hey.com/jorge/difficult-and-complex-8b3bcc2f",
          "author": null,
          "description": "There is complex and there is difficult, they are not the same. \n\n\nBeing able to run a marathon is very difficult. But what you have to do to prepare is simple. A small sheet of paper is enough to describe the steps. You will need tremendous effort and discipline - so it’s hard - but it is simple.\n\n\nSoftware development is different: it is also complex.\n\n\nA common theme in my articles on how we do Rails at 37signals is how facing software development with rigid recipes is naive and counterproductive. A good example is services: using a service for everything is a simple idea; applying domain-driven design and object orientation is not. Another manifestation is banning techniques because they can be harmful: concerns, accessing the database from models, callbacks, globals, etc. Ironically, the alternative critics usually recommend for those is using services.\n\n\nIn software, you must take a Babylonian body of knowledge, combine it with your own experience, and apply the result to make countless daily decisions. And of all this for a problem you can’t understand without solving it first. Rigidity doesn’t work, and – because this is a game of intricate complexity – it yields more harm than benefit. You need to embrace nuance.\n\n\nMind the recipes you follow.\n\n---\njorgemanrubia.com",
          "link": "https://world.hey.com/jorge/difficult-and-complex-8b3bcc2f",
          "publishedOn": "2023-08-11T11:10:12.000Z",
          "wordCount": 258,
          "title": "Difficult and complex",
          "imageUrl": "https://world.hey.com/jorge/avatar-d08cb3ee63ecbd49736f76ee2caffa4c99a1c0fd"
        },
        {
          "id": "https://world.hey.com/jorge/globals-callbacks-and-other-sacrileges-d9832c35",
          "author": null,
          "description": "This article was originally published in the 37signals dev blog.\n\nSacrificing purity for convenience is one of the Rails pillars. This principle informs several Rails features that some recommend avoiding but that we happily use in our apps. In this post, I’ll discuss how we use three of those in Basecamp.\n\nI’ll show some examples involving projects. In Basecamp, a Bucket represents a top-level container of data, and there are several types of buckets, one of which is a Project. Internally, we implement this with delegated type attribute, where a Bucket has an associated Bucketable. A Bucket can contain many Events, and an Event is a holder for information on the related request, such as the IP or the transaction id (Event::Request) and some additional information (Event::Detail).\n\n  \n    …",
          "link": "https://world.hey.com/jorge/globals-callbacks-and-other-sacrileges-d9832c35",
          "publishedOn": "2023-08-01T07:18:20.000Z",
          "wordCount": 1903,
          "title": "Globals, callbacks and other sacrileges",
          "imageUrl": "https://world.hey.com/jorge/d9832c35/representations/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHNLd2YyT3c1TyIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--4ab7d06f3d845b2692f05bfaaee944187585be01/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDRG9UY21WemFYcGxYM1J2WDJacGJHeGJCMmtDc0FScEFuWUNPZ3h4ZFdGc2FYUjVhUzA2Q25OMGNtbHdWQT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--5f3b12054ee1575e23e552561c36229a846c13ea/CleanShot%202023-08-01%20at%2009.18.53@2x.png"
        }
      ]
    },
    {
      "title": "Notes on software development",
      "feedUrl": "https://notes.eatonphil.com/rss.xml",
      "siteUrl": "http://notes.eatonphil.com/",
      "articles": [
        {
          "id": "http://notes.eatonphil.com/2023-08-15-thinking-about-functional-programming.html",
          "author": null,
          "description": "Someone on Discord asked about how to learn functional programming.\nThe question and my initial tweet on the subject prompted an\ninteresting\ndiscussion\nwith Shriram\nKrishnamurthi and other folks.\nSo here's a slightly more thought out exploration.\nAnd just for backstory sake: I spent a few years a while\nago programming in\nStandard ML and I wrote\na chunk of a Scheme\n  implementation. I'm not an expert, but I have a bit of background.\nHey, this is a free opinion.\nConcepts from functional programming\nWhen people talk about functional programming, I think of a few key\nchoices you can make while programming:\nImmutability by default\n(Tail) recursion by default\nFirst-class functions (and the suite of tools that go along with it. e.g. map, reduce/fold)\nAnd if you have experience as a programmer, yo…",
          "link": "http://notes.eatonphil.com/2023-08-15-thinking-about-functional-programming.html",
          "publishedOn": "2023-08-15T00:00:00.000Z",
          "wordCount": 2744,
          "title": "Thinking about functional programming",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "CoRecursive: Coding Stories",
      "feedUrl": "https://corecursive.libsyn.com/feed",
      "siteUrl": "http://corecursive.com",
      "articles": [
        {
          "id": "f2245ac3-a554-43ca-a0f1-14bac7674e2b",
          "author": null,
          "description": "Learning to code can feel impossible. Like facing a sheer rock wall with no ropes or harnesses. But what if there was a path up the mountain? A trail blazed smooth by master coders who went before? \n In this episode, we'll follow that path. We'll hear the stories of legends like Seymour Papert, who championed active, project-based learning. Of Fred Brooks, who discovered that pairing accelerates learning. And more. \n The research shows that with the right methods, motivation, and support, anyone can master learning curves and summit. So join me as we uncover the science behind learning to code. You'll walk away fired up, equipped with proven techniques to unlock your potential and conquer new technical skills. \n  \n  The climb is on!  \n  \nEpisode Page\n Support The Show\n Subscribe To The Podcast\n Join The Newsletter",
          "link": "https://corecursive.com/the-science-of-learning-to-code/",
          "publishedOn": "2023-08-02T10:00:00.000Z",
          "wordCount": null,
          "title": "The Science of Learning to Code",
          "itunes": {
            "duration": "50:45"
          },
          "enclosure": {
            "length": "74229971",
            "type": "audio/mpeg",
            "url": "https://chtbl.com/track/7D91G/traffic.libsyn.com/secure/corecursive/091-Learning_Research.mp3?dest-id=628353"
          },
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Notes on software development",
      "feedUrl": "https://notes.eatonphil.com/rss.xml",
      "siteUrl": "http://notes.eatonphil.com/",
      "articles": [
        {
          "id": "http://notes.eatonphil.com/2023-08-15-thinking-about-functional-programming.html",
          "author": null,
          "description": "Someone on Discord asked about how to learn functional programming.\nThe question and my initial tweet on the subject prompted an\ninteresting\ndiscussion\nwith Shriram\nKrishnamurthi and other folks.\nSo here's a slightly more thought out exploration.\nAnd just for backstory sake: I spent a few years a while\nago programming in\nStandard ML and I wrote\na chunk of a Scheme\n  implementation. I'm not an expert, but I have a bit of background.\nHey, this is a free opinion.\nConcepts from functional programming\nWhen people talk about functional programming, I think of a few key\nchoices you can make while programming:\nImmutability by default\n(Tail) recursion by default\nFirst-class functions (and the suite of tools that go along with it. e.g. map, reduce/fold)\nAnd if you have experience as a programmer, yo…",
          "link": "http://notes.eatonphil.com/2023-08-15-thinking-about-functional-programming.html",
          "publishedOn": "2023-08-15T00:00:00.000Z",
          "wordCount": 2744,
          "title": "Thinking about functional programming",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Dmitri Pavlutin Blog",
      "feedUrl": "https://dmitripavlutin.com/rss.xml",
      "siteUrl": "https://dmitripavlutin.com",
      "articles": []
    },
    {
      "title": "Dietcode | Sid's blog",
      "feedUrl": "https://dietcode.io/rss",
      "siteUrl": "https://dietcode.io/",
      "articles": []
    },
    {
      "title": "Infrequently Noted",
      "feedUrl": "https://infrequently.org/feed/",
      "siteUrl": "https://infrequently.org/feed/feed.xml",
      "articles": []
    },
    {
      "title": "Moving the Limit",
      "feedUrl": "https://movingthelimit.com/feed/",
      "siteUrl": "https://movingthelimit.com/",
      "articles": [
        {
          "id": "https://movingthelimit.com/a-practical-way-to-detect-cargo-cult-thinking/",
          "author": null,
          "description": "Note: sharp readers on Hacker News pointed out that this article seems to talk more about unfalsifiable beliefs and cognitive dissonance than cargo-culting. To be clear, in this article, \"cargo cults\" are purely an illustrative tool to talk about the dangers of holding unfalsifiable beliefs. Thanks for helping me clarify!\nNobody describes it better than Richard Feynman:\nIn the South Seas there is a Cargo Cult of people.  During the war they saw airplanes land with lots of good materials, and they want the same thing to happen now.  So they’ve arranged to make things like runways, to put fires along the sides of the runways, to make a wooden hut for a man to sit in, with two wooden pieces on his head like headphones and bars of bamboo sticking out like antennas — he’s the controller — and t…",
          "link": "https://movingthelimit.com/a-practical-way-to-detect-cargo-cult-thinking/",
          "publishedOn": "2023-08-04T19:46:40.997Z",
          "wordCount": 1506,
          "title": "a practical way to detect cargo-cult thinking",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Lucas F. Costa",
      "feedUrl": "https://lucasfcosta.com/feed.xml",
      "siteUrl": "https://lucasfcosta.com/",
      "articles": [
        {
          "id": "https://lucasfcosta.com/2023/08/21/hn-launch.html",
          "author": null,
          "description": "When it comes to writing, the #1 question I usually get asked is how do I get so many HN front pages with this blog.\nThis week, Layerform got to the front page for the first time too, and I got asked that question another bunch of times.\n\n\nI decided to write this document explaining how to do it so I can send people a link now.\nAs a heads-up, there is only one hack: making something people want (to upvote).\nAlso, keep in mind this is all public information on how HackerNews works. There’s no magic here.\nMake your title direct and specific. Get straight to the point. Generic or vague titles do not perform well. Salesy titles perform even worse. Don’t worry about adding some technical detail. Explain what you do precisely.\n    \nGood example: Show HN: Layerform – Open-source development envir…",
          "link": "https://lucasfcosta.com/2023/08/21/hn-launch.html",
          "publishedOn": "2023-08-20T23:00:00.000Z",
          "wordCount": 779,
          "title": "How to do a successful Hacker News launch",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "taylor.town",
      "feedUrl": "https://taylor.town/feed.xml",
      "siteUrl": "https://taylor.town/feed.xml",
      "articles": [
        {
          "id": "https://taylor.town/carbon-nuggets",
          "author": null,
          "description": "Corn isotopes everywhere! Has science gone too far?",
          "link": "https://taylor.town/carbon-nuggets",
          "publishedOn": "2023-08-22T00:00:00.000Z",
          "wordCount": 366,
          "title": "56% of McNugget Carbon is Corn",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/coin-boys",
          "author": null,
          "description": "My crystal ball shattered in my twenties, but the coin offers faith to the faithless.",
          "link": "https://taylor.town/coin-boys",
          "publishedOn": "2023-08-21T00:00:00.000Z",
          "wordCount": 598,
          "title": "I'm a Coin Boy, Too",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/chatgpt-custom",
          "author": null,
          "description": "Emulate clear writers like Steinbeck, Hemingway, Orwell.",
          "link": "https://taylor.town/chatgpt-custom",
          "publishedOn": "2023-08-15T00:00:00.000Z",
          "wordCount": 233,
          "title": "How would you like ChatGPT to respond?",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/gpt-day-mate",
          "author": null,
          "description": "Please prioritize today's task list.",
          "link": "https://taylor.town/gpt-day-mate",
          "publishedOn": "2023-08-14T00:00:00.000Z",
          "wordCount": 133,
          "title": "gpt'day mate",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/listener",
          "author": null,
          "description": "Chloe has no stories of her own, and she doesn't need them.",
          "link": "https://taylor.town/listener",
          "publishedOn": "2023-08-11T00:00:00.000Z",
          "wordCount": 190,
          "title": "Chloe is a listener",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/friday-demos",
          "author": null,
          "description": "Add demos to a #demo-friday channel in Slack or Teams.",
          "link": "https://taylor.town/friday-demos",
          "publishedOn": "2023-08-06T00:00:00.000Z",
          "wordCount": 666,
          "title": "Share Demos Every Friday",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/entire-career",
          "author": null,
          "description": "Westbrook spent 35 years in a codebase that allegedly powers some sort of medical software somewhere. During his tenure, he contributed hundreds of lines of code to his projects.",
          "link": "https://taylor.town/entire-career",
          "publishedOn": "2023-08-02T00:00:00.000Z",
          "wordCount": 273,
          "title": "Man Spends Entire Career Mastering Crappy Codebase",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/medium",
          "author": null,
          "description": "Big things make life meaningful. Small things make life delightful.",
          "link": "https://taylor.town/medium",
          "publishedOn": "2023-08-01T00:00:00.000Z",
          "wordCount": 319,
          "title": "go big or go small or go home but don't go medium",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/town-hall-0013",
          "author": null,
          "description": "Your skull cannot be tented nor fumigated.",
          "link": "https://taylor.town/town-hall-0013",
          "publishedOn": "2023-07-31T00:00:00.000Z",
          "wordCount": 673,
          "title": "Town Hall #13: Pests",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/corporate-camouflage",
          "author": null,
          "description": "Stay at your company for a long time, not a good time.",
          "link": "https://taylor.town/corporate-camouflage",
          "publishedOn": "2023-07-28T00:00:00.000Z",
          "wordCount": 603,
          "title": "How to Coast with Corporate Camouflage",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/demonstrate-evergreen-proof",
          "author": null,
          "description": "Find something that matters and distill it into as few words as possible.",
          "link": "https://taylor.town/demonstrate-evergreen-proof",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 438,
          "title": "Demonstrate Evergreen Proof",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/do-unforgettable-work",
          "author": null,
          "description": "There are no shortcuts. Hand-written notes and flowers and donuts are cute but completely forgettable. Exceed common convention. Continually reinvent your reputation.",
          "link": "https://taylor.town/do-unforgettable-work",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 282,
          "title": "Do Unforgettable Work",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/dont-fight-customers",
          "author": null,
          "description": "Revenge is wasteful. Reputation is worth more than petty justice.",
          "link": "https://taylor.town/dont-fight-customers",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 584,
          "title": "Don't Fight Customers",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/find-your-value",
          "author": null,
          "description": "When a behavior is valuable, people call it a \"skill\".",
          "link": "https://taylor.town/find-your-value",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 355,
          "title": "Find Your Value",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/pick-your-price",
          "author": null,
          "description": "Most people live fewer than 25,000 days. What are your hours worth?",
          "link": "https://taylor.town/pick-your-price",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 426,
          "title": "How To Pick Your Price",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/ruck-kids",
          "author": null,
          "description": "Leave the stroller at home. Ruck with children. Climb up stairs! Reclaim your mobility! Take back your hands!",
          "link": "https://taylor.town/ruck-kids",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 405,
          "title": "Rucking with Children",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/select-your-service",
          "author": null,
          "description": "Plant giant flags in uncontested territories. Never squabble over tiny crowded plots.",
          "link": "https://taylor.town/select-your-service",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 397,
          "title": "Select Your Service",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/sell-your-service",
          "author": null,
          "description": "Given a fixed amount, you have one major knob to turn: risk.",
          "link": "https://taylor.town/sell-your-service",
          "publishedOn": "2023-07-25T00:00:00.000Z",
          "wordCount": 767,
          "title": "Sell Your Service",
          "imageUrl": null
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}