{
  "sources": [
    {
      "title": "tonsky.me",
      "feedUrl": "http://tonsky.me/blog/atom.xml",
      "siteUrl": "https://tonsky.me/",
      "articles": [
        {
          "id": "https://tonsky.me/talks/#2023-11-18",
          "author": null,
          "description": "Richard talks with Nikita Prokopov about some of the reasons he'd felt a sense of disenchantment with the direction of software in the past, and strategies he's developed for improving things in the future.",
          "link": "https://tonsky.me/talks/#2023-11-18",
          "publishedOn": "2023-11-18T00:00:00.000Z",
          "wordCount": 3085,
          "title": "Podcast: Escaping Software Disenchantment @ Software Unscripted",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Applied Go",
      "feedUrl": "https://appliedgo.net/index.xml",
      "siteUrl": "https://appliedgo.net/",
      "articles": []
    },
    {
      "title": "Dave Cheney",
      "feedUrl": "https://dave.cheney.net/feed/atom",
      "siteUrl": "https://dave.cheney.net",
      "articles": []
    },
    {
      "title": "David Heinemeier Hansson",
      "feedUrl": "https://world.hey.com/dhh/feed.atom",
      "siteUrl": "https://world.hey.com/dhh",
      "articles": [
        {
          "id": "https://world.hey.com/dhh/the-origin-of-ruby-on-rails-b3dab24e",
          "author": null,
          "description": "I can't thank Honeypot and Carolina Cabral enough for the producing The Rails Documentary that was just released today. Looking back on those early, formative years of Ruby on Rails with Tobi, Jamis, Jeremy, and Jason was actually kind of profound. I usually don't spend much time looking back, so for once to stop and marvel at how we got started twenty years ago was really special. A fitting tribute to two decades of working with Ruby on the web.\nTogether with 37signals, Rails has been my life's work. I've had the pleasure to collaborate with literally thousands of people on evolving the framework, and I've been humbled to see well over a million applications be built with it. Everything from tiny internal apps to $77 billion behemoths like Shopify.\nNow one of the reasons I don't spend too…",
          "link": "https://world.hey.com/dhh/the-origin-of-ruby-on-rails-b3dab24e",
          "publishedOn": "2023-11-10T00:01:49.000Z",
          "wordCount": 454,
          "title": "The origin of Ruby on Rails",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/that-model-s-plaid-9e3a6a5a",
          "author": null,
          "description": "I've owned a lot of great cars in my time. It's been one of the few places where hitting it big has allowed for something that wouldn't otherwise be possible. From Lamborghini to Pagani, Porsche to Ferrari, Aston Martin to Bentley, I have owned and loved them all. A+ use of lottery money, would do it again!\nIt's against all these delightful automotive experiences that I've been shocked at how utterly compelling the Tesla Model S Plaid has revealed itself to be. And in just a month's worth of ownership.\nThis is a car that now retails for $86,090 in the US. About the same as an Alfa Romeo Giulia Quadrifoglio or a BMW M3 with a couple of options. Expensive, premium cars, but far from the realm of the brands mentioned above. And yet, somehow, it's proven itself to be as special and as exotic a…",
          "link": "https://world.hey.com/dhh/that-model-s-plaid-9e3a6a5a",
          "publishedOn": "2023-10-31T22:29:13.000Z",
          "wordCount": 1074,
          "title": "That Model S Plaid",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/workfeed-goes-to-america-84b381d9",
          "author": null,
          "description": "During my three years in Denmark, I invested in five local startups. All on the premise that we'd work towards becoming profitable, remaining in the country, and avoiding the VC timebomb. The one that has already fulfilled all the objectives is Workfeed, and now they're ready to take on the American market. It's a proud moment!\nWorkfeed makes employee scheduling software. That might sound pretty boring, but if you run or work at a restaurant (or store or anywhere else in the service industry!) still trying to do things with Excel spreadsheets or call sheets, you know this can be a huge pain and time suck. That's exactly the kind of drudgery that software was meant to solve, and Workfeed does an amazing job at this.\nWhat I found interesting about employee scheduling software is how localize…",
          "link": "https://world.hey.com/dhh/workfeed-goes-to-america-84b381d9",
          "publishedOn": "2023-10-31T18:43:02.000Z",
          "wordCount": 510,
          "title": "Workfeed goes to America",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/negative-visualization-in-practice-60f11cb7",
          "author": null,
          "description": "The most counterintuitive of the Stoic mental exercises is that of negative visualization. Willfully imagining all manner of terrible things that might befall you, but haven't yet. Described like this, it sorta sounds like a fancy word of anxiety, but if you look closer, it's in fact its opposite.\nThe point of visualizing the consequences of an accident, the loss of a loved one, or the bankruptcy of your business is not to stew in despair, but to prepare yourself for the inevitability of hardship. Nobody makes it through life entirely on easy mode, and if you haven't done any manner of mental preparation, even small setbacks can seem calamitous. So you really ought to prepare.\nIn this way, negative visualization is like the dojo in The Matrix. It's a way to level up your skills inside a si…",
          "link": "https://world.hey.com/dhh/negative-visualization-in-practice-60f11cb7",
          "publishedOn": "2023-10-30T19:16:56.000Z",
          "wordCount": 659,
          "title": "Negative visualization in practice",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        },
        {
          "id": "https://world.hey.com/dhh/x-celebrates-60-savings-from-cloud-exit-7cc26895",
          "author": null,
          "description": "Musk has taken a cleaver to the costs and complexity at X. It hasn't always been pretty, but it sure has been effective, and in the process, he's proven his detractors wrong time and again. Not only has the site stayed up, despite hysteric proclamations that it would crater soon after his personnel changes, but X has been able to increase the pace of experimentation and feature introductions at the same time. It's been impressive to watch, regardless of what you think of the politics involved.\nNow I understand that for many it's indeed impossible to leave those politics aside. And however you're aligned, you'll find a chart to support your position that X is either thriving or has one foot in the grave. So let's not even get into that.\nInstead, let's focus on the fact that X has made #Clou…",
          "link": "https://world.hey.com/dhh/x-celebrates-60-savings-from-cloud-exit-7cc26895",
          "publishedOn": "2023-10-27T16:36:26.000Z",
          "wordCount": 496,
          "title": "X celebrates 60% savings from cloud exit",
          "imageUrl": "https://world.hey.com/dhh/avatar-df6405b0f7fafda980fd38b04c334bec936aef69"
        }
      ]
    },
    {
      "title": "Jason Fried",
      "feedUrl": "https://world.hey.com/jason/feed.atom",
      "siteUrl": "https://world.hey.com/jason",
      "articles": [
        {
          "id": "https://world.hey.com/jason/commodities-generics-and-software-393ccf10",
          "author": null,
          "description": "Once a product category proves popular, it's common for more companies to enter the market. Eventually, many options appear that are essentially mostly the same. Now we've got something that quacks like a commodity.\nOnce we've got a commodity, generics eventually follow. Devoid of fancy packaging, marketing, and advertising, prices fall while quality remains perfectly acceptable.\nBrand name products might be slightly better on some dimensions, but it ultimately becomes a value judgement. A few bucks difference? The confidence of buying a brand name still feels worth it. Many, many bucks different? Maybe not.\nThis happens in most industries. Maybe not in airplanes, but absolutely in peanut butter. And you know what's closer to peanut butter than airplanes? Software is.\nStrangely, many software categories have commoditized, but, given that nearly everything is a service these days, operational costs have remained universally high. This makes it hard for lower priced generics to creep in. This means people continue to pay luxury prices for software services that are essentially commodities. We think something's wrong with that. Sounds like an opportunity.\nThis is where ONCE comes in.\nOne facet of our initial strategy with ONCE is to find those commoditized pay-forever services everyone's running, and make our own radically simplified \"80/20\" versions as pay-once products. And this time you get to own for less, not rent for more. And you'll get the code, too.\nIn about a month we'll unveil the first ONCE product. Any guesses?\n\n-Jason",
          "link": "https://world.hey.com/jason/commodities-generics-and-software-393ccf10",
          "publishedOn": "2023-11-16T17:37:55.000Z",
          "wordCount": 311,
          "title": "Commodities, generics, and software",
          "imageUrl": "https://world.hey.com/jason/avatar-9f11ce77d31e68e834c564594ee0bc32a005ee8d"
        },
        {
          "id": "https://world.hey.com/jason/heard-something-read-something-saw-something-16-afce97da",
          "author": null,
          "description": "Hey there!\nHere’s the 16th installment of my popular Heard Something, Read Something, Saw Something series.\nSo, what do we have this time...\nHeard Something\nLately I've been enjoying listening to discussions about free will. Do we have it? If so, how much? Always? Sometimes? Never? Is it real or an illusion? I find the concept fascinating. One of my favorite recent conversations (debates?) about the topic was between Russ Roberts and Robert Sapolsky on Robert's EconTalk podcast. Listen in. \nHear it: https://www.econtalk.org/robert-sapolsky-on-determinism-free-will-and-responsibility/\nRead Something\nEvery once in a while you read something that swirls with someone’s body of work and undeniably signals they definitively know what the fuck they’re doing. This is that, by Jonathan Hoefler.\nRead it: https://typography.com/blog/text-for-proofing-fonts\nSaw Something\nDriving Dreams is a wonderful documentary on the golden age of Italian automotive design. Full of colorful characters, poetic stories, and the celebration of an art form — and approach — that's now long gone. Well worth the 52 minutes.\nSee it: https://www.amazon.com/Driving-Dreams-Gianluca-Migliarotti/dp/B07455DCH7/\nUntil next time.\nBTW, if you like these, and think someone else might too, please forward it on. They can subscribe to my newsletter right at the top at https://world.hey.com/jason. Thank you.\n\n-Jason",
          "link": "https://world.hey.com/jason/heard-something-read-something-saw-something-16-afce97da",
          "publishedOn": "2023-11-08T18:48:50.000Z",
          "wordCount": 266,
          "title": "Heard Something, Read Something, Saw Something [#16]",
          "imageUrl": "https://world.hey.com/jason/avatar-9f11ce77d31e68e834c564594ee0bc32a005ee8d"
        },
        {
          "id": "https://world.hey.com/jason/look-back-less-848e9db0",
          "author": null,
          "description": "I have a theory.\nOne of the reasons companies have a hard time moving forward is because they've tangled themselves in the near past. Eyes aimed backwards rather than ahead, staring at the dark, feet in their own concrete.\nThey've trapped themselves looking for certainty where there isn't any. Searching for actionable advice where there are only guesses.\nSomething sorta went wrong. A project didn't go as planned. Some launch didn't meet expectations. A number someone felt was in reach didn't get hit.\nSo they look back, scanning the ruins for something shiny. They gather people up and call for a search party. They launch into post-mortems and retrospectives.\nIt's a mistake most of the time. And a waste of time almost all of the time.\nLet's start with when it makes sense. If the process is h…",
          "link": "https://world.hey.com/jason/look-back-less-848e9db0",
          "publishedOn": "2023-11-03T00:12:53.000Z",
          "wordCount": 719,
          "title": "Look back less",
          "imageUrl": "https://world.hey.com/jason/avatar-9f11ce77d31e68e834c564594ee0bc32a005ee8d"
        },
        {
          "id": "https://world.hey.com/jason/an-influence-or-a-trap-3e09b8c3",
          "author": null,
          "description": "Watch this:\nhttps://www.youtube.com/watch?v=H9NruIjkGEw\nRoger Smith is a watchmaker, in the most traditional sense. He apprenticed under George Daniels, one of the best there ever was. And for the first few years, he made everything himself — just him, no one else. Even if you aren’t into watches, I bet you’ll be into Roger W. Smith after you watch the video.\nRoger’s workshop is on the Isle of Man — far away from the heart of the industry in Switzerland. In fact, he’s the only watchmaker on the Isle of Man, and one of very few in the UK.\nHe thinks being far away is a good thing. I love how he puts it:\n\n“The influences just aren’t around, and I can just get on with my days work and just make what I want to make.” -Roger W. Smith\n\nI love that notion — it’s one I’ve tried to hold dear myself. Don’t be influenced too much. Be aware of what’s great, but don’t get other people’s work too deep in your head or you’ll be doing their work, not yours. That kind of influence isn't really an influence, it's a trap.\nIt’s so easy to get sucked into other people’s work. Following industry news, attending every conference you can, picking brains. But I’ve often found it better to retreat into your own mind and bring something original. The more you see how other people do what they do, the harder it becomes to do things differently.\nSo pay attention a little, but not too much — leave more room for your own ideas than for theirs.\n\n-Jason",
          "link": "https://world.hey.com/jason/an-influence-or-a-trap-3e09b8c3",
          "publishedOn": "2023-10-23T16:28:27.000Z",
          "wordCount": 336,
          "title": "An influence or a trap?",
          "imageUrl": "https://world.hey.com/jason/avatar-9f11ce77d31e68e834c564594ee0bc32a005ee8d"
        }
      ]
    },
    {
      "title": "The Plain Text Project",
      "feedUrl": "https://plaintextproject.online/feed.xml",
      "siteUrl": "https://plaintextproject.online",
      "articles": []
    },
    {
      "title": "Andrew Kelley",
      "feedUrl": "https://andrewkelley.me/rss.xml",
      "siteUrl": "https://andrewkelley.me/",
      "articles": []
    },
    {
      "title": "Martin Fowler",
      "feedUrl": "https://martinfowler.com/feed.atom",
      "siteUrl": "https://martinfowler.com/feed.atom",
      "articles": [
        {
          "id": "https://martinfowler.com/articles/2023-liberal-arts.html",
          "author": null,
          "description": "My colleague Sannie Lee has met many students who are looking into\n     getting into technology, taking narrow professionally-oriented majors.\n     Sannie, however, has found that a traditional liberal-arts degree has given\n     her skills that are highly relevant to her work as a product manager.\nmore…",
          "link": "https://martinfowler.com/articles/2023-liberal-arts.html",
          "publishedOn": "2023-11-09T15:12:00.000Z",
          "wordCount": 1602,
          "title": "Three reasons a liberal arts degree helped me succeed in tech",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/headless-component.html#AdaptingToANewUiRequirement",
          "author": null,
          "description": "In the second (and final) part of his explanation of React Headless Components\n     Juntao Qiu explores how a headless component allows us to\n     create a visually different component that does the same base behavior, and\n     how it encourages better factoring as we extend base behavior further.\nmore…",
          "link": "https://martinfowler.com/articles/headless-component.html#AdaptingToANewUiRequirement",
          "publishedOn": "2023-11-07T15:00:00.000Z",
          "wordCount": 6282,
          "title": "Enhancing the Headless Component",
          "imageUrl": "https://martinfowler.com/articles/headless-component/headless-component.png"
        },
        {
          "id": "https://martinfowler.com/articles/2023-social-media.html",
          "author": null,
          "description": "It's now been a year since The Muskover, what does my use of social\n     media look like now, both as a reader and a writer?\nmore…",
          "link": "https://martinfowler.com/articles/2023-social-media.html",
          "publishedOn": "2023-11-02T16:33:00.000Z",
          "wordCount": 1442,
          "title": "Current thoughts on social media",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/headless-component.html",
          "author": null,
          "description": "As React UI controls become more sophisticated, complex logic can get\n     intertwined with the visual representation. This makes it hard to reason\n     about the behavior of the component, hard to test it, and necessary to\n     build similar components that need a different look. Juntao\n     Qiu tackles this by using a Headless Component, which\n     extracts all non-visual logic and state management, separating the brain of\n     a component from its looks.\nmore…",
          "link": "https://martinfowler.com/articles/headless-component.html",
          "publishedOn": "2023-11-01T14:34:00.000Z",
          "wordCount": 6282,
          "title": "Headless Component: a pattern for composing React UIs",
          "imageUrl": "https://martinfowler.com/articles/headless-component/headless-component.png"
        }
      ]
    },
    {
      "title": "Adam Wathan's Work Journal",
      "feedUrl": "https://adamwathan.me/journal/rss.xml",
      "siteUrl": "https://adamwathan.me/journal",
      "articles": []
    },
    {
      "title": "Rust Blog",
      "feedUrl": "https://blog.rust-lang.org/feed.xml",
      "siteUrl": "https://blog.rust-lang.org/",
      "articles": [
        {
          "id": "https://blog.rust-lang.org/2023/11/16/Rust-1.74.0.html",
          "author": null,
          "description": "The Rust team is happy to announce a new version of Rust, 1.74.0. Rust is a programming language empowering everyone to build reliable and efficient software.\nIf you have a previous version of Rust installed via rustup, you can get 1.74.0 with:\nrustup update stable\n\nIf you don't have it already, you can get rustup from the appropriate page on our website, and check out the detailed release notes for 1.74.0 on GitHub.\nIf you'd like to help us out by testing future releases, you might consider updating locally to use the beta channel (rustup default beta) or the nightly channel (rustup default nightly). Please report any bugs you might come across!\nWhat's in 1.74.0 stable\nLint configuration through Cargo\nAs proposed in RFC 3389,\nthe Cargo.toml manifest now supports a [lints] table to configu…",
          "link": "https://blog.rust-lang.org/2023/11/16/Rust-1.74.0.html",
          "publishedOn": "2023-11-16T00:00:00.000Z",
          "wordCount": 803,
          "title": "Announcing Rust 1.74.0",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/2023/11/09/parallel-rustc.html",
          "author": null,
          "description": "The Rust compiler's front-end can now use parallel execution to significantly\nreduce compile times. To try it, run the nightly compiler with the -Z threads=8 option. This feature is currently experimental, and we aim to ship\nit in the stable compiler in 2024.\nKeep reading to learn why a parallel front-end is needed and how it works, or\njust skip ahead to the How to use it\nsection.\nCompile times and parallelism\nRust compile times are a perennial concern. The Compiler Performance Working\nGroup\nhas continually improved compiler performance for several years. For example,\nin the first 10 months of 2023, there were mean reductions in compile time of\n13%,\nin peak memory use of\n15%,\nand in binary size of\n7%,\nas measured by our performance suite.\nHowever, at this point the compiler has been heavil…",
          "link": "https://blog.rust-lang.org/2023/11/09/parallel-rustc.html",
          "publishedOn": "2023-11-09T00:00:00.000Z",
          "wordCount": 1869,
          "title": "Faster compilation with the parallel front-end in nightly",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/2023/10/27/crates-io-non-canonical-downloads.html",
          "author": null,
          "description": "TL;DR\nWe want to improve the reliability and performance of crate downloads.\n\"Non-canonical downloads\" (that use URLs containing hyphens or underscores where the crate published uses the opposite) are blocking these plans.\nOn 2023-11-20 support for \"non-canonical downloads\" will be disabled.\ncargo users are unaffected.\nWhat are \"non-canonical downloads\"?\nThe \"non-canonical downloads\" feature allows everyone to download the serde_derive crate from https://crates.io/api/v1/crates/serde_derive/1.0.189/download, but also from https://crates.io/api/v1/crates/SERDE-derive/1.0.189/download, where the underscore was replaced with a hyphen (crates.io normalizes underscores and hyphens to be the same for uniqueness purposes, so it isn't possible to publish a crate named serde-derive because serde_de…",
          "link": "https://blog.rust-lang.org/2023/10/27/crates-io-non-canonical-downloads.html",
          "publishedOn": "2023-10-27T00:00:00.000Z",
          "wordCount": 694,
          "title": "crates.io: Dropping support for non-canonical downloads",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/2023/10/26/broken-badges-and-23k-keywords.html",
          "author": null,
          "description": "Around mid-October of 2023 the crates.io team was notified by one of our users that a shields.io badge for their crate stopped working. The issue reporter was kind enough to already debug the problem and figured out that the API request that shields.io sends to crates.io was most likely the problem. Here is a quote from the original issue:\nThis crate makes heavy use of feature flags which bloat the response payload of the API.\nApparently the API response for this specific crate had broken the 20 MB mark and shields.io wasn't particularly happy with this. Interestingly, this crate only had 9 versions published at this point in time. But how do you get to 20 MB with only 9 published versions?\nAs the quote above already mentions, this crate is using features… a lot of features… almost 23,000!…",
          "link": "https://blog.rust-lang.org/2023/10/26/broken-badges-and-23k-keywords.html",
          "publishedOn": "2023-10-26T00:00:00.000Z",
          "wordCount": 876,
          "title": "A tale of broken badges and 23,000 features",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        }
      ]
    },
    {
      "title": "Inside Rust Blog",
      "feedUrl": "https://blog.rust-lang.org/inside-rust/feed.xml",
      "siteUrl": "https://blog.rust-lang.org/inside-rust/",
      "articles": [
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/11/15/spec-vision.html",
          "author": null,
          "description": "A few months ago, by accepting RFC 3355, the decision was made to start working on an official specification for the Rust language. Eric (maintainer of the Rust Reference), Felix (Rust language team), Joel (Rust Foundation) and Mara (author of the RFC) have been working together to get this effort started.\nWith this blog post, we present the steps we have taken so far and our plans for approaching the rest of this big task.\nEditor\nOne of the first steps was to fill the role of \"editor\" as laid out in the RFC. The responsibility of coordination and editing of the specification is purposely delegated to the Rust Foundation, to ensure continuity of the work.\nAs part of the hiring effort for this role by the Foundation, we interviewed a few interested candidates with relevant experience. Becau…",
          "link": "https://blog.rust-lang.org/inside-rust/2023/11/15/spec-vision.html",
          "publishedOn": "2023-11-15T00:00:00.000Z",
          "wordCount": 2957,
          "title": "Our Vision for the Rust Specification",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/11/13/leadership-council-update.html",
          "author": null,
          "description": "Hello again from the Rust Leadership Council!\nWe wanted to share an update on what the Council has been working on since our last update.\nAccomplishments so far\nWe have elected new project directors!\nThrough the great work of the Project Director Election Process Committee,\nwe have defined a process for selecting Project Directors for the Rust Foundation Board of Directors.\nWe carried out the process, and recently announced the new directors.\nWe will be following up with a retrospective to identify what went well and what can be improved,\nand feed those improvements back into the process for next year.\nWe have established a new home for Project governance documentation at https://forge.rust-lang.org/governance/index.html.\nAs changes to the governance policies are accepted via the RFC proce…",
          "link": "https://blog.rust-lang.org/inside-rust/2023/11/13/leadership-council-update.html",
          "publishedOn": "2023-11-13T00:00:00.000Z",
          "wordCount": 589,
          "title": "November 2023 Leadership Council Update",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/11/13/1.74.0-prerelease.html",
          "author": null,
          "description": "The 1.74.0 pre-release is ready for testing. The release is scheduled for\nNovember 16. Release notes can be found here.\nYou can try it out locally by running:\nRUSTUP_DIST_SERVER=https://dev-static.rust-lang.org rustup update stable\n\nThe index is https://dev-static.rust-lang.org/dist/2023-11-13/index.html.\nYou can leave feedback on the internals thread.\nThe release team is also thinking about changes to our pre-release process:\nwe'd love your feedback on this GitHub issue.",
          "link": "https://blog.rust-lang.org/inside-rust/2023/11/13/1.74.0-prerelease.html",
          "publishedOn": "2023-11-13T00:00:00.000Z",
          "wordCount": 139,
          "title": "1.74.0 pre-release testing",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        },
        {
          "id": "https://blog.rust-lang.org/inside-rust/2023/10/23/coroutines.html",
          "author": null,
          "description": "We have renamed the unstable Generator trait to Coroutine and adjusted all terminology accordingly.\nIf you want to see all 3800 modified lines of code, you can find the PR here.\nOur Generator trait was effectively a coroutine already, so this change was long overdue.\nAll nightly users using the Generator trait must now update their code to refer to the new feature gate and trait names.\nWhat is the difference?\nA generator is just a convenient way to write Iterator implementations.\nThis means it's a coroutine that has no arguments and no return type.\nInstead when it returns, that means iteration is over, and the Iterator::next method returns None.\nComing full circle\nThis change is directly motivated for reintroducing generators, this time with simpler (async/await style)\nsyntax for creating Iterators. Some discussion about this can be found in the gen fn rfc.\nOf course such a massive change would be incomplete without the PR to immediately reintroduce a new concept with the name that was just removed,\nso here you can see the MVP for gen blocks that has very weird diagnostics and may panic on you if you poke it too much.",
          "link": "https://blog.rust-lang.org/inside-rust/2023/10/23/coroutines.html",
          "publishedOn": "2023-10-23T00:00:00.000Z",
          "wordCount": 274,
          "title": "Generators are dead, long live coroutines, generators are back",
          "imageUrl": "https://www.rust-lang.org/static/images/rust-social-wide.jpg"
        }
      ]
    },
    {
      "title": "Jorge Manrubia",
      "feedUrl": "https://world.hey.com/jorge/feed.atom",
      "siteUrl": "https://world.hey.com/jorge",
      "articles": [
        {
          "id": "https://world.hey.com/jorge/towards-smoother-page-updates-in-turbo-5f670db9",
          "author": null,
          "description": "I recently published two articles in the 37signals dev blog related to how we will improve page updates in Turbo 8.\n\n\nA happier happy path in Turbo with morphing. What we will do.\nExploring server-side diffing in Turbo. An investigation of an alternative approach to fulfill the same vision.\n\nI hope you like them!",
          "link": "https://world.hey.com/jorge/towards-smoother-page-updates-in-turbo-5f670db9",
          "publishedOn": "2023-10-25T07:48:12.000Z",
          "wordCount": 107,
          "title": "Towards smoother page updates in Turbo",
          "imageUrl": "https://world.hey.com/jorge/avatar-d08cb3ee63ecbd49736f76ee2caffa4c99a1c0fd"
        }
      ]
    },
    {
      "title": "Notes on software development",
      "feedUrl": "https://notes.eatonphil.com/rss.xml",
      "siteUrl": "http://notes.eatonphil.com/",
      "articles": [
        {
          "id": "http://notes.eatonphil.com/2023-11-19-exploring-a-postgres-query-plan.html",
          "author": null,
          "description": "I learned this week that you can intercept and redirect Postgres query\nexecution. You can hook into the execution layer so you're given a\nquery plan and you get to decide what to do with it. What rows to\nreturn, if any, and where they come from.\nThat's very interesting. So I started writing code to explore execution\nhooks. However, I got stuck interpreting the query plan. Either\nthere's no query plan walking infrastructure or I just didn't find it.\nSo this post is a digression into walking a Postgres query plan. By\nthe end we'll be able to run psql -c 'SELECT a FROM x WHERE a > 1'\nand reconstruct the entire SQL string from a Postgres\nQueryDesc\nobject, the query plan object Postgres builds.\nWith that query plan walking infrastructure in place, we'll be in a\ngood state to not just print out …",
          "link": "http://notes.eatonphil.com/2023-11-19-exploring-a-postgres-query-plan.html",
          "publishedOn": "2023-11-19T00:00:00.000Z",
          "wordCount": 7917,
          "title": "Exploring a Postgres query plan",
          "imageUrl": null
        },
        {
          "id": "http://notes.eatonphil.com/2023-11-01-postgres-table-access-methods.html",
          "author": null,
          "description": "With Postgres 12,\nreleased in 2019, it became possible to swap out Postgres's storage\nengine.\nThis is a feature MySQL has supported for a long time. There are at\nleast 8 different built-in\nengines you can pick from. MyRocks, MySQL on\nRocksDB, is another popular third-party distribution.\nI assume there will be a renaissance of Postgres storage engines. To\ndate, the efforts are\nnascent. OrioleDB and Citus\nColumnar\nare two promising third-party table access methods being actively\ndeveloped.\nWhy alternative storage engines?\nThe ability to swap storage engines is useful because different\nworkloads sometimes benefit from different storage\napproaches. Analytics workloads and columnar storage layouts go well\ntogether. Write-heavy\nworkloads and LSM trees go well\ntogether. And\nsome people like in-me…",
          "link": "http://notes.eatonphil.com/2023-11-01-postgres-table-access-methods.html",
          "publishedOn": "2023-11-01T00:00:00.000Z",
          "wordCount": 7455,
          "title": "Writing a storage engine for Postgres: an in-memory Table Access Method",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "CoRecursive: Coding Stories",
      "feedUrl": "https://corecursive.libsyn.com/feed",
      "siteUrl": "http://corecursive.com",
      "articles": [
        {
          "id": "15f92fb8-0b9c-4ea0-8199-2afdb4a8225f",
          "author": null,
          "description": "How did Spotify scale from 10 engineers to 100s to 1000s ...without slowing down? Without becoming corporate? \n Facing an IPO deadline, Pia Nilsson worked with 300 teams to transform how Spotify built software. She spearheaded a movement that led them from working in silos to a unified developer platform. \n Hear the inside story of how Spotify's Platform teams embraced transparency and customer focus to create Backstage — now used by companies worldwide. \n It's an amazing tale of ingenuity and perseverance. Hear Spotify's secret to scaling engineering without losing speed and independence. Don't miss it!\n  \nEpisode Page\n Support The Show\n Subscribe To The Podcast\n Join The Newsletter",
          "link": "https://corecursive.com/platform-takes-the-pain/",
          "publishedOn": "2023-11-02T10:00:00.000Z",
          "wordCount": null,
          "title": "Story: Platform Takes The Pain",
          "itunes": {
            "duration": "48:36"
          },
          "enclosure": {
            "length": "71134151",
            "type": "audio/mpeg",
            "url": "https://chtbl.com/track/7D91G/traffic.libsyn.com/secure/corecursive/094_-_Backstage2.mp3?dest-id=628353"
          },
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Notes on software development",
      "feedUrl": "https://notes.eatonphil.com/rss.xml",
      "siteUrl": "http://notes.eatonphil.com/",
      "articles": [
        {
          "id": "http://notes.eatonphil.com/2023-11-19-exploring-a-postgres-query-plan.html",
          "author": null,
          "description": "I learned this week that you can intercept and redirect Postgres query\nexecution. You can hook into the execution layer so you're given a\nquery plan and you get to decide what to do with it. What rows to\nreturn, if any, and where they come from.\nThat's very interesting. So I started writing code to explore execution\nhooks. However, I got stuck interpreting the query plan. Either\nthere's no query plan walking infrastructure or I just didn't find it.\nSo this post is a digression into walking a Postgres query plan. By\nthe end we'll be able to run psql -c 'SELECT a FROM x WHERE a > 1'\nand reconstruct the entire SQL string from a Postgres\nQueryDesc\nobject, the query plan object Postgres builds.\nWith that query plan walking infrastructure in place, we'll be in a\ngood state to not just print out …",
          "link": "http://notes.eatonphil.com/2023-11-19-exploring-a-postgres-query-plan.html",
          "publishedOn": "2023-11-19T00:00:00.000Z",
          "wordCount": 7917,
          "title": "Exploring a Postgres query plan",
          "imageUrl": null
        },
        {
          "id": "http://notes.eatonphil.com/2023-11-01-postgres-table-access-methods.html",
          "author": null,
          "description": "With Postgres 12,\nreleased in 2019, it became possible to swap out Postgres's storage\nengine.\nThis is a feature MySQL has supported for a long time. There are at\nleast 8 different built-in\nengines you can pick from. MyRocks, MySQL on\nRocksDB, is another popular third-party distribution.\nI assume there will be a renaissance of Postgres storage engines. To\ndate, the efforts are\nnascent. OrioleDB and Citus\nColumnar\nare two promising third-party table access methods being actively\ndeveloped.\nWhy alternative storage engines?\nThe ability to swap storage engines is useful because different\nworkloads sometimes benefit from different storage\napproaches. Analytics workloads and columnar storage layouts go well\ntogether. Write-heavy\nworkloads and LSM trees go well\ntogether. And\nsome people like in-me…",
          "link": "http://notes.eatonphil.com/2023-11-01-postgres-table-access-methods.html",
          "publishedOn": "2023-11-01T00:00:00.000Z",
          "wordCount": 7455,
          "title": "Writing a storage engine for Postgres: an in-memory Table Access Method",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Dmitri Pavlutin Blog",
      "feedUrl": "https://dmitripavlutin.com/rss.xml",
      "siteUrl": "https://dmitripavlutin.com",
      "articles": []
    },
    {
      "title": "Dietcode | Sid's blog",
      "feedUrl": "https://dietcode.io/rss",
      "siteUrl": "https://dietcode.io/",
      "articles": []
    },
    {
      "title": "Infrequently Noted",
      "feedUrl": "https://infrequently.org/feed/",
      "siteUrl": "https://infrequently.org/feed/feed.xml",
      "articles": []
    },
    {
      "title": "Moving the Limit",
      "feedUrl": "https://movingthelimit.com/feed/",
      "siteUrl": "https://movingthelimit.com/",
      "articles": []
    },
    {
      "title": "Lucas F. Costa",
      "feedUrl": "https://lucasfcosta.com/feed.xml",
      "siteUrl": "https://lucasfcosta.com/",
      "articles": []
    },
    {
      "title": "taylor.town",
      "feedUrl": "https://taylor.town/feed.xml",
      "siteUrl": "https://taylor.town/feed.xml",
      "articles": [
        {
          "id": "https://taylor.town/knuth-airgap",
          "author": null,
          "description": "Knuth knows how to maintain information hygeine.",
          "link": "https://taylor.town/knuth-airgap",
          "publishedOn": "2023-11-19T00:00:00.000Z",
          "wordCount": 462,
          "title": "Knuth Airgaps & Knuth Buffers",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/pseudoprose",
          "author": null,
          "description": "Pseudoprose is pseudocode for writers.",
          "link": "https://taylor.town/pseudoprose",
          "publishedOn": "2023-11-14T00:00:00.000Z",
          "wordCount": 865,
          "title": "Pseudoprose",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/town-hall-0015",
          "author": null,
          "description": "101,721 words of cryptic nonsense.",
          "link": "https://taylor.town/town-hall-0015",
          "publishedOn": "2023-11-12T00:00:00.000Z",
          "wordCount": 1056,
          "title": "Town Hall #15: Artifacts",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/what-is-the-author-trying-to-do",
          "author": null,
          "description": "Rather than saying \"bad movie lol\",\nBig Joel deconstructs The Room\nand asks the difficult question: what are authors even trying to do?\n  \n\npeople sometimes make stuff for reasons.\nCan they understand the cat in Stewart Little?  \nauthorial intent in Grown Ups 2.  \nOveranalyze Avatar: The Last Airbender.  \na 2-hour documentary about a video game we've never heard of?  \nleitmotif in Lord of the Rings.  \nBecome a film conspiracy theorist.  \nterrible writing.  \nidiot plots.  \nIs 300 facist?  \nMeet the Robinsons was underrated.  \ninivisible choices in video games.  \nholes that were made for you.  \nSkin Theory in Spongebob Squarepants.  \ntemporal pincer maneuver.  \nSoulja Boy provides his thoughts on Braid.  \nvisual comedy.  \nludditism and neophilia in Jurassic Park.",
          "link": "https://taylor.town/what-is-the-author-trying-to-do",
          "publishedOn": "2023-11-05T00:00:00.000Z",
          "wordCount": 263,
          "title": "what are authors even trying to do?",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/woman-month",
          "author": null,
          "description": "I have 22 children at the age of 26 and most of them were born in the space of a year.",
          "link": "https://taylor.town/woman-month",
          "publishedOn": "2023-11-05T00:00:00.000Z",
          "wordCount": 94,
          "title": "Russian Woman Achieves 9x \"Mythical\" Man Month",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/code-collocates",
          "author": null,
          "description": "Replacing collocates with simpler substitutes is intuitively called \"compression\".",
          "link": "https://taylor.town/code-collocates",
          "publishedOn": "2023-11-03T00:00:00.000Z",
          "wordCount": 425,
          "title": "Compressing Codebase Collocates",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/digital-desire-paths",
          "author": null,
          "description": "Good architects anticipate nature. They don't blame water for dripping. They don't blame people for peopling.",
          "link": "https://taylor.town/digital-desire-paths",
          "publishedOn": "2023-11-03T00:00:00.000Z",
          "wordCount": 271,
          "title": "Digital Desire Paths",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/chatgpt-opt-out",
          "author": null,
          "description": "OpenAI provides a Google Form for opting out of data collection on ChatGPT.",
          "link": "https://taylor.town/chatgpt-opt-out",
          "publishedOn": "2023-11-02T00:00:00.000Z",
          "wordCount": 275,
          "title": "How to opt-out of ChatGPT training without clearing conversation history",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/talk-like-a-therapist",
          "author": null,
          "description": "They speak fearlessly but fairly. They're strong, yet nonthreatening. They push back while maintaining peace. I yearn for this powerless power.",
          "link": "https://taylor.town/talk-like-a-therapist",
          "publishedOn": "2023-11-01T00:00:00.000Z",
          "wordCount": 359,
          "title": "if it talks like a therapist...",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/how-i-do-things-cf",
          "author": null,
          "description": "I feel like a battery that can't keep its charge.",
          "link": "https://taylor.town/how-i-do-things-cf",
          "publishedOn": "2023-10-31T00:00:00.000Z",
          "wordCount": 582,
          "title": "How I Do Things: Chronic Fatigue Edition",
          "imageUrl": null
        },
        {
          "id": "https://taylor.town/infinite-queues",
          "author": null,
          "description": "Strategy is the best weapon you wield against the infinite. Bad algorithms invite anxiety, overwhelmedness, and frustration. Good algorithms create pride, peace, and accomplishment.",
          "link": "https://taylor.town/infinite-queues",
          "publishedOn": "2023-10-30T00:00:00.000Z",
          "wordCount": 442,
          "title": "Taming Your Infinite Queues",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Slashdot",
      "feedUrl": "https://rss.slashdot.org/Slashdot/slashdotMain",
      "siteUrl": "https://slashdot.org/",
      "articles": [
        {
          "id": "https://games.slashdot.org/story/23/11/20/0039203/text-adventures-are-still-thriving-in-interactive-fiction-competition---and-on-threads?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "Today saw the end of IFComp.org's 29th annual text adventure competition (now administered by the charitable non-profit IF Technology Foundation). 74 new and original text adventures\n competed for a share of the $7,523 prize pool, with the winners announced in a special online ceremony on Twitch this afternoon. \n\nAfter all the votes were tabulated, the winning game was Dr Ludwig and the Devil, a 90-minute epic in which an esteemed mad scientist tries to double-cross Beelzebub himself — along with \"the world's least effective torch and pitchfork-wielding mob!\" Coming in second was LAKE Adventure. (Its premise? That it's a 13-year-old's 1993 game being revisited by its author 28 years later — complete with some gloriously retro artwork.) And finishing third was The Little Match Girl 4 (described as \"a touching epic time travel fairy tale by Hans Christian Andersen.) \n\nBut also this week, the owner of the web site 80sNostalgia.com has created a text adventure using nothing but inter-linked posts on Threads. \n\"Think you can get under The Bridge?\" its first post challenges. \"Test your gaming skills with this Threads exclusive text-based game! \n\"And then try to get your head around got much work it took to make it...\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://games.slashdot.org/story/23/11/20/0039203/text-adventures-are-still-thriving-in-interactive-fiction-competition---and-on-threads?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-20T00:41:00.000Z",
          "wordCount": 3915,
          "title": "Text Adventures are Still Thriving in Interactive Fiction Competition - and On Threads",
          "imageUrl": "https://a.fsdn.com/sd/topics/rpg_64.png"
        },
        {
          "id": "https://science.slashdot.org/story/23/11/19/2053244/a-viral-post-on-social-media-will-clear-the-medical-debt-of-strangers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "\"To celebrate my life, I've arranged to buy up others' medical debt and then destroy the debt,\" reads a posthumous tweet posted Tuesday after the death of 38-year-old Casey McIntyre. \n\nThe Washington Post explains...\n\n\nMcIntyre, who served as publisher at Razorbill, an imprint of Penguin Random House, was diagnosed in 2019 and proceeded through treatment without taking on debt, [husband Andrew Rose] Gregory told The Washington Post. But many fellow cancer patients she met were in more precarious financial positions, Gregory added. \"We were both so keenly aware that Casey had great health insurance through Penguin Random House,\" said Gregory, 41. \"Casey had no medical debt....\" \n\nAbout nine months before McIntyre died, her husband came across a video online about members of a North Carolina…",
          "link": "https://science.slashdot.org/story/23/11/19/2053244/a-viral-post-on-social-media-will-clear-the-medical-debt-of-strangers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-19T22:34:00.000Z",
          "wordCount": 8281,
          "title": "A Viral Post on Social Media Will Clear the Medical Debt of Strangers",
          "imageUrl": "https://a.fsdn.com/sd/topics/medicine_64.png?refresh=now"
        },
        {
          "id": "https://it.slashdot.org/story/23/11/19/2034218/microsoft-celebrates-20th-anniversary-of-patch-tuesday?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "This week the Microsoft Security Response Center celebrated the 20th anniversary of Patch Tuesday updates. \n\nIn a blog post they call the updates \"an initiative that has become a cornerstone of the IT world's approach to cybersecurity.\"\nOriginating from the Trustworthy Computing memo by Bill Gates in 2002, our unwavering commitment to protecting customers continues to this day and is reflected in Microsoft's Secure Future Initiative announced this month. Each month, we deliver security updates on the second Tuesday, underscoring our pledge to cyber defense. As we commemorate this milestone, it's worth exploring the inception of Patch Tuesday and its evolution through the years, demonstrating our adaptability to new technology and emerging cyber threats... \n\nBefore this unified approach, ou…",
          "link": "https://it.slashdot.org/story/23/11/19/2034218/microsoft-celebrates-20th-anniversary-of-patch-tuesday?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-19T21:34:00.000Z",
          "wordCount": 4521,
          "title": "Microsoft Celebrates 20th Anniversary of 'Patch Tuesday'",
          "imageUrl": "https://a.fsdn.com/sd/topics/microsoft_64100.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/19/204228/amazon-announces-olympus-llm-to-compete-with-openai-and-google?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "Amazon \"is investing millions in training an ambitious large language model,\" reports Reuters, \"hoping it could rival top models from OpenAI and Alphabet, two people familiar with the matter told Reuters.\"\n\nThe model, codenamed as \"Olympus\", has 2 trillion parameters, the people said, which could make it one of the largest models being trained. OpenAI's GPT-4 model, one of the best models available, is reported to have one trillion parameters... \n\nThe team is spearheaded by Rohit Prasad, former head of Alexa, who now reports directly to CEO Andy Jass... Amazon believes having homegrown models could make its offerings more attractive on AWS, where enterprise clients want to access top-performing models, the people familiar with the matter said, adding there is no specific timeline for relea…",
          "link": "https://slashdot.org/story/23/11/19/204228/amazon-announces-olympus-llm-to-compete-with-openai-and-google?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-19T20:34:00.000Z",
          "wordCount": 4930,
          "title": "Amazon Announces 'Olympus' LLM to Compete With OpenAI and Google",
          "imageUrl": "https://a.fsdn.com/sd/topics/ai_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/11/19/1920250/linux-foundation-announces-intent-to-form-high-performance-software-foundation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "This week the Linux Foundation \"announced the intention to form the High Performance Software Foundation. \n\n\"Through a series of technical projects, the High Performance Software Foundation aims to build, promote, and advance a portable software stack for high performance computing by increasing adoption, lowering barriers to contribution, and supporting development efforts.\"\n\nAs use of high performance computing becomes ubiquitous in scientific computing and digital engineering, and AI use cases multiply, more and more data centers deploy GPUs and other compute accelerators. The High Performance Software Foundation intends to leverage investments made by the United States Department of Energy's Exascale Computing Project, the EuroHPC Joint Undertaking, and other international projects in …",
          "link": "https://tech.slashdot.org/story/23/11/19/1920250/linux-foundation-announces-intent-to-form-high-performance-software-foundation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-19T19:34:00.000Z",
          "wordCount": 4277,
          "title": "Linux Foundation Announces Intent to Form 'High Performance Software Foundation'",
          "imageUrl": "https://a.fsdn.com/sd/topics/supercomputing_64.png"
        },
        {
          "id": "https://news.slashdot.org/story/23/11/19/1826218/the-fsf-condemns-unauthorized-derivatives-of-gnu-licenses?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "The Free Sofware Foundation issued a clarifying blog post this week, saying the organization is \"pleased when people use GNU licenses to distribute and license software.\" \n\n\nBut \"we condemn the use of unauthorized, confusing derivatives of the licenses.\"\nUnfortunately, some authors engage in confusing practices by drafting licenses using existing terms and conditions of GNU free software licenses, without the intention of granting all four freedoms to users. For example, we have long seen attempts to add restrictions to the license text itself, placed in the LICENSE file, or included elsewhere in the program's release. An example is the so-called \"Commons Clause,\" which, when applied to a free software license, affirms that the program is covered by the license. But, at the same time, is c…",
          "link": "https://news.slashdot.org/story/23/11/19/1826218/the-fsf-condemns-unauthorized-derivatives-of-gnu-licenses?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-19T18:34:00.000Z",
          "wordCount": 5523,
          "title": "The FSF Condemns Unauthorized Derivatives of GNU Licenses",
          "imageUrl": "https://a.fsdn.com/sd/topics/gnu_64.png"
        },
        {
          "id": "https://idle.slashdot.org/story/23/11/19/0426209/1993s-second-reality-demo-recreated-for-the-apple-ii?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "Long-time Slashdot reader deater writes: The Second Reality demoscene demo from 1993 is one of the most well known demos of all time, pushing a 486 running DOS to its limits. There have been remakes for other architectures over the years, including Atari ST, Gameboy color, and Commodore 64. At this past Demosplash 2023 demoparty a version for the Apple II was released (and won 1st place), which was quite a challenge as the Apple II graphics have essentially none of the hardware acceleration available on the other platforms.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://idle.slashdot.org/story/23/11/19/0426209/1993s-second-reality-demo-recreated-for-the-apple-ii?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-19T17:34:00.000Z",
          "wordCount": 5586,
          "title": "1993's 'Second Reality' Demo Recreated for the Apple II",
          "imageUrl": "https://a.fsdn.com/sd/topics/idle_64.png"
        },
        {
          "id": "https://science.slashdot.org/story/23/11/18/2225219/archaeologists-unearth-a-secret-lost-language-from-3000-years-ago?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "\"And no, it's not COBOL,\" jokes long-time Slashdot reader schwit1, sharing this report from ScienceAlert:\n\n\nA secret text has been discovered in Türkiye, scattered among tens of thousands of ancient clay tablets, which were written in the time of the Hittite Empire during the second millennium BCE. No one yet knows what the curious cuneiform script says, but it seems to be a long-lost language from more than 3,000 years ago. \n\nExperts say the mysterious idiom is unlike any other ancient written language found in the Middle East, although it seems to share roots with other Anatolian-Indo-European languages. The sneaky scrawlings start at the end of a cultic ritual text written in Hittite — the oldest known Indo-European tongue — after an introduction that essentially translates to: \"From now on, read in the language of the country of Kalasma\"...\n\nCurrently, there are no available photos of the newly discovered tablet with Kalamaic writings, as experts are still working out how to translate it. Schwemer and his colleagues hope to publish their results along with images of their discovery sometime next year.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://science.slashdot.org/story/23/11/18/2225219/archaeologists-unearth-a-secret-lost-language-from-3000-years-ago?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-19T16:34:00.000Z",
          "wordCount": 9149,
          "title": "Archaeologists Unearth a Secret Lost Language From 3,000 Years Ago",
          "imageUrl": "https://a.fsdn.com/sd/topics/science_64.png"
        },
        {
          "id": "https://developers.slashdot.org/story/23/11/18/2128233/how-mojo-hopes-to-revamp-python-for-an-ai-world?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "Python \"come with downsides,\" argues a new article in Communications of the ACM. \"Its programs tend to run slowly, and because it is inefficient at running processes in parallel, it is not well suited to some of the latest AI programming.\" \n\n\n\"Hoping to overcome those difficulties, computer scientist Chris Lattner set out to create a new language, Mojo, which offers the ease of use of Python, but the performance of more complex languages such as C++ or Rust.\" Lattner tells the site \"we don't want to break Python, we want to make Python better,\" while software architect Doug Meil says Mojo is essentially \"Python for AI... and it's going to be way faster in scale across multiple hardware platforms.\"\n\n\nLattner teamed up with Tim Davis, whom he had met when they both worked for Google, to form…",
          "link": "https://developers.slashdot.org/story/23/11/18/2128233/how-mojo-hopes-to-revamp-python-for-an-ai-world?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-19T15:34:00.000Z",
          "wordCount": 5705,
          "title": "How Mojo Hopes to Revamp Python for an AI World",
          "imageUrl": "https://a.fsdn.com/sd/topics/python_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/11/18/039221/raspberry-pi-os-elementary-os-will-default-to-wayland?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "Recently the Register pointed out that the new (Debian-based) Raspberry Pi OS 5.0 has \"a completely new Wayland desktop environment replacing PIXEL, the older desktop based on LXDE and X.org, augmented with Mutter in its previous release.\" \n\nAnd when elementary OS 8 finally arrives, \"the development team plans to finally shift to the Wayland display server by default,\" reports Linux magazine (adding \"If you'd like to get early access to daily builds, you can do so by becoming an elementary OS sponsor on GitHub.\") \n\n\"This is a transition that we have been planning and working towards for several years,\" writes CEO/co-founder Danielle Foré, \"and we're finally in the home stretch... Wayland will bring us improved performance, better app security, and opens the doors to support more complex display setups like mixed DPI multi-monitor setups.\"\nThere are other things that we're experimenting with, like the possibility of an immutable OS, and there are more mundane things that will certainly happen like shipping Pipewire. You'll also see on the project board that we're looking to replace the onscreen keyboard and it's time to re-evaluate some things like SystemD Boot. You can expect lots more little features to be detailed over the coming months. \n\nMeanwhile, Linux Mint is getting \"experimental\" Wayland support next month. And also in December, Firefox will let Wayland support be enabled by default. \n\nAnd last month the Register noted a merge request for GNOME to remove the gnome-xorg.desktop file. \"To put this in context, the Fedora project is considering a comparable change: removing or hiding the GNOME on X.org session from the login menu, which is already the plan for the Fedora KDE spin when it moves to KDE version 6, which is still in development.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://tech.slashdot.org/story/23/11/18/039221/raspberry-pi-os-elementary-os-will-default-to-wayland?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-19T12:34:00.000Z",
          "wordCount": 9720,
          "title": "Raspberry Pi OS, elementary OS Will Default to Wayland",
          "imageUrl": "https://a.fsdn.com/sd/topics/gui_64.png"
        },
        {
          "id": "https://hardware.slashdot.org/story/23/11/19/0229237/could-ai-and-tech-advancements-bring-a-new-era-of-evolution?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "A professor of religion at Columbia University writes, \"I do not think human beings are the last stage in the evolutionary process.\"\n\nWhatever comes next will be neither simply organic nor simply machinic but will be the result of the increasingly symbiotic relationship between human beings and technology. Bound together as parasite/host, neither people nor technologies can exist apart from the other because they are constitutive prostheses of each other... So-called \"artificial\" intelligence is the latest extension of the emergent process through which life takes ever more diverse and complex forms. \n\nThe article lists \"four trajectories that will be increasingly important for the symbiotic relationship between humans and machines.\" \n\n- Writing about neuroprosthetics, the professor argues…",
          "link": "https://hardware.slashdot.org/story/23/11/19/0229237/could-ai-and-tech-advancements-bring-a-new-era-of-evolution?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-19T08:34:00.000Z",
          "wordCount": 10533,
          "title": "Could AI and Tech Advancements Bring a New Era of Evolution?",
          "imageUrl": "https://a.fsdn.com/sd/topics/robot_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/11/19/0320207/in-worlds-largest-disinformation-campaign-online-china-is-harassing-americans?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "\"The Chinese government has built up the world's largest known online disinformation operation,\" reports CNN, \"and is using it to harass US residents, politicians, and businesses.\" \n\nCNN reports that disinformation operation is even \"at times threatening its targets with violence, a CNN review of court documents and public disclosures by social media companies has found.\"\n\nThe onslaught of attacks — often of a vile and deeply personal nature — is part of a well-organized, increasingly brazen Chinese government intimidation campaign targeting people in the United States, documents show. The U.S. State Department says the tactics are part of a broader multi-billion-dollar effort to shape the world's information environment and silence critics of Beijing that has expanded under President Xi J…",
          "link": "https://tech.slashdot.org/story/23/11/19/0320207/in-worlds-largest-disinformation-campaign-online-china-is-harassing-americans?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-19T04:58:00.000Z",
          "wordCount": 13581,
          "title": "In World's Largest Disinformation Campaign Online, China Is Harassing Americans",
          "imageUrl": "https://a.fsdn.com/sd/topics/china_64.png"
        },
        {
          "id": "https://developers.slashdot.org/story/23/11/18/0227230/kotlin-keeps-climbing-tiobes-programming-language-popularity-index?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "An anonymous reader shared this report from InfoWorld:\n\nJetBrains' Kotlin language, a Java rival endorsed by Google for Android mobile development, continues to scale up Tiobe's index of language popularity, reaching the 15th spot in the November 2023 rankings... \n\nSoftware quality services company Tiobe cites Kotlin advantages including interoperability with Java and unrivaled Android accommodations as reasons for the language's rise. Kotlin, Tiobe CEO Paul Jansen said, also fits in with a modern programming culture of expressive languages that have a strong type system and avoid null pointer exceptions by design. \"Based on my experience, I am pretty sure Kotlin can reach a top 10 position,\" Jansen said. It remains to be seen if it can ever scale as high as a top four slot, he added... \nIn the rival Pypl Popularity of Programming languages index this month, Kotlin was ranked 13th with a 1.76% share, having slipped slightly year-over-year. \n\nKotlin's rank on the TIOBE index rose three positions in the last month — after rising two positions the month before. TIOBE's CEO says the language has now achieved its highest ranking ever on the index, surpassing 2017's \"first wave of Kotlin popularity...when Google announced first class support for Kotlin on Android.\" \nRust now ranks #20 on the index, behind Delphi/Object Pascal, Swift, Ruby, and R. \n\nHere's TIOBE November rankings for top-20 most popular programming languages:\n\nPythonCC++JavaC#JavaScriptPHPVisual BasicSQLAssembly LanguageScratchFortranGoMATLABKotlinDelphi/Object PascalSwiftRubyRRust\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://developers.slashdot.org/story/23/11/18/0227230/kotlin-keeps-climbing-tiobes-programming-language-popularity-index?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-19T02:59:00.000Z",
          "wordCount": 6882,
          "title": "Kotlin Keeps Climbing TIOBE's Programming Language Popularity Index",
          "imageUrl": "https://a.fsdn.com/sd/topics/android_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/19/0055242/openai-investors-plot-last-minute-push-with-microsoft-to-reinstate-sam-altman-as-ceo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "The Verge reports that OpenAI's board \"is in discussions with Sam Altman to return to the company as its CEO, according to multiple people familiar with the matter.\" But one of those people said Altman \"is 'ambivalent' about coming back and would want significant governance changes.\" \n\nIn a possibly related development, Forbes reports that \"A day after OpenAI's board of directors fired former CEO Sam Altman in a shock development, investors in the company are plotting how to restore him, in what would amount to an even more surprising counter-coup.\"\n\nVenture capital firms holding positions in OpenAI's for-profit entity have discussed working with Microsoft and senior employees at the company to bring back Altman, even as he has signaled to some that he intends to launch a new startup, four…",
          "link": "https://slashdot.org/story/23/11/19/0055242/openai-investors-plot-last-minute-push-with-microsoft-to-reinstate-sam-altman-as-ceo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-19T00:59:00.000Z",
          "wordCount": 4090,
          "title": "OpenAI Investors Plot Last-Minute Push With Microsoft To Reinstate Sam Altman As CEO",
          "imageUrl": "https://a.fsdn.com/sd/topics/ai_64.png"
        },
        {
          "id": "https://hardware.slashdot.org/story/23/11/18/2318237/why-bill-gates-remains-hopeful-about-innovative-new-climate-solutions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "Bill Gates argues that when it comes to climate change, \"there are more reasons to be hopeful than many people realize — and it's not just that renewable energy sources like wind and solar are getting cheaper. \n\n\"And it's not just because many of the steps already taken to reduce carbon emissions are working: Carbon emissions from fossil fuels will probably peak in 2025.\"\nThe main thing that makes me optimistic is all the innovation I'm seeing. As someone who has been funding climate solutions for years, I get to learn from ingenious scientists who are working on ideas that will help the world solve climate change. And their work makes me confident that innovation will help the world get on track to meet its climate goals. \n\nSome people are skeptical when a technology person like me says i…",
          "link": "https://hardware.slashdot.org/story/23/11/18/2318237/why-bill-gates-remains-hopeful-about-innovative-new-climate-solutions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-18T23:20:00.000Z",
          "wordCount": 5222,
          "title": "Why Bill Gates Remains Hopeful about Innovative New Climate Solutions",
          "imageUrl": "https://a.fsdn.com/sd/topics/power_64.png"
        },
        {
          "id": "https://games.slashdot.org/story/23/11/18/204226/source-code-to-infocoms-text-adventure-interpreters-now-available?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "Slashdot reader Mononymous writes: Back in 2019, digital archivist Jason Scott released the source code to Infocom's classic text adventures. Now the other piece of the puzzle is available: the source code (mostly in assembly, with some C and Pascal) to their microcomputer interpreters.\n\n Infocom, publisher of the best-selling Zork series, ported their text adventures to most of the diverse microcomputer platforms of the 1980s by using an early virtual machine, known as the Z-machine or ZIP. This enabled them to sell games simultaneously for everything from the TI-99/4A to the Commodore 128. Hobbyists reverse-engineered the technology in the 1990s to create modern implementations, but now the original source code can be studied directly.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://games.slashdot.org/story/23/11/18/204226/source-code-to-infocoms-text-adventure-interpreters-now-available?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-18T21:59:00.000Z",
          "wordCount": 4229,
          "title": "Source Code To Infocom's Text Adventure Interpreters Now Available",
          "imageUrl": "https://a.fsdn.com/sd/topics/rpg_64.png"
        },
        {
          "id": "https://linux.slashdot.org/story/23/11/18/012228/rust-in-linux-maturing-with-support-from-cisco-samsung-canonical?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "ZDNet shares on update on \"Rust in Linux: Where we are and where we're going next,\" citing a talk at the Linux Plumbers Conference in Richmond, Virginia by Linux/Rust developer Miguel Ojeda:\n\nIn brief, Rust Linux is continuing to mature and is getting strong support from developers and vendors, such as Cisco, Samsung, and Canonical... Rust is taking the steps it needs to become — along with C — a fully-fledged member of the Linux language toolchain... That's not to say that we're ready to retire C for Rust just yet. In fact, that day is unlikely ever to come. But Rust is definitely on its way to becoming an important language for Linux development... \n\nAs for the day-to-day work that's required to make Rust fully integrated with Linux, the \"official\" website of the initiative is now the se…",
          "link": "https://linux.slashdot.org/story/23/11/18/012228/rust-in-linux-maturing-with-support-from-cisco-samsung-canonical?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-18T20:59:00.000Z",
          "wordCount": 5587,
          "title": "Rust in Linux:  Maturing with Support from Cisco, Samsung, Canonical",
          "imageUrl": "https://a.fsdn.com/sd/topics/linux_64.png"
        },
        {
          "id": "https://news.slashdot.org/story/23/11/18/0448220/is-disney-pinnacle-preparing-to-be-the-next-big-nft-failure?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "\"NFTs aren't gone yet,\" writes the Verge. \n\n\"Disney will launch an 'all-new socially driven collectible experience' called Disney Pinnacle later this year, turning characters from Pixar, Star Wars, and its classic animated films into tradable digital pins.\"\n\n\nWhile announcing Pinnacle, Disney and its partner Dapper Labs won't even say the word \"NFT.\" Dapper Labs still calls itself \"the NFT company,\" but between a variety of scams, an eye-blistering episode at a recent Bored Ape event, and a market that has plunged since peaking in early 2021, that's a term they apparently will steer clear of. The only thing available on the site right now is a privacy policy that makes clear this is a Dapper Labs effort that's licensing content from Disney — not an in-house effort on the level of Disney Plus. \n\nThe NFT collection is being launched through an iOS app, and a spokesperson tells CoinDesk that web and Android applications will come later.\n\n \nThe Disney Pinnacle website has a few seconds of background animation showing the pins — and, of course, a waitlist signup form.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://news.slashdot.org/story/23/11/18/0448220/is-disney-pinnacle-preparing-to-be-the-next-big-nft-failure?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-18T19:59:00.000Z",
          "wordCount": 5488,
          "title": "Is 'Disney Pinnacle' Preparing to Be the Next Big NFT Failure?",
          "imageUrl": "https://a.fsdn.com/sd/topics/money_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/18/1858203/what-exactly-happened-at-openai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "Microsoft's stock price plumetted 16% after OpenAI fired CEO Sam Altman — but appears to have immediately recovered most of the drop in after-hours trading. Yet OpenAI's move \"also blindsided key investor and minority owner Microsoft,\" writes Ars Technica, \"reportedly making CEO Satya Nadella furious.\" \n\n\nTech reporter Kara Swisher called the firing a \"badly managed coup de Sam,\" tweeting more details Friday night. \"Sources tell me that the profit direction of the company under Altman and the speed of development, which could be seen as too risky, and the nonprofit side dedicated to more safety and caution were at odds. One person on the Sam side called it a 'coup,' while another said it was the the right move.\" \n\nArs Technica fills in the story:\nSources told reporter Kara Swisher that Ope…",
          "link": "https://slashdot.org/story/23/11/18/1858203/what-exactly-happened-at-openai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-18T18:59:00.000Z",
          "wordCount": 8534,
          "title": "What Exactly Happened At OpenAI?",
          "imageUrl": "https://a.fsdn.com/sd/topics/ai_64.png"
        },
        {
          "id": "https://science.slashdot.org/story/23/11/18/1732200/spacexs-starship-reaches-outer-space-before-intentional-detonation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "CNN reports\n\nSpaceX made a second attempt to successfully launch Starship, the most powerful rocket ever constructed. The uncrewed rocket took off just after 7 a.m. CT (8 a.m. ET). The rocket took off as intended, making it roughly 8 minutes into flight before SpaceX confirmed it had to intentionally explode the Starship spacecraft as it flew over the ocean... \n\nThis mission comes after months of back-and-forth with federal regulators as SpaceX has awaited a launch license. The company is also grappling with pushback from environmentalists... \n\nAfter separating from the Super Heavy rocket booster, the Starship spacecraft soared to an altitude of approximately 93 miles (150 kilometers) before SpaceX lost contact, according to a statement issued by the company. For context, the U.S. government considers 50 miles (80 kilometers) above Earth's surface the edge of outer space... \n\nSpaceX is OK with rockets exploding in the early stages of development. That's because the company uses a completely different approach to rocket design than, say, NASA. The space agency focuses on building one rocket and strenuously designing and testing it on the ground before its first flight — taking years but all but guaranteeing success on the first launch. SpaceX, however, rapidly builds new prototypes and is willing to test them to their breaking point because there's usually a spare nearby. During a drive by the company's facilities on Friday — four Starship spacecraft and at least two Super Heavy boosters could be seen from public roadways. \nCNN reminds readers that \"so far in 2023 alone, the Falcon 9 has launched more than 70 spaceflights... \n\n\n\"Elon Musk described Starship as the vehicle that underpins SpaceX's founding purpose: sending humans to Mars for the first time. NASA has its own plans for the rocket.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://science.slashdot.org/story/23/11/18/1732200/spacexs-starship-reaches-outer-space-before-intentional-detonation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-18T17:35:00.000Z",
          "wordCount": 10465,
          "title": "SpaceX's Starship Reaches Outer Space Before Intentional Detonation",
          "imageUrl": "https://a.fsdn.com/sd/topics/space_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/11/17/2327241/us-space-force-monitors-satellites-in-the-robotic-battlefield-of-space?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "\"At least 44,500 space objects now circle Earth,\" reports the New York Times magazine, \"including 9,000 active satellites and 19,000 significant pieces of debris.\" \n\nThe article notes a threat assessment from U.S. Space Force Chief Master Sergeant Ron Lerch:\n\nWhat's most concerning isn't the swarm of satellites but the types. \"We know that there are kinetic kill vehicles,\" Lerch said — for example, a Russian \"nesting doll\" satellite, in which a big satellite releases a tiny one and the tiny one releases a mechanism that can strike and damage another satellite. There are machines with the ability to cast nets and extend grappling hooks, too. China, whose presence in space now far outpaces Russia's, is launching unmanned \"space planes\" into orbit, testing potentially unbreakable quantum comm…",
          "link": "https://tech.slashdot.org/story/23/11/17/2327241/us-space-force-monitors-satellites-in-the-robotic-battlefield-of-space?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-18T16:34:00.000Z",
          "wordCount": 5220,
          "title": "US Space Force Monitors Satellites in the 'Robotic Battlefield' of Space",
          "imageUrl": "https://a.fsdn.com/sd/topics/communications_64.png"
        },
        {
          "id": "https://developers.slashdot.org/story/23/11/18/0131201/python-community-announces-podcast-developers-survey-pycharm-discount?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "EditorDavid",
          "description": "The Python community is staying busy.\n\n\nThree weeks ago a new podcast launched with Python core developer/steering council member Pablo Galindo and Python developer-in-residence Åukasz Langa.\n\nThis month the Python Sofware Foundation announced its seventh Python Developers Survey. \n\nAnd for the fifth year in a row the foundation partnered with JetBrains to offer a 30% discount on JetBrains' dedicated Python Integrated Development Environment \"PyCharm\" — with all proceeds benefitting the Python Software Foundation (\"The discount will be automatically applied when you check out. The promotion will only be available through November 27th...\") \n\nA PSF blog post about the fundraiser notes you can also just make a direct donation to the Python Software Foundation, or sign up to become a foundation member to \"help us sustain what we do.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://developers.slashdot.org/story/23/11/18/0131201/python-community-announces-podcast-developers-survey-pycharm-discount?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-18T15:34:00.000Z",
          "wordCount": 4471,
          "title": "Python Community Announces Podcast, Developer's Survey, PyCharm Discount",
          "imageUrl": "https://a.fsdn.com/sd/topics/python_64.png"
        },
        {
          "id": "https://mobile.slashdot.org/story/23/11/18/0111202/fcc-tightens-telco-rules-to-combat-sim-swapping?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "An anonymous reader quotes a report from SecurityWeek: Moving to clamp down on the growing scourge of SIM-swapping and port-out fraud, the Federal Communications Commission (FCC) has unveiled new rules mandating telcos to give consumers greater control of their mobile phone accounts. Under the new rules, wireless carriers are required to notify customers of any SIM transfer requests, a measure designed to thwart fraudulent attempts by cybercriminals. The FCC has also revised its customer proprietary network information and local number portability rules, making it more challenging for scammers to access sensitive subscriber information.\n \nThe new protective measures (PDF) are meant to address SIM-swapping and port-out attacks widely documented in cybercriminal attacks against businesses and consumers. The attack technique is used to hijack mobile accounts, change and steal passwords, bypass MFA roadblocks and raid bank accounts. Studies have found that major mobile carriers in the US are vulnerable to SIM-swapping with the Federal Bureau of Investigation (FBI) receiving thousands of consumer complaints every year.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://mobile.slashdot.org/story/23/11/18/0111202/fcc-tightens-telco-rules-to-combat-sim-swapping?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-18T13:00:00.000Z",
          "wordCount": 5344,
          "title": "FCC Tightens Telco Rules To Combat SIM-Swapping",
          "imageUrl": "https://a.fsdn.com/sd/topics/cellphones_64.png"
        },
        {
          "id": "https://hardware.slashdot.org/story/23/11/18/014238/worlds-largest-single-site-solar-farm-goes-online?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "The world's largest single-site solar farm has gone online in the United Arab Emirates. Called the Al Dhafra solar farm, it features almost 4 million bifacial solar panels and will power nearly 200,000 homes -- all while eliminating 2.4 million tons of carbon emissions annually. Electrek reports: Now that Al Dhafra is online, the UAE's solar power production capacity has increased to 3.2 GW. In September, EWEC called for proposals to develop a 1.5 GW solar farm in Al Khazna near Abu Dhabi. UAE is aiming to triple its renewable energy capacity to 14 GW by 2030. The UAE is hosting COP28 in Dubai, which kicks off on November 30, so, understandably, its rulers would time the launch of the world's largest solar farm just ahead of that event -- it's simply good PR.\n \nUAE is rightly being criticized for putting the CEO of its state oil company, the Abu Dhabi National Oil Company -- the world's 12th-biggest oil company by production -- in charge of COP28. It's also being criticized for hosting COP28 yet having an all-of-the-above approach to energy. The UAE Energy Strategy 2050 targets an energy mix of 44% clean energy, 38% gas, 12% \"clean coal\" (yes, it really says that), and 6% nuclear. It says it will become carbon neutral by 2050, but how it will do that on 50% fossil fuels is anyone's guess.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://hardware.slashdot.org/story/23/11/18/014238/worlds-largest-single-site-solar-farm-goes-online?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-18T10:00:00.000Z",
          "wordCount": 8941,
          "title": "World's Largest Single-Site Solar Farm Goes Online",
          "imageUrl": "https://a.fsdn.com/sd/topics/power_64.png"
        },
        {
          "id": "https://news.slashdot.org/story/23/11/18/0058220/why-us-women-now-live-almost-6-years-longer-than-men?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "According to a new study published in JAMA Internal Medicine, women in the U.S. are now projected to live about six years longer than U.S. men. TIME reports: [T]he 2021 data represent the largest gender-based life expectancy gap in the U.S. since 1996. The gulf began to widen before the COVID-19 pandemic, the authors note, but the trend accelerated from 2019 to 2021. Deaths from COVID-19 and unintentional injuries, a category that includes accidental drug overdoses, were the largest contributors to the widening of the gap, but differential rates of homicide, heart disease, and suicide deaths also played a role, according to the report. It's well-established that men die of these causes more frequently than women, and in recent years, they have been some of the most common causes of death overall. Heart disease, COVID-19, and unintentional injuries accounted for three of the top five in 2021.\n \nThe gender gap would have been even wider, the authors note, but for factors including increases in maternal mortality and decreases in cancer deaths among men. Overall, the data underscore the continued importance of limiting COVID-19's spread, and of finding better ways to improve national mental health and prevent drug overdoses and suicides -- fatalities sometimes labeled by experts as \"deaths of despair.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://news.slashdot.org/story/23/11/18/0058220/why-us-women-now-live-almost-6-years-longer-than-men?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-18T07:00:00.000Z",
          "wordCount": 13166,
          "title": "Why US Women Now Live Almost 6 Years Longer Than Men",
          "imageUrl": "https://a.fsdn.com/sd/topics/usa_64.png"
        },
        {
          "id": "https://games.slashdot.org/story/23/11/18/0030254/valve-celebrates-25-years-of-half-life-with-feature-packed-steam-update?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "An anonymous reader quotes a report from Ars Technica: This Sunday, November 19, makes a full 25 years since the original Half-Life first hit (pre-Steam) store shelves. To celebrate the anniversary, Valve has uploaded a feature-packed \"25th anniversary update\" to the game on Steam, and made the title free to keep if you pick it up this weekend. Valve's 25th Anniversary Update page details a bevy of new and modernized features added to the classic first-person shooter, including:\n - Four new multiplayer maps that \"push the limits of what's possible in the Half-Life engine\" - New graphics settings, including support for a widescreen field-of-view on modern monitors and OpenGL Overbright lighting (still no official ray-tracing support, though-leave that to the modders) - \"Proper gamepad config out of the box\" (so dust off that Gravis Gamepad Pro) - Steam networking support for easier multiplayer setup - \"Verified\" support for Steam Deck play (\"We failed super hard\" on the first verification attempt, Valve writes) - Proper UI scaling for resolutions up to 3840x1600 - Multiplayer balancing updates (because 25 years hasn't been enough to perfect the meta) - New entity limits that allow mod makers to build more complex mods - A full software renderer for the Linux version of the game - Various bug fixes - \"Removed the now very unnecessary 'Low video quality. Helps with slower video cards' setting\"\n \nIn addition, the new update includes a host of restored and rarely seen content, including:\n - Three multiplayer maps from the \"Half-Life: Further Data\" CD-ROM: Double Cross, Rust Mill, and Xen DM - Four restored multiplayer models: Ivan the Space Biker, Proto-Barney (from the alpha build), a skeleton, and Too Much Coffee Man (from \"Further Data\") - Dozens of \"Further Data\" sprays to tag in your multiplayer matches - The original Half-Life: Uplink demo in playable form\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://games.slashdot.org/story/23/11/18/0030254/valve-celebrates-25-years-of-half-life-with-feature-packed-steam-update?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-18T03:30:00.000Z",
          "wordCount": 8101,
          "title": "Valve Celebrates 25 Years of Half-Life With Feature-Packed Steam Update",
          "imageUrl": "https://a.fsdn.com/sd/topics/games_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/11/18/0041200/swedish-workers-are-uniting-against-tesla?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "New submitter doc1623 shares a report from Wired: Swedish workers are uniting against Tesla. [Starting Friday], cleaners will stop cleaning Tesla showrooms, electricians won't fix the company's charging points, and dockworkers will refuse to unload Tesla cargo at all Swedish ports. What started as a strike by Tesla mechanics is spreading, in something Swedish unions describe as an existential battle between Elon Musk's carmaker and the conventions they say make the country's labor market fair and efficient. The standoff in Sweden is the biggest union action the company has faced anywhere in the world. Sweden doesn't have laws that set working conditions, such as a minimum wage. Instead these rules are dictated by collective agreements, a type of contract that defines the benefits employees…",
          "link": "https://tech.slashdot.org/story/23/11/18/0041200/swedish-workers-are-uniting-against-tesla?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-18T01:40:00.000Z",
          "wordCount": 14251,
          "title": "Swedish Workers Are Uniting Against Tesla",
          "imageUrl": "https://a.fsdn.com/sd/topics/transportation_64.png"
        },
        {
          "id": "https://news.slashdot.org/story/23/11/17/2356236/usdas-plant-hardiness-zone-map-shows-half-the-country-has-shifted?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "The newly updated U.S. Department of Agriculture's \"plant hardiness zone map\" has gardeners across the nation researching what new plants they can grow in their warming regions, as the 2023 map is about 2.5 degrees Fahrenheit warmer than the 2012 map. NPR reports: This week the map got its first update in more than a decade, and the outlook for many gardens looks warmer. The 2023 map is about 2.5 degrees Fahrenheit warmer than the 2012 map across the contiguous U.S., says Chris Daly, director of the PRISM Climate Group at Oregon State University that jointly developed the map with the USDA. Daly says the new map means about half the country has shifted into a new half zone and half hasn't. In some locations, people may find they can grow new types of flowers, fruits, vegetables and plants.\n \nDaly says he is hesitant to explicitly attribute the specific changes from the 2012 map to the 2023 map to climate change because of the volatility of the key statistic they used to create this map. They were mapping \"the coldest night of the year, each year, over the past 30 years\", Daly says, and it's a highly variable figure. In an email, a press officer for the USDA says, \"Changes to plant hardiness zones are not necessarily reflective of global climate change because of the highly variable nature of the extreme minimum temperature of the year.\" But Daly says, in the big picture, climate change is playing a role in changing what grows where in the US: \"Over the long run, we will expect to see a slow shifting northward of zones as climate change takes hold.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://news.slashdot.org/story/23/11/17/2356236/usdas-plant-hardiness-zone-map-shows-half-the-country-has-shifted?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-18T01:00:00.000Z",
          "wordCount": 6545,
          "title": "USDA's Plant Hardiness Zone Map Shows Half the Country Has Shifted",
          "imageUrl": "https://a.fsdn.com/sd/topics/usa_64.png"
        },
        {
          "id": "https://yro.slashdot.org/story/23/11/17/2237246/online-atrocity-database-exposed-thousands-of-vulnerable-people-in-congo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "An anonymous reader quotes a report from The Intercept: A joint project of Human Rights Watch and New York University to document human rights abuses in the Democratic Republic of the Congo has been taken offline after exposing the identities of thousands of vulnerable people, including survivors of mass killings and sexual assaults. The Kivu Security Tracker is a \"data-centric crisis map\" of atrocities in eastern Congo that has been used by policymakers, academics, journalists, and activists to \"better understand trends, causes of insecurity and serious violations of international human rights and humanitarian law,\" according to the deactivated site. This includes massacres, murders, rapes, and violence against activists and medical personnel by state security forces and armed groups, the…",
          "link": "https://yro.slashdot.org/story/23/11/17/2237246/online-atrocity-database-exposed-thousands-of-vulnerable-people-in-congo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-18T00:20:00.000Z",
          "wordCount": 4282,
          "title": "Online Atrocity Database Exposed Thousands of Vulnerable People In Congo",
          "imageUrl": "https://a.fsdn.com/sd/topics/database_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/11/17/2227213/metas-head-of-augmented-reality-software-stepping-down?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "According to Reuters, Meta's head of augmented reality software is stepping down from his role. From the report: VP of Engineering Don Box announced the end of his tenure at Meta internally this week, without elaborating on what he would do next, according to a source familiar with the matter. A Meta spokesperson confirmed Box would be leaving the company at the end of this week and said he was doing so for personal reasons. There would be no change in product roadmap as a result of his decision, she added.\n \nThe departure of Box, a veteran engineer with experience building major technology systems from their infancy, could be a setback to progress on the operating system, a key component of Meta's AR glasses project, the source told Reuters. Meta has been planning to deliver a first gener…",
          "link": "https://tech.slashdot.org/story/23/11/17/2227213/metas-head-of-augmented-reality-software-stepping-down?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T23:40:00.000Z",
          "wordCount": 4112,
          "title": "Meta's Head of Augmented Reality Software Stepping Down",
          "imageUrl": "https://a.fsdn.com/sd/topics/facebook_64.png"
        },
        {
          "id": "https://news.slashdot.org/story/23/11/17/2221255/canada-court-overturns-government-ruling-that-some-plastics-are-toxic?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "A court in Canada struck down a regulation classifying some plastic products as toxic, \"a ruling that could hurt a push by Ottawa to ban single-use plastic items like bags, straws and forks.\" From the report: A ban on manufacturing and importing \"harmful\" single-use plastics came into effect last December after the federal government formally drew up a order that added them to a list of toxic items. But the Federal Court in Ottawa overturned that decision, calling the listing \"unreasonable and unconstitutional.\" The case was brought by plastics manufacturers such as Dow Inc as well as Imperial Oil.\n \nThe office of Environment Minister Stephen Guilbeault said it was considering an appeal. \"We strongly believe in taking action to tackle this crisis and keep millions of garbage bags worth of trash off our beaches, out of our waters, and away from nature,\" spokeswoman Kaitlin Power said in a statement.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://news.slashdot.org/story/23/11/17/2221255/canada-court-overturns-government-ruling-that-some-plastics-are-toxic?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T23:00:00.000Z",
          "wordCount": 4853,
          "title": "Canada Court Overturns Government Ruling That Some Plastics Are Toxic",
          "imageUrl": "https://a.fsdn.com/sd/topics/canada_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/17/2214245/unauthorized-david-attenborough-ai-clone-narrates-developers-life-goes-viral?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "An anonymous reader quotes a report from Ars Technica: On Wednesday, Replicate developer Charlie Holtz combined GPT-4 Vision (commonly called GPT-4V) and ElevenLabs voice cloning technology to create an unauthorized AI version of the famous naturalist David Attenborough narrating Holtz's every move on camera. As of Thursday afternoon, the X post describing the stunt had garnered over 21,000 likes. \"Here we have a remarkable specimen of Homo sapiens distinguished by his silver circular spectacles and a mane of tousled curly locks,\" the false Attenborough says in the demo as Holtz looks on with a grin. \"He's wearing what appears to be a blue fabric covering, which can only be assumed to be part of his mating display.\" \"Look closely at the subtle arch of his eyebrow,\" it continues, as if narrating a BBC wildlife documentary. \"It's as if he's in the midst of an intricate ritual of curiosity or skepticism. The backdrop suggests a sheltered habitat, possibly a communal feeding area or watering hole.\"\n \nHow does it work? Every five seconds, a Python script called \"narrator\" takes a photo from Holtz's webcam and feeds it to GPT-4V -- the version of OpenAI's language model that can process image inputs -- via an API, which has a special prompt to make it create text in the style of Attenborough's narrations. Then it feeds that text into an ElevenLabs AI voice profile trained on audio samples of Attenborough's speech. Holtz provided the code (called \"narrator\") that pulls it all together on GitHub, and it requires API tokens for OpenAI and ElevenLabs that cost money to run. During the demo video, when Holtz holds up a cup and takes a drink, the fake Attenborough narrator says, \"Ah, in its natural environment, we observe the sophisticated Homo sapiens engaging in the critical ritual of hydration. This male individual has selected a small cylindrical container, likely filled with life-sustaining H2O, and is tilting it expertly towards his intake orifice. Such grace, such poise.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/11/17/2214245/unauthorized-david-attenborough-ai-clone-narrates-developers-life-goes-viral?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T22:16:00.000Z",
          "wordCount": 4690,
          "title": "Unauthorized 'David Attenborough' AI Clone Narrates Developer's Life, Goes Viral",
          "imageUrl": "https://a.fsdn.com/sd/topics/ai_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/17/2137216/sam-altman-fired-as-ceo-of-openai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "Slashdot Staff",
          "description": "Sam Altman has been fired as CEO of OpenAI, the company announced on Friday. Slashdot reader tagous submitted this statement from OpenAI's board: Mr. Altman's departure follows a deliberative review process by the board, which concluded that he was not consistently candid in his communications with the board, hindering its ability to exercise its responsibilities. The board no longer has confidence in his ability to continue leading OpenAI. \nThe Verge reports:\nChief technology officer Mira Murati will be the interim CEO, effective immediately. The company will be conducting a search for the permanent CEO successor. Employees at OpenAI found out about the news when it was announced publicly, according to multiple sources. This is an extremely sudden turn of events as Altman has largely been the face of OpenAI, which arguably kickstarted the current AI arms race with last year's hugely popular ChatGPT. Just last week, Altman keynoted at the company's DevDay conference, where it announced a suite of major new updates to compete with other big tech companies like Microsoft and Google. Altman also spoke at Thursday's Asia-Pacific Economic Cooperation conference. \"I loved my time at OpenAI,\" Altman said in a post on X. \"It was transformative for me personally, and hopefully the world a little bit. Most of all I loved working with such talented people. Will have more to say about what's next later.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/11/17/2137216/sam-altman-fired-as-ceo-of-openai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T21:23:00.000Z",
          "wordCount": 6268,
          "title": "Sam Altman fired as CEO of OpenAI",
          "imageUrl": "https://a.fsdn.com/sd/topics/ai_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/11/17/1655257/google-delays-release-of-gemini-ai-that-aims-to-compete-with-openai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Google's company-defining effort to catch up to ChatGPT creator OpenAI is turning out to be harder than expected. From a report: Google representatives earlier this year told some cloud customers and business partners they would get access to the company's new conversational AI, a large language model known as Gemini, by November. But the company recently told them not to expect it until the first quarter of next year, according to two people with direct knowledge. The delay comes at a bad time for Google, whose cloud sales growth has slowed while that of its bigger rival, Microsoft, has accelerated. Part of Microsoft's success has come from selling OpenAI's technology to its customers.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://tech.slashdot.org/story/23/11/17/1655257/google-delays-release-of-gemini-ai-that-aims-to-compete-with-openai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T21:20:00.000Z",
          "wordCount": 4205,
          "title": "Google Delays Release of Gemini AI That Aims To Compete With OpenAI",
          "imageUrl": "https://a.fsdn.com/sd/topics/topicgoogle_fb.gif"
        },
        {
          "id": "https://news.slashdot.org/story/23/11/17/1729228/eu-allows-use-of-controversial-weedkiller-glyphosate-for-10-more-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "After months of wrangling, the European Commission says it has decided to renew the license for the weedkiller compound glyphosate, approving its use in European Union countries for ten more years. From a report: Following the decision yesterday, the Commission released a statement saying that, on the basis of comprehensive safety assessments carried out by the European Food Safety Authority (EFSA) and the European Chemicals Agency (ECHA), it would renew the licence, \"subject to certain new conditions and restrictions.\" These include a ban on the use of the chemical to dry crops before harvest, and \"the need for certain measures to protect non-target organisms.\" Governments can still restrict the use of glyphosate in their own countries if they consider the risks too high, particularly in regard to the need to protect biodiversity, the statement added. \n\nGlyphosate is the active ingredient in Roundup, the world's most widely used herbicide. Over the years, a debate has developed about whether the chemical is safe to use on food crops, as well as its possible environmental impacts. Some studies point to a link between glyphosate and certain cancers; others suggest that the way in which it is used should not harm consumers. Glyphosate has been investigated extensively by food- and chemicals-safety agencies, but disagreements among researchers remain. The license allowing glyphosate's use in the EU was last renewed for five years in 2017. Ahead of the authorization's expiry in last December, the European Union temporarily extended it for another year to allow the EFSA to assess some 2,400 studies about the compound and to make a recommendation to governments.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://news.slashdot.org/story/23/11/17/1729228/eu-allows-use-of-controversial-weedkiller-glyphosate-for-10-more-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T20:40:00.000Z",
          "wordCount": 6448,
          "title": "EU Allows Use of Controversial Weedkiller Glyphosate for 10 More Years",
          "imageUrl": "https://a.fsdn.com/sd/topics/eu_64.png"
        },
        {
          "id": "https://science.slashdot.org/story/23/11/17/1659237/race-cannot-be-used-to-predict-heart-disease-scientists-say?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Doctors have long relied on a few key patient characteristics to assess risk of a heart attack or stroke, using a calculus that considers blood pressure, cholesterol, smoking and diabetes status, as well as demographics: age, sex and race. Now, the American Heart Association is taking race out of the equation. From a report: The overhaul of the widely used cardiac-risk algorithm is an acknowledgment that, unlike sex or age, race identification in and of itself is not a biological risk factor. The scientists who modified the algorithm decided from the start that race itself did not belong in clinical tools used to guide medical decision making, even though race might serve as a proxy for certain social circumstances, genetic predispositions or environmental exposures that raise the risk of cardiovascular disease. \n\nThe revision comes amid rising concern about health equity and racial bias within the U.S. health care system, and is part of a broader trend toward removing race from a variety of clinical algorithms. \"We should not be using race to inform whether someone gets a treatment or doesn't get a treatment,\" said Dr. Sadiya Khan, a preventive cardiologist at Northwestern University Feinberg School of Medicine, who chaired the statement writing committee for the American Heart Association, or A.H.A. The statement was published on Friday [PDF] in the association's journal, Circulation. An online calculator using the new algorithm, called PREVENT, is still in development.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://science.slashdot.org/story/23/11/17/1659237/race-cannot-be-used-to-predict-heart-disease-scientists-say?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T20:00:00.000Z",
          "wordCount": 8223,
          "title": "Race Cannot Be Used To Predict Heart Disease, Scientists Say",
          "imageUrl": "https://a.fsdn.com/sd/topics/science_64.png"
        },
        {
          "id": "https://science.slashdot.org/story/23/11/17/1717249/why-superconductor-research-is-in-a-golden-age---despite-controversy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Davide Castelvecchi, writing for Nature: A Nature retraction last week has put to rest the latest claim of room-temperature superconductivity -- in which researchers said they had made a material that could conduct electricity without producing waste heat and without refrigeration. The retraction follows the downfall of an even more brazen claim about a supposed superconductor called LK-99, which went viral on social media earlier this year. Despite these high-profile setbacks, superconductivity researchers say the field is enjoying somewhat of a renaissance. \"It's not a dying field -- on the contrary,\" says Lilia Boeri, a physicist who specializes in computational predictions at the Sapienza University of Rome. The progress is fuelled in part by the new capabilities of computer simulations to predict the existence and properties of undiscovered materials. \n\nMuch of the excitement is focused on 'super-hydrides -- hydrogen-rich materials that have shown superconductivity at ever-higher temperatures, as long as they are kept at high pressure. The subject of the retracted Nature paper was purported to be such a material, made of hydrogen, lutetium and nitrogen. But work in the past few years has unearthed several families of materials that could have revolutionary properties. \"It really does look like we're on the hairy edge of being able to find a lot of new superconductors,\" says Paul Canfield, a physicist at Iowa State University in Ames and Ames National Laboratory.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://science.slashdot.org/story/23/11/17/1717249/why-superconductor-research-is-in-a-golden-age---despite-controversy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T19:20:00.000Z",
          "wordCount": 4540,
          "title": "Why Superconductor Research is in a 'Golden Age' - Despite Controversy",
          "imageUrl": "https://a.fsdn.com/sd/topics/science_64.png"
        },
        {
          "id": "https://news.slashdot.org/story/23/11/17/1734244/almost-no-one-pays-a-6-real-estate-commission---except-americans?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "The way we buy and sell homes in the U.S. isn't normal -- at least not compared with the rest of the world. From a report: The commission on a home sale here is typically around 5% to 6%, usually split between the seller's and buyer's agents. In most countries, the commissions are substantially smaller. The U.S. is home to as many as three million agents. By most estimates, no other country is even a close second. \n\nThough it is unclear how much a court decision on commissions last month will upend American real estate, if at all, the ruling opens up the possibility of forever changing how agents are paid for their work. And looking at home sales around the world offers a window into what could be in store. One reason commissions here remain high is the use of buyer agents, said Ryan Tomasello, managing director at investment bank Keefe, Bruyette & Woods. Home sellers pay the commission -- typically between 5% and 6% of a home's selling price -- which is usually split between the seller's and buyer's agent. Buyer agents aren't nearly as common in other parts of the world, said Tomasello. \n\n[...] In the pre-internet days, a buyer agent's main job was to screen and filter listings for hopeful home buyers. Today, much of that early house hunting can be done online. So the role of the buyer agent has shifted more to providing advice and support, as well as recommendations for home inspectors, lenders and lawyers. A good buyer agent will know how to make a strong offer and may push to lower the home price. In most countries, buyer agents are much less of a factor.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://news.slashdot.org/story/23/11/17/1734244/almost-no-one-pays-a-6-real-estate-commission---except-americans?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T18:40:00.000Z",
          "wordCount": 13772,
          "title": "Almost No One Pays a 6% Real-Estate Commission - Except Americans",
          "imageUrl": "https://a.fsdn.com/sd/topics/usa_64.png"
        },
        {
          "id": "https://linux.slashdot.org/story/23/11/17/167244/canonical-intros-microcloud-simple-free-on-prem-linux-clustering?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Canonical hosted an amusingly failure-filled demo of its new easy-to-install, Ubuntu-powered tool for building small-to-medium scale, on-premises high-availability clusters, Microcloud, at an event in London yesterday. From a report: The intro to the talk leaned heavily on Canonical's looming 20th anniversary, and with good reason. Ubuntu has carved out a substantial slice of the Linux market for itself on the basis of being easier to use than most of its rivals, at no cost -- something that many Linux players still seem not to fully comprehend. The presentation was as buzzword-heavy as one might expect, and it's also extensively based on Canonical's in-house tech, such as the LXD containervisor, Snap packaging, and, optionally, the Ubuntu Core snap-based immutable distro. (The only missing buzzword didn't crop up until the Q&A session, and we were pleased by its absence: it's not built on and doesn't use Kubernetes, but you can run Kubernetes on it if you wish.) \n\nWe're certain this is going to turn off or alienate a lot of the more fundamentalist Penguinistas, but we are equally sure that Canonical won't care. In the immortal words of Kevin Smith, it's not for critics. Microcloud combines several existing bits of off-the-shelf FOSS tech in order to make it easy to link from three to 50 Ubuntu machines into an in-house, private high-availability cluster, with live migration and automatic failover. It uses its own LXD containervisor to manage nodes and workloads, Ceph for distributed storage, OpenZFS for local storage, and OVN to virtualize the cluster interconnect. All the tools are packaged as snaps. It supports both x86-64 and Arm64 nodes, including Raspberry Pi kit, and clusters can mix both architectures. The event included several demonstrations using an on-stage cluster of three ODROID machines with \"Intel N6005\" processors, so we reckon they were ODROID H3+ units -- which we suspect the company chose because of their dual Ethernet connections.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://linux.slashdot.org/story/23/11/17/167244/canonical-intros-microcloud-simple-free-on-prem-linux-clustering?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T18:00:00.000Z",
          "wordCount": 4955,
          "title": "Canonical Intros Microcloud: Simple, Free, On-prem Linux Clustering",
          "imageUrl": "https://a.fsdn.com/sd/topics/linux_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/17/1538213/ethernet-is-still-going-strong-after-50-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "The technology has become the standard LAN worldwide. From a report: Ethernet became commercially available in 1980 and quickly grew into the industry LAN standard. To provide computer companies with a framework for the technology, in June 1983 Ethernet was adopted as a standard by the IEEE 802 Local Area Network Standards Committee. Currently, the IEEE 802 family consists of 67 published standards, with 49 projects under development. The committee works with standards agencies worldwide to publish certain IEEE 802 standards as international guidelines. \n\nA plaque recognizing the technology is displayed outside the PARC facility. It reads: \"Ethernet wired LAN was invented at Xerox Palo Alto Research Center (PARC) in 1973, inspired by the ALOHAnet packet radio network and the ARPANET. In 1980 Xerox, DEC, and Intel published a specification for 10 Mbps Ethernet over coaxial cable that became the IEEE 802.3-1985 Standard. Later augmented for higher speeds, and twisted-pair, optical, and wireless media, Ethernet became ubiquitous in home, commercial, industrial, and academic settings worldwide.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/11/17/1538213/ethernet-is-still-going-strong-after-50-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T17:20:00.000Z",
          "wordCount": 9477,
          "title": "Ethernet is Still Going Strong After 50 Years",
          "imageUrl": "https://a.fsdn.com/sd/topics/network_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/17/1519205/amazon-will-cut-several-hundred-alexa-jobs-as-it-ends-unspecified-initiatives?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Amazon will eliminate several hundred roles in its Alexa division as part of a broader shift in priorities and a focus on developing new forms of artificial intelligence, according to an internal memo sent to employees Friday morning. From a report: \"As we continue to invent, we're shifting some of our efforts to better align with our business priorities, and what we know matters most to customers -- which includes maximizing our resources and efforts focused on generative AI,\" wrote Daniel Rausch, vice president of Alexa and Fire TV, in the memo, obtained by GeekWire. \"These shifts are leading us to discontinue some initiatives, which is resulting in several hundred roles being eliminated.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/11/17/1519205/amazon-will-cut-several-hundred-alexa-jobs-as-it-ends-unspecified-initiatives?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T16:41:00.000Z",
          "wordCount": 4956,
          "title": "Amazon Will Cut 'Several Hundred' Alexa Jobs as It Ends Unspecified Initiatives",
          "imageUrl": "https://a.fsdn.com/sd/topics/business_64.png"
        },
        {
          "id": "https://it.slashdot.org/story/23/11/17/126235/ransomware-group-reports-victim-it-breached-to-sec-regulators?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "One of the world's most active ransomware groups has taken an unusual -- if not unprecedented -- tactic to pressure one of its victims to pay up: reporting the victim to the US Securities and Exchange Commission. From a report: The pressure tactic came to light in a post published on Wednesday on the dark web site run by AlphV, a ransomware crime syndicate that's been in operation for two years. After first claiming to have breached the network of the publicly traded digital lending company MeridianLink, AlphV officials posted a screenshot of a complaint it said it filed with the SEC through the agency's website. Under a recently adopted rule that goes into effect next month, publicly traded companies must file an SEC disclosure within four days of learning of a security incident that had a \"material\" impact on their business. \n\n\"We want to bring to your attention a concerning issue regarding MeridianLink's compliance with the recently adopted cybersecurity incident disclosure rules,\" AlphV officials wrote in the complaint. \"It has come to our attention that MeridianLink, in light of a significant breach compromising customer data and operational information, has failed to file the requisite disclosure under item 1.05 of form 8-K within the stipulated four business days, as mandated by the new SEC rules.\" The violation category selected in the online report was \"Material misstatement or omission in a company's filings or financial statements or a failure to file.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://it.slashdot.org/story/23/11/17/126235/ransomware-group-reports-victim-it-breached-to-sec-regulators?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T16:00:00.000Z",
          "wordCount": 6116,
          "title": "Ransomware Group Reports Victim It Breached To SEC Regulators",
          "imageUrl": "https://a.fsdn.com/sd/topics/security_64.png"
        },
        {
          "id": "https://apple.slashdot.org/story/23/11/17/1150251/apple-says-rcs-messages-will-have-green-bubbles?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Apple announced on Thursday its plans to bring RCS support to the iPhone in 2024. But some things are not going to change, sadly. 9to5Mac reports: Since I published my story on the news this morning, there's one thing everyone wants to know: is the blue bubbles vs green bubbles debate coming to an end? I'm happy to say I now have an official answer: nope. RCS will use green bubbles just like SMS. [...] Apple has confirmed to me that blue bubbles will still be used to represent iMessages, while green bubbles will represent RCS messages. The company uses blue bubbles to denote what it believes is the best and most secure way for iPhone users to communicate, which is iMessage.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://apple.slashdot.org/story/23/11/17/1150251/apple-says-rcs-messages-will-have-green-bubbles?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T15:20:00.000Z",
          "wordCount": 13752,
          "title": "Apple Says RCS Messages Will Have Green Bubbles",
          "imageUrl": "https://a.fsdn.com/sd/topics/apple_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/16/2317208/alibaba-cancels-cloud-spinoff-blames-us-chip-sanctions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "Alibaba is canceling the scheduled IPO of its cloud division due to the impact of the U.S. government's CPU export bans to China. The Register reports: The Chinese e-commerce giant reported the move alongside its calendar Q3 earnings, otherwise a generally positive quarter, with the group reporting an income from operations of $4.6 billion, up 34 percent year-on-year, and revenue of $30.8 billion, up 9 percent. Alibaba also said US export restrictions could affect its business more generally by making it harder for the company to upgrade its existing hardware. [...] It's worth noting that the Cloud Intelligence Group brought in $3.789 billion in revenue but earnings before income tax and amortization was $193 million, up 44 percent on the same period a year earlier. Cloud sales growth has stalled in 2023 as customers weigh up their spending. \n\"We believe that these new restrictions [referring to expanded restrictions announced in October] may materially and adversely affect Cloud Intelligence Group's ability to offer products and services and to perform under existing contracts, thereby negatively affecting our results of operations and financial condition,\" Alibaba said. \"We believe that a full spin-off of Cloud Intelligence Group may not achieve the intended effect of shareholder value enhancement,\" the company added. \"Accordingly, we have decided to not proceed with a full spin-off, and instead we will focus on developing a sustainable growth model for Cloud Intelligence Group (CIG) under the fluid circumstances.\"\n \n\"The US needs to stop politicizing and weaponizing trade and tech issues and stop destabilizing global industrial and supply chains,\" Chinese Foreign Ministry spokesperson Mao Ning said in response to the US's new restrictions.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/11/16/2317208/alibaba-cancels-cloud-spinoff-blames-us-chip-sanctions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T00:45:00.000Z",
          "wordCount": 3967,
          "title": "Alibaba Cancels Cloud Spinoff, Blames US Chip Sanctions",
          "imageUrl": "https://a.fsdn.com/sd/topics/cloud_64.png"
        },
        {
          "id": "https://yro.slashdot.org/story/23/11/16/2151246/prison-phone-company-leaked-600000-users-data-and-didnt-notify-them?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "An anonymous reader quotes a report from Ars Technica: Prison phone company Global Tel*Link leaked the personal information of nearly 650,000 users and failed to notify most of the users that their personal data was exposed, the Federal Trade Commission said today. The company agreed to a settlement that requires it to change its security practices and offer free credit monitoring and identity protection to affected users, but the settlement doesn't include a fine. \"Global Tel*Link and two of its subsidiaries failed to implement adequate security safeguards to protect personal information they collect from users of its services, which enabled bad actors to gain access to unencrypted personal information stored in the cloud and used for testing,\" the FTC said.\n \nA security researcher notifi…",
          "link": "https://yro.slashdot.org/story/23/11/16/2151246/prison-phone-company-leaked-600000-users-data-and-didnt-notify-them?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-17T00:02:00.000Z",
          "wordCount": 4548,
          "title": "Prison Phone Company Leaked 600,000 Users' Data and Didn't Notify Them",
          "imageUrl": "https://a.fsdn.com/sd/topics/privacy_64.png"
        },
        {
          "id": "https://news.slashdot.org/story/23/11/16/2146225/google-news-removing-magazine-support-in-december-2023?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "Google has announced that its News app and news.google.com will remove support for paid magazines next month. \"The removal not only applies to new subscriptions/purchases, but also to existing libraries of magazines,\" reports 9to5Google. \"That means that users who have paid for magazines to use them in the Google News app will be cut off pretty soon.\" From the report: Ahead of the December 18 shutdown, users will be able to export copies of paid magazines. Magazines that cannot be exported due to interactive elements will be eligible for a refund. Google explains: \"Support for magazine content in Google News is being discontinued beginning on December 18, 2023, which means if you previously purchased or subscribed to magazines, access from Google News apps or news.google.com to your library of magazines will be removed. To continue to access previously purchased magazine content, we are providing the opportunity to export and save each purchased issue. In some cases, purchased magazines contain interactive elements that cannot be downloaded and saved for future access, and we are offering a refund for this content.\"\n \nThe company further adds that affected users will receive an email titled \"An update to Google News magazine support\" which will contain instructions on how to download copies of magazines they've paid for. However, the cutoff for downloads and/or refunds is also December 18, 2023, which means the clock is ticking. You can access your library of magazines on News here.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://news.slashdot.org/story/23/11/16/2146225/google-news-removing-magazine-support-in-december-2023?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-16T23:20:00.000Z",
          "wordCount": 4307,
          "title": "Google News Removing Magazine Support In December 2023",
          "imageUrl": "https://a.fsdn.com/sd/topics/topicgoogle_fb.gif"
        },
        {
          "id": "https://slashdot.org/story/23/11/16/2139238/hallucinate-chosen-as-cambridge-dictionarys-word-of-the-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "Cambridge dictionary's word of the year for 2023 is \"hallucinate,\" a verb that took on a new meaning with the rise in popularity of artificial intelligence chatbots. The Guardian reports: The original definition of the chosen word is to \"seem to see, hear, feel, or smell\" something that does not exist, usually because of \"a health condition or because you have taken a drug.\" It now has an additional meaning, relating to when artificial intelligence systems such as ChatGPT, which generates text that mimics human writing, \"hallucinates\" and produces false information. The word was chosen because the new meaning \"gets to the heart of why people are talking about AI,\" according to a post on the dictionary site.\n \nGenerative AI is a \"powerful\" but \"far from perfect\" tool, \"one we're all still learning how to interact with safely and effectively -- this means being aware of both its potential strengths and its current weaknesses.\" The dictionary added a number of AI-related entries this year, including large language model (or LLM), generative AI (or GenAI), and GPT (an abbreviation of Generative Pre-trained Transformer). \"AI hallucinations remind us that humans still need to bring their critical thinking skills to the use of these tools,\" continued the post. \"Large language models are only as reliable as the information their algorithms learn from. Human expertise is arguably more important than ever, to create the authoritative and up-to-date information that LLMs can be trained on.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/11/16/2139238/hallucinate-chosen-as-cambridge-dictionarys-word-of-the-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-16T22:40:00.000Z",
          "wordCount": 4458,
          "title": "'Hallucinate' Chosen As Cambridge Dictionary's Word of the Year",
          "imageUrl": "https://a.fsdn.com/sd/topics/ai_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/11/16/2128257/the-eu-will-finally-free-windows-users-from-bing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "An anonymous reader quotes a report from The Verge: Microsoft will soon let Windows 11 users in the European Economic Area (EEA) disable its Bing web search, remove Microsoft Edge, and even add custom web search providers -- including Google if it's willing to build one -- into its Windows Search interface. All of these Windows 11 changes are part of key tweaks that Microsoft has to make to its operating system to comply with the European Commission's Digital Markets Act, which comes into effect in March 2024. Microsoft will be required to meet a slew of interoperability and competition rules, including allowing users \"to easily un-install pre-installed apps or change default settings on operating systems, virtual assistants, or web browsers that steer them to the products and services of …",
          "link": "https://tech.slashdot.org/story/23/11/16/2128257/the-eu-will-finally-free-windows-users-from-bing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-16T22:00:00.000Z",
          "wordCount": 5685,
          "title": "The EU Will Finally Free Windows Users From Bing",
          "imageUrl": "https://a.fsdn.com/sd/topics/eu_64.png"
        },
        {
          "id": "https://it.slashdot.org/story/23/11/16/1845209/users-cant-speak-to-viral-ai-girlfriend-carynai-because-ceo-is-in-jail?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "samleecole writes: People who paid to speak to an AI girlfriend modeled after real life 23-year-old influencer Caryn Marjorie are distraught because the service they paid for, Forever Companions, no longer works. It appears that the service stopped working shortly after Forever Companion CEO and founder John Meyer was arrested for trying to set his own apartment on fire. \n\n404 Media tested CarynAI today as well as other AI bots and confirmed the service is not working. According to what we saw in the Telegram channel where Forever Companion users start conversations with CarynAI, the service has not been working since October 23. \"I terminated my relationship with Forever Voices due to unforeseen circumstances,\" Marjorie told 404 Media in an email. \"I wish the best for John Meyer and his family as he recovers from his mental health crisis. We didn't see this coming but I vow to push CarynAI forward for my fans and supporters.\" On October 30, Marjorie also announced that she's making a similar AI companion, \"CarynAI 2.0,\" with another company called Banter AI. On social media for the last few weeks, the official Forever Voices Twitter account has been posting bizarre videos and statements about the CIA, Donald Trump, and the FBI.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://it.slashdot.org/story/23/11/16/1845209/users-cant-speak-to-viral-ai-girlfriend-carynai-because-ceo-is-in-jail?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-16T21:20:00.000Z",
          "wordCount": 6065,
          "title": "Users Can't Speak To Viral AI Girlfriend CarynAI Because CEO Is in Jail",
          "imageUrl": "https://a.fsdn.com/sd/topics/business_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/11/16/1842225/amazon-to-sell-cars-online-starting-with-hyundai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Speaking of things Amazon can or cannot sell on its platform, the e-commerce giant getting into the car business. From a report: The e-commerce giant along with new partner Hyundai announced Thursday at the 2023 LA Auto Show that it will start selling vehicles on its website in the second half of 2024. Hyundai vehicles will be the first vehicles sold on Amazon.com's U.S. store with other brands following later in the year. The Amazon car sales section will allow customers to shop for vehicles in their area based on a range of preferences, including model, trim, color, and features, choose their preferred car, and then check out online with their chosen payment and financing options. Customers will be able to buy a vehicle online and then pick it up or have it delivered by their local dealership, according to Amazon.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://tech.slashdot.org/story/23/11/16/1842225/amazon-to-sell-cars-online-starting-with-hyundai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-16T20:40:00.000Z",
          "wordCount": 7148,
          "title": "Amazon To Sell Cars Online, Starting With Hyundai",
          "imageUrl": "https://a.fsdn.com/sd/topics/business_64.png"
        },
        {
          "id": "https://developers.slashdot.org/story/23/11/16/1639249/developers-cant-seem-to-stop-exposing-credentials-in-publicly-accessible-code?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Despite more than a decade of reminding, prodding, and downright nagging, a surprising number of developers still can't bring themselves to keep their code free of credentials that provide the keys to their kingdoms to anyone who takes the time to look for them. From a report: The lapse stems from immature coding practices in which developers embed cryptographic keys, security tokens, passwords, and other forms of credentials directly into the source code they write. The credentials make it easy for the underlying program to access databases or cloud services necessary for it to work as intended. [...] \n\nThe number of studies published since following the revelations underscored just how common the practice had been and remained in the years immediately following Uber's cautionary tale. Sadly, the negligence continues even now. Researchers from security firm GitGuardian this week reported finding almost 4,000 unique secrets stashed inside a total of 450,000 projects submitted to PyPI, the official code repository for the Python programming language. Nearly 3,000 projects contained at least one unique secret. Many secrets were leaked more than once, bringing the total number of exposed secrets to almost 57,000.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://developers.slashdot.org/story/23/11/16/1639249/developers-cant-seem-to-stop-exposing-credentials-in-publicly-accessible-code?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-16T20:00:00.000Z",
          "wordCount": 8071,
          "title": "Developers Can't Seem To Stop Exposing Credentials in Publicly Accessible Code",
          "imageUrl": "https://a.fsdn.com/sd/topics/programming_64.png"
        },
        {
          "id": "https://it.slashdot.org/story/23/11/16/1753218/signal-reveals-its-operation-costs-estimates-50-million-a-year-in-2024?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "gaiageek writes: Of note, given the recent Slashdot article about Signal opening up to trying out usernames, is the $6 million annual cost of sending SMS messages for account verification, which certainly suggests that getting rid of phone number verification would be a significant cost-saving solution. Signal pays $14 million a year in infrastructure costs, for instance, including the price of servers, bandwidth, and storage. It uses about 20 petabytes per year of bandwidth, or 20 million gigabytes, to enable voice and video calling alone, which comes to $1.7 million a year. The biggest chunk of those infrastructure costs, fully $6 million annually, goes to telecom firms to pay for the SMS text messages Signal uses to send registration codes to verify new Signal accounts' phone numbers.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://it.slashdot.org/story/23/11/16/1753218/signal-reveals-its-operation-costs-estimates-50-million-a-year-in-2024?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-16T19:20:00.000Z",
          "wordCount": 4938,
          "title": "Signal Reveals Its Operation Costs, Estimates $50 Million a Year In 2024",
          "imageUrl": "https://a.fsdn.com/sd/topics/encryption_64.png"
        },
        {
          "id": "https://apple.slashdot.org/story/23/11/16/1812216/apple-to-add-rcs-support-to-iphone-next-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "9to5Mac: In a surprising move, Apple has announced today that it will adopt the RCS (Rich Communication Services) messaging standard. The feature will launch via a software update \"later next year\" and bring a wide range of iMessage-style features to messaging between iPhone and Android users. Apple's decision comes amid pressure from regulators and competitors like Google and Samsung. It also comes as RCS has continued to develop and become a more mature platform than it once was. \n\nIn a statement to 9to5Mac, an Apple spokesperson said that the company believes RCS will offer better interoperability for cross-platform messages. \"Later next year, we will be adding support for RCS Universal Profile, the standard as currently published by the GSM Association. We believe RCS Universal Profile will offer a better interoperability experience when compared to SMS or MMS. This will work alongside iMessage, which will continue to be the best and most secure messaging experience for Apple users.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://apple.slashdot.org/story/23/11/16/1812216/apple-to-add-rcs-support-to-iphone-next-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-16T18:12:00.000Z",
          "wordCount": 9903,
          "title": "Apple To Add RCS Support To iPhone Next Year",
          "imageUrl": "https://a.fsdn.com/sd/topics/apple_64.png"
        },
        {
          "id": "https://news.slashdot.org/story/23/11/16/1738246/uk-will-refrain-from-regulating-ai-in-the-short-term?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "The UK has said it will refrain from regulating the British artificial intelligence sector, even as the EU, US and China push forward with new measures. From a report: The UK's first minister for AI and intellectual property, Viscount Jonathan Camrose, said at a Financial Times conference on Thursday that there would be no UK law on AI \"in the short term\" because the government was concerned that heavy-handed regulation could curb industry growth. The announcement comes as executives and policymakers around the world debate how to regulate the emerging technology, which holds the promise of transforming many industries and driven the rise in large tech company valuations over the past year. \n\nThe EU has led the field, with its legislation on AI regulation expected to come into force before the end of this year. Beijing is also implementing measures to regulate the industry, while US President Joe Biden recently issued an executive order to promote \"responsible innovation.\" Camrose added: \"I would never criticise any other nation's act on this. But there is always a risk of premature regulation.\" In rushing to introduce industry controls, \"you are not actually making anybody as safe as it sounds,\" he said. \"You are stifling innovation, and innovation is a very very important part of the AI equation.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://news.slashdot.org/story/23/11/16/1738246/uk-will-refrain-from-regulating-ai-in-the-short-term?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-16T18:00:00.000Z",
          "wordCount": 4972,
          "title": "UK Will Refrain From Regulating AI 'in the Short Term'",
          "imageUrl": "https://a.fsdn.com/sd/topics/uk_64.png"
        },
        {
          "id": "https://it.slashdot.org/story/23/11/16/1626249/samsung-says-hackers-accessed-customer-data-during-year-long-breach?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Samsung has admitted that hackers accessed the personal data of U.K.-based customers during a year-long breach of its systems. From a report: In a statement to TechCrunch, Samsung spokesperson Chelsea Simpson, representing the company via a third-party agency, said Samsung was \"recently alerted to a security incident\" that \"resulted in certain contact information of some Samsung U.K. e-store customers being unlawfully obtained.\" Samsung declined to answer further questions about the incident, such as how many customers were affected or how hackers accessed its internal systems. \n\nIn a letter sent to affected customers, Samsung admitted that attackers exploited a vulnerability in an unnamed third-party business application to access the personal information of customers who made purchases at Samsung U.K.'s store between July 1, 2019 and June 30, 2020. The letter, which was shared on X (formerly Twitter), Samsung said it didn't discover the compromise until more than three years later, on November 13, 2023. Samsung told affected customers that hackers may have accessed their names, phone numbers, postal addresses, and email addresses.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://it.slashdot.org/story/23/11/16/1626249/samsung-says-hackers-accessed-customer-data-during-year-long-breach?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-16T17:20:00.000Z",
          "wordCount": 4219,
          "title": "Samsung Says Hackers Accessed Customer Data During Year-Long Breach",
          "imageUrl": "https://a.fsdn.com/sd/topics/security_64.png"
        },
        {
          "id": "https://science.slashdot.org/story/23/11/16/1616203/uk-approves-worlds-first-crispr-based-medicine?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Britain's drugs regulator has approved a groundbreaking treatment for two painful and debilitating lifelong blood disorders, which works by \"editing\" the gene that causes them. From a report: The Medicines and Healthcare products Regulatory Agency (MHRA) has given the green light for Casgevy to be used to treat sickle cell disease and beta thalassemia. It is the first medicine licensed anywhere that works by deploying gene editing that uses the \"genetic scissors,\" known as CRISPR, for which its inventors won the Nobel prize for chemistry. \n\nCasgevy's developers hope the pioneering treatment could banish the pain, infections and anaemia sickle cell disease brings and the severe anaemia experienced by those with beta thalassemia. About 15,000 people in the UK, almost all of African or Caribbean heritage, have sickle cell disease. About 1,000 -- mainly of Mediterranean, south Asian, south-east Asian and Middle Eastern background -- have beta thalassemia and need regular blood transfusions to treat their anaemia. Experts in the illnesses hope Casgevy may be a cure, making it no longer necessary for people with the conditions to have a bone marrow transplant. Until now this has been the only treatment available, even though the body can reject the donor marrow. The Sickle Cell Society welcomed the MHRA's decision as a \"historic moment for the sickle cell community\" which \"offers [them] newfound hope and optimism.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://science.slashdot.org/story/23/11/16/1616203/uk-approves-worlds-first-crispr-based-medicine?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-16T16:40:00.000Z",
          "wordCount": 5132,
          "title": "UK Approves World's First CRISPR-Based Medicine",
          "imageUrl": "https://a.fsdn.com/sd/topics/medicine_64.png?refresh=now"
        },
        {
          "id": "https://yro.slashdot.org/story/23/11/16/1532244/childrens-tablet-has-malware-and-exposes-kids-data-researcher-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "An anonymous reader shares a report: In May this year, Alexis Hancock's daughter got a children's tablet for her birthday. Being a security researcher, Hancock was immediately worried. \"I looked at it kind of sideways because I've never heard of Dragon Touch,\" Hancock told TechCrunch, referring to the tablet's maker. As it turned out, Hancock, who works at the Electronic Frontier Foundation, had good reasons to be concerned. Hancock said she found that the tablet had a slew of security and privacy issues that could have put her daughter's and other children's data at risk. \n\nThe Dragon Touch KidzPad Y88X contains traces of a well-known malware, runs a version of Android that was released five years ago, comes pre-loaded with other software that's considered malware and a \"potentially unwanted program\" because of \"its history and extensive system level permissions to download whatever application it wants,\" and includes an outdated version of an app store designed specifically for kids, according to Hancock's report, which was released on Thursday and seen by TechCrunch ahead of its publication. Hancock said she reached out to Dragon Touch to report these issues, but the company never responded. Dragon Touch did not respond to TechCrunch's questions either. After TechCrunch reached out to the company, Walmart removed the listing from its website, while Amazon said it's looking into the matter.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://yro.slashdot.org/story/23/11/16/1532244/childrens-tablet-has-malware-and-exposes-kids-data-researcher-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-16T16:00:00.000Z",
          "wordCount": 7348,
          "title": "Children's Tablet Has Malware and Exposes Kids' Data, Researcher Finds",
          "imageUrl": "https://a.fsdn.com/sd/topics/android_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/16/1512204/how-amazon-is-going-after-microsofts-cloud-computing-ambitions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Amazon is the driving force behind a trio of advocacy groups working to thwart Microsoft's growing ambition to become a major cloud computing contractor for governments, a Bloomberg analysis shows. From the report: The groups -- the Cloud Infrastructure Services Providers in Europe (CISPE), the Coalition for Fair Software Licensing and the Alliance for Digital Innovation -- want to convince policymakers that Microsoft has improperly locked customers into Azure, its cloud computing service, choking off its rivals and hindering the advancement of technology within the government and beyond. These groups have dozens of members. But Amazon is the biggest funder for two of them and the largest company, measured by revenue, that funds another. \n\nSpokespeople for the groups say no single company determines their agendas. But according to a Bloomberg News review of tax filings, documents and interviews with people familiar with the three groups' operations, Amazon Web Services plays a direct role in shaping their efforts in ways that would boost the cloud giant. Through aggressive lobbying of policymakers, these groups want to ensure that customers can use popular Microsoft products like Office Suite or Windows on any cloud computing system -- and, in particular, on Amazon Web Services, the world's number one cloud infrastructure provider and the retail giant's top profit driver. \n\nTo hammer that message, they've filed complaints, lobbied regulators and sought to shape the views of policymakers probing the cloud market. In one case, an Amazon executive is listed as the author of a public comment to the Federal Trade Commission, as well as testimony and letters to Congress on behalf of the group, according to an analysis of the documents' metadata, revealing the tech giant's role in the lobbying campaign. (The group says the documents reflect the consensus position of its members.) Amazon denied it authored statements for the group.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/11/16/1512204/how-amazon-is-going-after-microsofts-cloud-computing-ambitions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-16T15:20:00.000Z",
          "wordCount": 4978,
          "title": "How Amazon Is Going After Microsoft's Cloud Computing Ambitions",
          "imageUrl": "https://a.fsdn.com/sd/topics/cloud_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/15/2125253/airbnb-acquires-secretive-firm-launched-by-siri-co-founder?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "Airbnb has acquired a secretive new AI startup, GamePlanner.AI, for around $200 million. TechCrunch reports: GamePlanner was co-founded by Adam Cheyer and Siamak Hodjat. Cheyer famously helped co-launch the startup Siri, which Apple acquired and whose technology became the basis for Apple's AI-powered Siri assistant. Hodjat previously worked with Cheyer at Viv Labs, a firm that Samsung bought and leveraged to launch its own AI assistant, Bixby, in 2017. It's not immediately clear what GamePlanner does. A LinkedIn search only turns up two associates: Gabe Greenbaum, a general partner at B Capital who sits on GamePlanner's board of directors, and Joseph Huang, head of design at GamePlanner. GamePlanner hasn't had a web presence for some time; the Internet Archive's earliest cache of the website (from December 2021) yields a blank page.\n \nBut in a canned statement, Airbnb CEO and co-founder Brian Chesky hinted that the 12-person startup combines expertise in AI and design toward crafting AI-driven experiences, sort of like an AI-focused consultancy. \"AI will rapidly alter our world more than any other technology in our lifetime, but we need to ensure that it augments humanity in a positive way,\" Chesky said, adding that the GamePlanner team will focus on \"accelerating\" select AI projects and integrating their tooling into Airbnb's platform. \"Airbnb is one of the more humanistic companies in technology, and I believe that, together with Adam and his team, we can develop some of the best interfaces and practical applications for AI.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/11/15/2125253/airbnb-acquires-secretive-firm-launched-by-siri-co-founder?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-16T00:45:00.000Z",
          "wordCount": 3947,
          "title": "Airbnb Acquires Secretive Firm Launched By Siri Co-Founder",
          "imageUrl": "https://a.fsdn.com/sd/topics/business_64.png"
        },
        {
          "id": "https://apple.slashdot.org/story/23/11/15/2120221/lawmakers-question-apple-over-cancellation-of-jon-stewarts-show?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "An anonymous reader quotes a report from Engadget: A group of lawmakers from a House of Representatives committee wants Apple, like many Jon Stewart enthusiasts, to explain why its streaming arm abruptly canceled the talk show The Problem With Jon Stewart. The current affairs TV series hosted by Jon Stewart briefly made its debut on Apple TV+ in 2021 but its time on air ended when the show received the ax for a third season, reportedly due to \"disagreements\" over show topics.\n \nAccording to Reuters, Lawmakers want to know if the show's coverage and criticism of China has anything to do with the show's cancellation. The government officials have asked Apple to speak on the issue by Dec 15, 2023. In a letter to the tech giant, the House members wrote that while Apple has the right to determine what content it deems appropriate for its platform, \"the coercive tactics of a foreign power should not be directly or indirectly influencing these determinations.\" This effort is bipartisan, with members from both Republican and Democratic parties affiliated with the House of Representatives' Select Committee on Competition with the Chinese Communist Party.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://apple.slashdot.org/story/23/11/15/2120221/lawmakers-question-apple-over-cancellation-of-jon-stewarts-show?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-16T00:02:00.000Z",
          "wordCount": 5517,
          "title": "Lawmakers Question Apple Over Cancellation of Jon Stewart's Show",
          "imageUrl": "https://a.fsdn.com/sd/topics/tv_64.png"
        },
        {
          "id": "https://news.slashdot.org/story/23/11/15/2116232/firefox-going-to-ship-with-wayland-enabled-by-default?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "Michael Larabel reports via Phoronix: Guardrails have been in place where the Firefox browser has enabled Wayland by default (when running on recent GTK versions) but as of today that code has been removed... Firefox will try to move forward with stable releases where Wayland will ship by default! Mozilla Bug 1752398 to \"ship the Wayland backend to release\" has been closed this evening! After the ticket was open for the past two years, it's now deemed ready to hopefully ship enabled for Firefox 121!\n \nThis patch drops the \"early beta or earlier\" check to let Wayland support be enabled by default when running on recent GTK versions (GTK 3.24.30 threshold). Firefox 121 is due for release around 19 December and if all continues to hold, it will finally ship with the Wayland back-end enabled by default as another big step forward.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://news.slashdot.org/story/23/11/15/2116232/firefox-going-to-ship-with-wayland-enabled-by-default?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-15T23:20:00.000Z",
          "wordCount": 4158,
          "title": "Firefox Going To Ship With Wayland Enabled By Default",
          "imageUrl": "https://a.fsdn.com/sd/topics/firefox_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/15/219250/microsoft-rebrands-bing-chat-to-copilot?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "In what may be a potentially confusing rebranding move, Microsoft today has rebranded Bing Chat to Copilot, sharing the same brand name as multiple other Microsoft AI products. Search Engine Land reports: Bing is no longer \"your AI-powered copilot for the web.\" However, Microsoft Bing will still provide a combined Search and chat experience. It will just be called CoPilot heading forward. For people who may not want that combined experience, CoPilot will have its own standalone ChatGPT-style experience at https://copilot.microsoft.com/.\n \nMicrosoft said the rebrand is to unify the Copilot experience: \"Our efforts to simplify the user experience and make Copilot more accessible to everyone starts with Bing, our leading experience for the web. Beginning today, Bing Chat and Bing Chat Enterprise are becoming Copilot, with commercial data protection enforced when any eligible user is signed in with Microsoft Entra ID.\"\n \nWhile it's definitely a more unified experience, it also seems a bit confusing because Microsoft's chatbot \"companion\" is used across multiple apps, including Microsoft 365, Edge, Windows and more -- some free, some not. In addition to Bing Chat, Bing Chat Enterprise is also rebranded as Copilot Pro. It offers the same chat functionality with greater commercial data protection for Microsoft 365 subscribers.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/11/15/219250/microsoft-rebrands-bing-chat-to-copilot?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-15T22:40:00.000Z",
          "wordCount": 4667,
          "title": "Microsoft Rebrands Bing Chat To Copilot",
          "imageUrl": "https://a.fsdn.com/sd/topics/ai_64.png"
        },
        {
          "id": "https://hardware.slashdot.org/story/23/11/15/215217/qi2-wireless-charging-spec-is-here-offering-speed-boosts-and-magnets?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "An anonymous reader quotes a report from Ars Technica: If you've only ever used standard Qi chargers with devices that don't have their own schemes, the Wireless Power Consortium's announcement today of the first Qi 2.0 devices being ready to launch before the holidays, with more than 100 in the queue behind them, is great. Qi2 sports a \"Magnetic Power Profile\" (MPP), created with help by Apple's MagSafe team, to help align devices and chargers' coils for faster, more efficient charging. Qi2-certified devices set onto Qi2 chargers can achieve 15 W charging, up from 7.5 W in the standard Qi scheme.\n \nThat brings Qi2 devices up to the same speed as iPhones on MagSafe chargers, and it clears up some consumer confusion about how fast a device might charge on Qi, MagSafe, or proprietary charger…",
          "link": "https://hardware.slashdot.org/story/23/11/15/215217/qi2-wireless-charging-spec-is-here-offering-speed-boosts-and-magnets?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-15T22:00:00.000Z",
          "wordCount": 5386,
          "title": "Qi2 Wireless Charging Spec Is Here, Offering Speed Boosts and Magnets",
          "imageUrl": "https://a.fsdn.com/sd/topics/power_64.png"
        },
        {
          "id": "https://science.slashdot.org/story/23/11/15/1831259/planet-where-it-rains-sand-revealed-by-nasa-telescope?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Nasa's James Webb space telescope has revealed a planet where specks of sand fall as rain, in groundbreaking observations. From a report: The planet, Wasp-107b, lies 200 light years away in the Virgo constellation and had already caught the attention of astronomers because it is very large but very light, earning it the nickname the \"candy floss\" planet. The latest observations give an unprecedented glimpse of a strange and exotic world beyond our solar system that features silicate sand clouds and rain, scorching temperatures, raging winds and the distinct burnt-matches scent of sulphur dioxide. \"Our knowledge of other planets is based on what we know from Earth,\" said Prof Leen Decin, of the Catholic Institute (KU) Leuven and first author of the research. \"That's a very restricted knowledge.\" \n\nThe planet was discovered in 2017 after astronomers spotted a telltale periodic flickering of light from its host star each time the planet passed in front of it. \"It's like a fly in front of a street lamp,\" said Decin. \"You see a slight dimming of the light.\" James Webb takes these observations to the next level by measuring starlight that is filtered through the planet's atmosphere. Because different elements absorb different wavelengths of light, the spectrum of starlight indicates which gases are present. Wasp-107b is similar in mass to Neptune but almost the size of Jupiter, and its vast, diffuse nature allows the James Webb telescope to peer deep into its atmosphere.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://science.slashdot.org/story/23/11/15/1831259/planet-where-it-rains-sand-revealed-by-nasa-telescope?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-15T21:20:00.000Z",
          "wordCount": 4696,
          "title": "Planet Where It Rains Sand Revealed By Nasa Telescope",
          "imageUrl": "https://a.fsdn.com/sd/topics/space_64.png"
        },
        {
          "id": "https://science.slashdot.org/story/23/11/15/1653221/amazon-to-stop-selling-seven-eyedrops-after-fda-warning?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Amazon said on Wednesday that it was removing seven eyedrops products from its website after the Food and Drug Administration warned the company that the eyedrops had not been recognized as safe and effective. From a report: The F.D.A. said in a letter to Andrew Jassy, Amazon's chief executive, on Monday that Amazon had violated federal regulations by selling the eyedrops, which claimed to help with problems including pink eye, dry eyes, eyestrain and floaters. \"These products are especially concerning from a public health perspective,\" the F.D.A. letter said. \"Ophthalmic drug products, which are intended for administration into the eyes, in general pose a greater risk of harm to users because the route of administration for these products bypasses some of the body's natural defenses.\" \n\nThe eyedrops named in the letter are: Similasan Pink Eye Relief, The Goodbye Company Pink Eye, Can-C Eye Drops, Optique 1 Eye Drops, OcluMed Eye Drops, TRP Natural Eyes Floaters Relief, and Manzanilla Sophia Chamomile Herbal Eye Drops. None of the eyedrops appeared to be available for purchase on Amazon on Wednesday morning. The company said in an emailed statement on Wednesday that \"safety is a top priority.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://science.slashdot.org/story/23/11/15/1653221/amazon-to-stop-selling-seven-eyedrops-after-fda-warning?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-15T20:40:00.000Z",
          "wordCount": 4929,
          "title": "Amazon To Stop Selling Seven Eyedrops After FDA Warning",
          "imageUrl": "https://a.fsdn.com/sd/topics/medicine_64.png?refresh=now"
        },
        {
          "id": "https://it.slashdot.org/story/23/11/15/1644244/microsoft-and-nvidia-are-making-it-easier-to-run-ai-models-on-windows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Microsoft and Nvidia want to help developers run and configure AI models on their Windows PCs. During the Microsoft Ignite event on Wednesday, Microsoft announced Windows AI Studio: a new hub where developers can access AI models and tweak them to suit their needs. From a report: Windows AI Studio allows developers to access development tools and models from the existing Azure AI Studio and other services like Hugging Face. It also offers an end-to-end \"guided workspace setup\" with model configuration UI and walkthroughs to fine-tune various small language models (SLMs), such as Microsoft's Phi, Meta's Llama 2, and Mistral. \n\nWindows AI Studio lets developers test the performance of their models using Prompt Flow and Gradio templates as well. Microsoft says it's going to roll out Windows AI Studio as a Visual Studio Code extension in the \"coming weeks.\" Nvidia, similarly, revealed updates to TensorRT-LLM, which the company initially launched for Windows as a way to run large language models (LLMs) more efficiently on H100 GPUs. However, this latest update brings TensorRT-LLM to PCs powered by GeForce RTX 30 and 40 Series GPUs with 8GB of RAM or more.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://it.slashdot.org/story/23/11/15/1644244/microsoft-and-nvidia-are-making-it-easier-to-run-ai-models-on-windows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-15T20:00:00.000Z",
          "wordCount": 4735,
          "title": "Microsoft and Nvidia Are Making It Easier To Run AI Models on Windows",
          "imageUrl": "https://a.fsdn.com/sd/topics/microsoft_64100.png"
        },
        {
          "id": "https://yro.slashdot.org/story/23/11/15/167251/disney-pulls-tv-channels-from-vietnam-govt-concerned-piracy-will-run-riot?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "An anonymous reader writes: A newspaper run by the Communist Party of Vietnam is reporting the \"disappearance\" of a number of popular channels from pay TV packages. Citing National Geographic and Nat Geo Wild as examples, the paper notes they're owned by Disney. Vietnam's Ministry of Information and Communications is said to be \"concerned\" that the withdrawal will allow piracy to run rampant in Vietnam. Multiple high-level trade reports in the U.S. note that piracy has been rampant for years.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://yro.slashdot.org/story/23/11/15/167251/disney-pulls-tv-channels-from-vietnam-govt-concerned-piracy-will-run-riot?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-15T19:20:00.000Z",
          "wordCount": 6926,
          "title": "Disney Pulls TV Channels From Vietnam, Govt 'Concerned' Piracy Will Run Riot",
          "imageUrl": "https://a.fsdn.com/sd/topics/piracy_64.png"
        },
        {
          "id": "https://hardware.slashdot.org/story/23/11/15/1532212/tencent-stockpiled-nvidia-ai-chips-for-a-couple-of-generations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Tencent dismissed concerns that US export controls will constrain its AI development capabilities, at least for the foreseeable future. From a report: The Shenzhen-based company has stockpiled Nvidia's H800 artificial intelligence accelerators, enough to develop its proprietary Hunyuan AI model for at least another couple of generations, President Martin Lau said on an analyst call after earnings on Wednesday. \"Right now we actually have one of the largest inventories of AI chips in China among all the players,\" Lau said. \"We were the first to put in orders for H800 and that allows us to have a pretty good inventory of H800 chips. So we have enough chips to continue our development.\" \n\nThe Biden administration in October escalated export controls on AI semiconductors heading to China, depriving the Asian nation from access to a broad range of the world's best AI-training hardware. The purpose of the measures is to prevent China's military from obtaining the advanced technology, Washington argues, but they're also making business harder for the country's private sector. Elsewhere in China, AI industry veteran Kai-Fu Lee's unicorn startup 01.AI has been buying up the Nvidia chips it needs to develop its own foundation models, with Lee saying the company has enough semiconductors for the next 18 months.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://hardware.slashdot.org/story/23/11/15/1532212/tencent-stockpiled-nvidia-ai-chips-for-a-couple-of-generations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-15T18:40:00.000Z",
          "wordCount": 4940,
          "title": "Tencent Stockpiled Nvidia AI Chips for 'a Couple of Generations'",
          "imageUrl": "https://a.fsdn.com/sd/topics/china_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/15/1639215/microsoft-officially-launches-loop-its-notion-competitor?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Microsoft is officially launching its Notion-like productivity and collaboration app called Loop. From a report: Loop lets you use flexible, collaborative workspaces and pages to make it easier to cooperate on work. If you're familiar with Notion's interface at all, Loop looks and feels remarkably similar -- right down to the ability to easily access a bunch of tools and formatting options by typing the forward slash key (which pulls up what Microsoft calls the \"insert menu\"). But because Loop is built by Microsoft, that means it has some useful integrations with other Microsoft software.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/11/15/1639215/microsoft-officially-launches-loop-its-notion-competitor?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-15T18:00:00.000Z",
          "wordCount": 5855,
          "title": "Microsoft Officially Launches Loop, Its Notion Competitor",
          "imageUrl": "https://a.fsdn.com/sd/topics/microsoft_64100.png"
        },
        {
          "id": "https://news.slashdot.org/story/23/11/15/1550211/eu-agrees-law-to-curb-methane-emissions-from-fossil-fuel-industry?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "The EU has struck a deal that will force the fossil fuel industry to rein in dangerous methane pollution. From a report: Under the proposed law, which is the first of its kind, coal, oil and gas companies would be required to report their methane emissions and take steps to avoid them. The measures include finding and fixing leaks, and limiting wasteful practices such as venting and flaring gas by 2027. Jutta Paulus, a German MEP with the Green grouping who worked on the proposal, said: \"Finally, the EU tackles the second most important greenhouse gas with ambitious measures. Less methane emissions mean more climate protection and more energy sovereignty.\" \n\nMethane has more than 80 times the global heating power of carbon dioxide over a 20-year timespan but does not last as long in the atmosphere. Cutting methane emissions is seen as a cheap and easy way to stop extreme weather growing more violent in the short-term. The new EU rules, which were agreed on Wednesday by the European parliament and European Council, mean fossil fuel companies must try to repair leaks no more than five days after finding them, and fully fix them within a month. By the end of next year, operators will have to survey their existing sites and submit action plans to find and fix methane leaks.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://news.slashdot.org/story/23/11/15/1550211/eu-agrees-law-to-curb-methane-emissions-from-fossil-fuel-industry?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-15T17:20:00.000Z",
          "wordCount": 6238,
          "title": "EU Agrees Law To Curb Methane Emissions From Fossil Fuel Industry",
          "imageUrl": "https://a.fsdn.com/sd/topics/eu_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/15/1633226/microsoft-unveils-its-first-custom-designed-ai-cloud-chips?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Microsoft unveiled its first homegrown AI chip and cloud-computing processor in an attempt to take more control of its technology and ramp up its offerings in the increasingly competitive market for AI computing. The company also announced new software that lets clients design their own AI assistants. From a report: The Maia 100 chip, announced at the company's annual Ignite conference in Seattle on Wednesday, will provide Microsoft Azure cloud customers with a new way run AI programs that generate content. Microsoft is already testing the chip with its Bing and Office AI products, said Rani Borkar, a vice president who oversees Azure's chip unit. Microsoft's main AI partner, ChatGPT maker OpenAI, is also testing the processor. Both Maia and the server chip, Cobalt, will debut in some Microsoft data centers early next year. \n\nMicrosoft's multi-year investment shows how critical chips have become to gaining an edge in both AI and the cloud. Making them in-house lets companies wring performance and price benefits from the hardware. The initiative also could insulate Microsoft from becoming overly dependent on any one supplier, a vulnerability currently underscored by the industrywide scramble for Nvidia's AI chips. Microsoft's push into processors follows similar moves by cloud rivals. Amazon.com Inc. acquired a chip maker in 2015 and sells services built on several kinds of cloud and AI chips. Google began letting customers use its AI accelerator processors in 2018.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/11/15/1633226/microsoft-unveils-its-first-custom-designed-ai-cloud-chips?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-15T16:40:00.000Z",
          "wordCount": 4534,
          "title": "Microsoft Unveils Its First Custom-Designed AI, Cloud Chips",
          "imageUrl": "https://a.fsdn.com/sd/topics/microsoft_64100.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/11/15/1544227/google-is-going-to-let-you-annotate-search-results?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Ever wanted to add your own annotations to search results you find on Google? With Google's new \"Notes\" experiment, launching Wednesday as an opt-in feature through Search Labs, you'll be able to. From a report: If you've opted in to Notes, buttons to add and see notes will appear under search results and under articles on Discover in the Google app. When you create a note, you can add colorful fonts and images. During a briefing, Google showed me a note for an article about different kinds of frosting that had green text, an image of a cake, and a heart sticker. (At the bottom of the note, there was a link to the article the note was about.) \n\nIf you post a note, it should show up \"within minutes,\" unless it's flagged for human review, Google VP Cathy Edwards said in an interview with The Verge. When you look at all of the notes for a link, what's shown will be ranked dynamically based on things like the user's query and a note's relevance to the content on the page.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://tech.slashdot.org/story/23/11/15/1544227/google-is-going-to-let-you-annotate-search-results?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-15T16:00:00.000Z",
          "wordCount": 6211,
          "title": "Google is Going To Let You Annotate Search Results",
          "imageUrl": "https://a.fsdn.com/sd/topics/topicgoogle_fb.gif"
        },
        {
          "id": "https://tech.slashdot.org/story/23/11/15/1456240/china-claims-worlds-fastest-internet-with-12-terabit-per-second-network?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Huawei and China Mobile have built a 3,000 kilometer (1,860-mile) internet network linking Beijing to the south, which the country is touting as its latest technological breakthrough. From a report: The two firms teamed up with Tsinghua University and research provider Cernet.com to build what they claim is the world's first internet network to achieve a \"stable and reliable\" bandwidth of 1.2 terabits per second, several times faster than typical speeds around the world. Trials began July 31 and it's since passed various tests verifying that milestone, the university said in a statement. \n\nTsinghua, Chinese President Xi Jinping's alma mater, is plugging the project as an industry-first built entirely on homegrown technology, and credits Huawei prominently in its statement. The Chinese firm in August made waves when it released a 5G smartphone with a sophisticated made-in-China processor, inspiring celebration in Chinese state and social media. That event also spurred debate in Washington about whether the Biden administration has gone far enough in attempts to contain Chinese technological achievement.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://tech.slashdot.org/story/23/11/15/1456240/china-claims-worlds-fastest-internet-with-12-terabit-per-second-network?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-15T15:20:00.000Z",
          "wordCount": 5978,
          "title": "China Claims World's Fastest Internet With 1.2 Terabit-Per-Second Network",
          "imageUrl": "https://a.fsdn.com/sd/topics/china_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/11/14/2324205/google-stopped-selling-its-fitbit-products-in-almost-30-countries?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "Fitbit is active in only 23 countries after leaving Mexico, South Africa, and all Latin American countries. \"We communicated that we will stop selling Fitbit products in select countries in order to align our hardware portfolio to map closer to Pixel's regional availability,\" a Google spokesperson confirmed to Cord Cutters News via email. From the report: The move marks a phasing out of Fitbit products after the Big Tech company acquired wearable company in 2021. Last month, Fitbit said it would remove itself from Asian markets Hong Kong, Korea, Malaysia, Thailand, and the Philippines, along with European markets Croatia, Czech Republic, Estonia, Hungary, Latvia, Lithuania, Luxembourg, Poland, Portugal, Romania, and Slovakia. It's possible Google is removing Fitbit and Nest from the European markets because they don't have a Google Store support. If that changes, Fitbit products and Nest Aware subscriptions could return. New products like the Pixel Watch could also arrive for the first time. \"We remain committed to our customers and have not made any changes that impact the existing Fitbit devices they already own. Existing Fitbit customers will continue to have access to the same customer support, warranties will still be honored, and products will continue to receive software and security updates,\" the Google spokesperson said.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://tech.slashdot.org/story/23/11/14/2324205/google-stopped-selling-its-fitbit-products-in-almost-30-countries?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-15T00:45:00.000Z",
          "wordCount": 4023,
          "title": "Google Stopped Selling Its Fitbit Products In Almost 30 Countries",
          "imageUrl": "https://a.fsdn.com/sd/topics/topicgoogle_fb.gif"
        },
        {
          "id": "https://it.slashdot.org/story/23/11/14/2257235/intel-fixes-high-severity-cpu-bug-that-causes-very-strange-behavior?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "An anonymous reader quotes a report from Ars Technica: Intel on Tuesday pushed microcode updates to fix a high-severity CPU bug that has the potential to be maliciously exploited against cloud-based hosts. The flaw, affecting virtually all modern Intel CPUs, causes them to \"enter a glitch state where the normal rules don't apply,\" Tavis Ormandy, one of several security researchers inside Google who discovered the bug, reported. Once triggered, the glitch state results in unexpected and potentially serious behavior, most notably system crashes that occur even when untrusted code is executed within a guest account of a virtual machine, which, under most cloud security models, is assumed to be safe from such faults. Escalation of privileges is also a possibility.\n \nThe bug, tracked under the …",
          "link": "https://it.slashdot.org/story/23/11/14/2257235/intel-fixes-high-severity-cpu-bug-that-causes-very-strange-behavior?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-15T00:02:00.000Z",
          "wordCount": 4360,
          "title": "Intel Fixes High-Severity CPU Bug That Causes 'Very Strange Behavior'",
          "imageUrl": "https://a.fsdn.com/sd/topics/bug_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/14/2244247/48-nation-bloc-to-crack-down-on-using-crypto-assets-to-avoid-tax?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "A bloc of 48 nations have developed the Crypto-Asset Reporting Framework (CARF), aimed at standardizing reporting requirements for crypto assets to address concerns related to money laundering and tax evasion. It's set to be implemented by 2027. The Register reports: Developed by the Organisation for Economic Co-operation and Development (OECD), the CARF was developed under the 168-member Global Forum on Transparency and Exchange of Information for Tax Purposes, with the G20 and the Organisation for Economic Co-operation and Development looking on approvingly and lending a hand. As the name implies, that Forum is all about sharing data so that each nation's tax authorities have the information they need to understand money movements and make sure they can see what they're allowed to tax. T…",
          "link": "https://slashdot.org/story/23/11/14/2244247/48-nation-bloc-to-crack-down-on-using-crypto-assets-to-avoid-tax?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-14T23:20:00.000Z",
          "wordCount": 4353,
          "title": "48-Nation Bloc To Crack Down On Using Crypto Assets To Avoid Tax",
          "imageUrl": "https://a.fsdn.com/sd/topics/bitcoin_64.png"
        },
        {
          "id": "https://news.slashdot.org/story/23/11/14/2231255/youtube-adapts-its-policies-for-the-coming-surge-of-ai-videos?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "Sarah Perez reports via TechCrunch: YouTube today announced how it will approach handling AI-created content on its platform with a range of new policies surrounding responsible disclosure as well as new tools for requesting the removal of deepfakes, among other things. The company says that, although it already has policies that prohibit manipulated media, AI necessitated the creation of new policies because of its potential to mislead viewers if they don't know the video has been \"altered or synthetically created.\" One of the changes that will roll out involves the creation of new disclosure requirements for YouTube creators. Now, they'll have to disclose when they've created altered or synthetic content that appears realistic, including videos made with AI tools. For instance, this disc…",
          "link": "https://news.slashdot.org/story/23/11/14/2231255/youtube-adapts-its-policies-for-the-coming-surge-of-ai-videos?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-14T22:40:00.000Z",
          "wordCount": 4847,
          "title": "YouTube Adapts Its Policies For the Coming Surge of AI Videos",
          "imageUrl": "https://a.fsdn.com/sd/topics/youtube_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/11/14/2147236/rivian-software-update-bricks-infotainment-system-fix-not-obvious?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "BeauHD",
          "description": "An anonymous reader quotes a report from Electrek: On Monday, Rivian released an incremental software update 2023.42, which bricked the infotainment system in R1Ses and R1Ts. The company is frantically working on a fix, but it might not be an OTA. [...] The vehicles are drivable, but software and displays go black. It appears that the 2023.42 software update hangs at 90% on the vehicle screen or 50% on the app screen, and then the vehicle screens black out. All systems appear to still work except for the displays. At the moment, it appears that Amazon vans are not impacted. Update: The company has acknowledged the issue with affected customers but has yet to issue a fix or plan to fix. Rivian's vice president of software engineering, Wassim Bensaid, took to Reddit to update users on the situation, writing: \"Hi All, We made an error with the 2023.42 OTA update -- a fat finger where the wrong build with the wrong security certificates was sent out. We cancelled the campaign and we will restart it with the proper software that went through the different campaigns of beta testing. Service will be contacting impacted customers and will go through the resolution options. That may require physical repair in some cases. This is on us -- we messed up. Thanks for your support and your patience as we go through this.\n \n*Update 1 (11/13, 10:45 PM PT): The issue impacts the infotainment system. In most cases, the rest of the vehicle systems are still operational. A vehicle reset or sleep cycle will not solve the issue. We are validating the best options to address the issue for the impacted vehicles. Our customer support team is prioritizing support for our customers related to this issue. Thank you.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://tech.slashdot.org/story/23/11/14/2147236/rivian-software-update-bricks-infotainment-system-fix-not-obvious?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-14T22:00:00.000Z",
          "wordCount": 7988,
          "title": "Rivian Software Update Bricks Infotainment System, Fix Not Obvious",
          "imageUrl": "https://a.fsdn.com/sd/topics/transportation_64.png"
        },
        {
          "id": "https://news.slashdot.org/story/23/11/14/1930229/delhi-plans-to-unleash-cloud-seeding-in-its-battle-against-deadly-smog?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "India's capital, New Delhi, is preparing a new weapon in the fight against deadly air pollution: cloud seeding. From a report: The experiment, which could take place as early as next week, would introduce chemicals like silver iodide into a cloudy sky to create rain and, it's hoped, wash away the fine particulate matter hovering over one of the world's largest cities. The need is desperate. Delhi has already tried traffic restriction measures, multimillion-dollar air filtration towers, and the use of fleets of water-spraying trucks to dissolve the particulate matter in the air -- but to no avail. \n\nThe use of cloud seeding, if it goes ahead, would be controversial. \"It's not at all a good use of resources because it's not a solution, it's like a temporary relief,\" says Avikal Somvanshi, a …",
          "link": "https://news.slashdot.org/story/23/11/14/1930229/delhi-plans-to-unleash-cloud-seeding-in-its-battle-against-deadly-smog?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-14T21:20:00.000Z",
          "wordCount": 5583,
          "title": "Delhi Plans To Unleash Cloud Seeding in Its Battle Against Deadly Smog",
          "imageUrl": "https://a.fsdn.com/sd/topics/earth_64.png"
        },
        {
          "id": "https://news.slashdot.org/story/23/11/14/1922218/us-privacy-groups-urge-senate-not-to-ram-through-nsa-spying-powers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Some of the United States' largest civil liberties groups are urging Senate majority leader Chuck Schumer not to pursue a short-term extension of the Section 702 surveillance program slated to sunset on December 31. From a report: The more than 20 groups -- Demand Progress, the Brennan Center for Justice, American Civil Liberties Union, and Asian Americans Advancing Justice among them -- oppose plans that would allow the program to continue temporarily by amending \"must-pass\" legislation, such as the bill needed now to avert a government shutdown by Friday, or the National Defense Authorization Act, annual legislation set to dictate $886 billion in national security spending across the Pentagon and US Department of Energy in 2024. \n\n\"In its current form, [Section 702] is dangerous to our liberties and our democracy, and it should not be renewed for any length of time without robust debate, an opportunity for amendment, and -- ultimately -- far-reaching reforms,\" a letter from the groups to Schumer says. It adds that any attempt to prolong the program by rushed amendment \"would demonstrate blatant disregard for the civil liberties and civil rights of the American people.\"\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://news.slashdot.org/story/23/11/14/1922218/us-privacy-groups-urge-senate-not-to-ram-through-nsa-spying-powers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-14T20:40:00.000Z",
          "wordCount": 4975,
          "title": "US Privacy Groups Urge Senate Not To Ram Through NSA Spying Powers",
          "imageUrl": "https://a.fsdn.com/sd/topics/usa_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/14/1817247/amd-powered-frontier-remains-fastest-supercomputer-in-the-world?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "The Top500 organization released its semi-annual list of the fastest supercomputers in the world, with the AMD-powered Frontier supercomputer retaining its spot at the top of the list with 1.194 Exaflop/s (EFlop/s) of performance, fending off a half-scale 585.34 Petaflop/s (PFlop/s) submission from the Argonne National Laboratory's Intel-powered Aurora supercomputer. From a report: Argonne's submission, which only employs half of the Aurora system, lands at the second spot on the Top500, unseating Japan's Fugaku as the second-fastest supercomputer in the world. Intel also made inroads with 20 new supercomputers based on its Sapphire Rapids CPUs entering the list, but AMD's EPYC continues to take over the Top500 as it now powers 140 systems on the list -- a 39% year-over-year increase. \n\nIntel and Argonne are currently still working to bring Arora fully online for users in 2024. As such, the Aurora submission represented 10,624 Intel CPUs and 31,874 Intel GPUs working in concert to deliver 585.34 PFlop/s at a total of 24.69 megawatts (MW) of energy. In contrast, AMD's Frontier holds the performance title at 1.194 EFlop/s, which is more than twice the performance of Aurora, while consuming a comparably miserly 22.70 MW of energy (yes, that's less power for the full Frontier supercomputer than half of the Aurora system). Aurora did not land on the Green500, a list of the most power-efficient supercomputers, with this submission, but Frontier continues to hold eighth place on that list. However, Aurora is expected to eventually reach up to 2 EFlop/s of performance when it comes fully online. When complete, Auroroa will have 21,248 Xeon Max CPUs and 63,744 Max Series 'Ponte Vecchio' GPUs spread across 166 racks and 10,624 compute blades, making it the largest known single deployment of GPUs in the world. The system leverages HPE Cray EX â\" Intel Exascale Compute Blades and uses HPE's Slingshot-11 networking interconnect.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/11/14/1817247/amd-powered-frontier-remains-fastest-supercomputer-in-the-world?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-14T20:00:00.000Z",
          "wordCount": 5439,
          "title": "AMD-Powered Frontier Remains Fastest Supercomputer in the World",
          "imageUrl": "https://a.fsdn.com/sd/topics/amd_64.png"
        },
        {
          "id": "https://it.slashdot.org/story/23/11/14/1756202/a-lost-bitcoin-wallet-passcode-helped-uncover-a-major-security-flaw?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "After a tech entrepreneur and investor lost his password for retrieving $100,000 in bitcoin and hired experts to break open the wallet where he kept it, they failed to help him. But in the process, they discovered a way to crack enough other software wallets to steal $1 billion or more. From a report: On Tuesday, the team is releasing information about how they did it. They hope it's enough data that the owners of millions of wallets will realize they are at risk and move their money, but not so much data that criminals can figure out how to pull off what would be one of the largest heists of all time. \n\nTheir start-up, Unciphered, has worked for months to alert more than a million people that their wallets are at risk. Millions more haven't been told, often because their wallets were created at cryptocurrency websites that have gone out of business. The story of those wallets' vulnerabilities underscores the enormous risk in experimental currencies, beyond their wild fluctuations in value and fast-changing regulations. Many wallets were created with code containing profound flaws, and the companies that used that code can disappear. Beyond that, it is a sobering reminder that underneath software infrastructure of all kinds, even ones explicitly dedicated to securing funds, are open-source programs that few or no people oversee. \"Open-source ages like milk. It will eventually go bad,\" said Chris Wysopal, a co-founder of security company Veracode who advised Unciphered as it sorted through the problem.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://it.slashdot.org/story/23/11/14/1756202/a-lost-bitcoin-wallet-passcode-helped-uncover-a-major-security-flaw?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-14T19:20:00.000Z",
          "wordCount": 5346,
          "title": "A Lost Bitcoin Wallet Passcode Helped Uncover a Major Security Flaw",
          "imageUrl": "https://a.fsdn.com/sd/topics/security_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/14/1750257/google-deepminds-weather-ai-can-forecast-extreme-weather-faster-and-more-accurately?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "In research published in Science today, Google DeepMind's model, GraphCast, was able to predict weather conditions up to 10 days in advance, more accurately and much faster than the current gold standard. From a report: GraphCast outperformed the model from the European Centre for Medium-Range Weather Forecasts (ECMWF) in more than 90% of over 1,300 test areas. And on predictions for Earth's troposphere -- the lowest part of the atmosphere, where most weather happens -- GraphCast outperformed the ECMWF's model on more than 99% of weather variables, such as rain and air temperature. Crucially, GraphCast can also offer meteorologists accurate warnings, much earlier than standard models, of conditions such as extreme temperatures and the paths of cyclones. In September, GraphCast accurately predicted that Hurricane Lee would make landfall in Nova Scotia nine days in advance, says Remi Lam, a staff research scientist at Google DeepMind. Traditional weather forecasting models pinpointed the hurricane to Nova Scotia only six days in advance. \n\n[...] Traditionally, meteorologists use massive computer simulations to make weather predictions. They are very energy intensive and time consuming to run, because the simulations take into account many physics-based equations and different weather variables such as temperature, precipitation, pressure, wind, humidity, and cloudiness, one by one. GraphCast uses machine learning to do these calculations in under a minute. Instead of using the physics-based equations, it bases its predictions on four decades of historical weather data. GraphCast uses graph neural networks, which map Earth's surface into more than a million grid points. At each grid point, the model predicts the temperature, wind speed and direction, and mean sea-level pressure, as well as other conditions like humidity. The neural network is then able to find patterns and draw conclusions about what will happen next for each of these data points.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/11/14/1750257/google-deepminds-weather-ai-can-forecast-extreme-weather-faster-and-more-accurately?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-14T18:40:00.000Z",
          "wordCount": 5716,
          "title": "Google DeepMind's Weather AI Can Forecast Extreme Weather Faster and More Accurately",
          "imageUrl": "https://a.fsdn.com/sd/topics/ai_64.png"
        },
        {
          "id": "https://slashdot.org/story/23/11/14/1738233/nothing-is-bringing-imessage-to-its-android-phone?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "Nothing Phone 2 owners get blue bubbles now. The company shared it has added iMessage to its newest phone through a new \"Nothing Chats\" app powered by the messaging platform Sunbird. From a report: The feature will be available to users in North America, the EU, and other European countries starting this Friday, November 17th. Nothing writes on its page that it's doing this because \"messaging services are dividing phone users,\" and it wants \"to break those barriers down.\" But doing so here requires you to trust Sunbird. Nothing's FAQ says Sunbird's \"architecture provides a system to deliver a message from one user to another without ever storing it at any point in its journey,\" and that messages aren't stored on its servers. \n\nMarques Brownlee has also had a preview of Nothing Chats. He confirmed with Nothing that, similar to how other iMessage-to-Android bridge services have worked before, \"...it's literally signing in on some Mac Mini in a server farm somewhere, and that Mac Mini will then do all of the routing for you to make this happen.\" Nothing's US head of PR, Jane Nho, told The Verge in an email that Sunbird stores user iCloud credentials as a token \"in an encrypted database\" and associated with one of its Mac Minis in the US or Europe, depending on the user's location, that then act as a relay for iMessages sent via the app. She added that, after two weeks of inactivity, Sunbird deletes the account information.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://slashdot.org/story/23/11/14/1738233/nothing-is-bringing-imessage-to-its-android-phone?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-14T18:00:00.000Z",
          "wordCount": 11931,
          "title": "Nothing is Bringing iMessage To Its Android Phone",
          "imageUrl": "https://a.fsdn.com/sd/topics/android_64.png"
        },
        {
          "id": "https://it.slashdot.org/story/23/11/14/1620218/the-2000-phones-that-let-anyone-make-robocalls?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "An anonymous reader writes: Videos collected by 404 Media over months give a peek into the world of spoofing numbers, automated call scripts, and a specific seller of the phones. From the report: \"Alright lads,\" a man sitting in the passenger seat of a moving car says in a heavy British accent. In his left hand he holds a special phone he is showing off to his clients, while with the other he films his demonstration which was later uploaded to Telegram. \"I'm only going to say it once, yeah. You swipe, and it's gone,\" he continues, demonstrating one app installed that can instantly destroy data stored on the device. The phone in question is one from \"Russiancoms,\" an underground outfit that sells the devices for just under $2,000 each. For that price, customers get a laundry list of features: the ability to spoof phone numbers, play hold music, and have a computerized voice read pre-determined scripts. While Russiancoms does not acknowledge in its Telegram channel what the phones might really be for, those are features well suited to committing fraud. \n\nThe Russiancoms Telegram channel periodically deletes its videos and other messages, but 404 Media has been archiving many of them for months. They provide insight into a little known industry of fraud phones, ones that make it easy for anyone to enter the world of robocalling or other scams. While much of the underground phone industry has been focused on providing secure communications to criminals -- companies like Phantom Secure, Encrochat, and Sky for example -- Russiancoms and similar companies appear to cater to a different use case: enabling people to make calls that fraudulently appear to come from someone else. A common tool in the underground is also so-called Russian SIMs, which can spoof numbers in some cases. Russiancoms' phones, however, are more fully featured.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://it.slashdot.org/story/23/11/14/1620218/the-2000-phones-that-let-anyone-make-robocalls?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-14T17:20:00.000Z",
          "wordCount": 5359,
          "title": "The $2,000 Phones That Let Anyone Make Robocalls",
          "imageUrl": "https://a.fsdn.com/sd/topics/it_64.png"
        },
        {
          "id": "https://it.slashdot.org/story/23/11/14/1628239/fbi-struggled-to-disrupt-dangerous-casino-hacking-gang-cyber-responders-say?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "The U.S. Federal Bureau of Investigation (FBI) has struggled to stop a hyper-aggressive cybercrime gang that's been tormenting corporate America over the last two years, according to nine cybersecurity responders, digital crime experts and victims. Reuters: For more than six months, the FBI has known the identities of at least a dozen members tied to the hacking group responsible for the devastating September break-ins at casino operators MGM Resorts International and Caesars Entertainment, according to four people familiar with the investigation. Industry executives have told Reuters they were baffled by an apparent lack of arrests despite many of the hackers being based in America. \"I would love for somebody to explain it to me,\" said Michael Sentonas, president of CrowdStrike, one of the firms leading the response effort to the hacks. \n\n\"For such a small group, they are absolutely causing havoc,\" Sentonas told Reuters in an interview last month. Sentonas said the hackers were \"known\" but didn't provide specifics. He did say, \"I think there is a failure here.\" Asked who was responsible for the failure, Sentonas said, \"law enforcement.\" [...] Dubbed by some security professionals as \"Scattered Spider,\" the hacking group has been active since 2021 but it grabbed headlines following a series of intrusions at several high profile American companies.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://it.slashdot.org/story/23/11/14/1628239/fbi-struggled-to-disrupt-dangerous-casino-hacking-gang-cyber-responders-say?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-14T16:40:00.000Z",
          "wordCount": 5357,
          "title": "FBI Struggled To Disrupt Dangerous Casino Hacking Gang, Cyber Responders Say",
          "imageUrl": "https://a.fsdn.com/sd/topics/security_64.png"
        },
        {
          "id": "https://science.slashdot.org/story/23/11/14/1548238/ai-could-predict-heart-attack-risk-up-to-10-years-in-the-future-finds-oxford-study?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "AI could be used to predict if a person is at risk of having a heart attack up to 10 years in the future, a study has found. From a report: The technology could save thousands of lives while improving treatment for almost half of patients, researchers at the University of Oxford said. The study, funded by the British Heart Foundation (BHF), looked at how AI might improve the accuracy of cardiac CT scans, which are used to detect blockages or narrowing in the arteries. \n\nProf Charalambos Antoniades, chair of cardiovascular medicine at the BHF and director of the acute multidisciplinary imaging and interventional centre at Oxford, said: \"Our study found that some patients presenting in hospital with chest pain -- who are often reassured and sent back home -- are at high risk of having a heart attack in the next decade, even in the absence of any sign of disease in their heart arteries. Here we demonstrated that providing an accurate picture of risk to clinicians can alter, and potentially improve, the course of treatment for many heart patients.\" \n\nAbout 350,000 people in the UK have a CT scan each year but, according to the BHF, many patients later die of heart attacks due to their failure in picking up small, undetectable narrowings. Researchers analysed the data of more than 40,000 patients undergoing routine cardiac CT scans at eight UK hospitals, with a median follow-up time of 2.7 years. The AI tool was tested on a further 3,393 patients over almost eight years and was able to accurately predict the risk of a heart attack. AI-generated risk scores were then presented to medics for 744 patients, with 45% having their treatment plans altered by medics as a result.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://science.slashdot.org/story/23/11/14/1548238/ai-could-predict-heart-attack-risk-up-to-10-years-in-the-future-finds-oxford-study?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-14T16:00:00.000Z",
          "wordCount": 5478,
          "title": "AI Could Predict Heart Attack Risk Up To 10 Years in the Future, Finds Oxford Study",
          "imageUrl": "https://a.fsdn.com/sd/topics/ai_64.png"
        },
        {
          "id": "https://tech.slashdot.org/story/23/11/14/1450226/google-sues-men-who-weaponized-dmca-notices-to-crush-competition?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "author": "msmash",
          "description": "An anonymous reader writes: Two men who allegedly used 65 Google accounts to bombard Google with fraudulent DMCA takedown notices targeting up to 620,000 URLs, have been named in a Google lawsuit filed in California on Monday. Google says the men weaponized copyright law's notice-and-takedown system to sabotage competitors' trade, while damaging the search engine's business and those of its customers.\n\n\n\n\n\n\n\nRead more of this story at Slashdot.",
          "link": "https://tech.slashdot.org/story/23/11/14/1450226/google-sues-men-who-weaponized-dmca-notices-to-crush-competition?utm_source=rss1.0mainlinkanon&utm_medium=feed",
          "publishedOn": "2023-11-14T15:20:00.000Z",
          "wordCount": 6375,
          "title": "Google Sues Men Who Weaponized DMCA Notices To Crush Competition",
          "imageUrl": "https://a.fsdn.com/sd/topics/topicgoogle_fb.gif"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}